{
  "nodes": [
    {
      "id": 1,
      "title": "CMPUT 174",
      "desc": "CMPUT 174 and 175 use a problem-driven approach to introduce the fundamental ideas of Computing Science. Emphasis is on the underlying process behind the solution, independent of programming language or style. Basic notions of state, control flow, data structures, recursion, modularization, and testing are introduced through solving simple problems in a variety of domains such as text analysis, map navigation, game search, simulation, and cryptography. Students learn to program by reading and modifying existing programs as well as writing new ones. No prior programming experience is necessary. Prerequisite: Math 30 or 30-1. See Note (1) above. Credit cannot be obtained for CMPUT 174 if credit has already been obtained for CMPUT 274 or 275, except with permission of the Department.",
      "color": "#3f87a6"
    },
    {
      "id": 2,
      "title": "CMPUT 175",
      "desc": "A continuation of CMPUT 174, revisiting topics of greater depth and complexity. More sophisticated notions such as objects, functional programming, and Abstract Data Types are explored. Various algorithms, including popular searching and sorting algorithms, are studied and compared in terms of time and space efficiency. Upon completion of this two course sequence, students from any discipline should be able to build programs to solve basic problems in their area, and will be prepared to take more advanced Computing Science courses. Prerequisite: CMPUT 174 or SCI 100. Credit cannot be obtained for CMPUT 175 if one already has credit for CMPUT 275, except with permission of the Department.",
      "color": "#3f87a6"
    },
    {
      "id": 5,
      "title": "CMPUT 201",
      "desc": "Introduction to the principles, methods, tools, and practices of the professional programmer. The lectures focus on the fundamental principles of software engineering based on abstract data types and their implementations. The laboratories offer an intensive apprenticeship to the aspiring software developer. Students use C and software development tools of the Unix environment. Prerequisite: CMPUT 175. Credit cannot be obtained for CMPUT 201 if credit has been obtained for CMPUT 275, except with permission of the Department.",
      "color": "#3f87a6"
    },
    {
      "id": 6,
      "title": "CMPUT 204",
      "desc": "The first of two courses on algorithm design and analysis, with emphasis on fundamentals of searching, sorting, and graph algorithms. Examples include divide and conquer, dynamic programming, greedy methods, backtracking, and local search methods, together with analysis techniques to estimate program efficiency. Prerequisites: CMPUT 175 or 275 and CMPUT 272; one of MATH 100, 113, 114, 117, 134, 144, 154, or SCI 100.",
      "color": "#3f87a6"
    },
    {
      "id": 7,
      "title": "CMPUT 206",
      "desc": "An introduction to basic digital image processing theory, and the tools that make advanced image manipulation possible for ordinary users. Image processing is important in many applications: editing and processing photographs, special effects for movies, drawing animated characters starting with photographs, analyzing and enhancing remote imagery, and detecting suspects from surveillance cameras. Image processing concepts are introduced using tools like Photoshop and GIMP. Exposure to simple image processing programming with Java and MATLAB. This course is preparation for more advanced courses in the Digital Media area. Prerequisites: Any introductory-level Computing Science course, plus knowledge of introductory-level MATH and STAT; or consent of the instructor or SCI 100. Open to students in the Faculty of Arts, Engineering and Sciences; others require consent of the instructor.",
      "color": "#3f87a6"
    },
    {
      "id": 9,
      "title": "CMPUT 229",
      "desc": "Number representation, computer architecture and organization, instruction-set architecture, assembly-level programming, procedures, stack frames, memory access through pointers, exception handling, computer arithmetic, floating-point representation, datapath, control logic, pipelining, memory hierarchy, virtual memory. Prerequisite: CMPUT 175 or 274. Corequisite: one of CMPUT 201 or 275. Credit may be obtained in only one of CMPUT 229, E E 380 or ECE 212.",
      "color": "#3f87a6"
    },
    {
      "id": 12,
      "title": "CMPUT 261",
      "desc": "Introduction to artificial intelligence focusing on techniques for building intelligent software systems and agents. Topics include search and problem-solving techniques, knowledge representation and reasoning, reasoning and acting under uncertainty, machine learning and neural networks. Prerequisites: one of STAT 141, 151, 235, or 265, or SCI 151. Corequisites: CMPUT 204 or 275.",
      "color": "#3f87a6"
    },
    {
      "id": 13,
      "title": "CMPUT 267",
      "desc": "This course introduces the fundamental statistical, mathematical, and computational concepts in analyzing data. The goal for this introductory course is to provide a solid foundation in the mathematics of machine learning, in preparation for more advanced machine learning concepts. The learning outcomes are to become more comfortable with underlying concepts in machine learning, including how to formalize learning problems using probability and statistics; how models can be estimated from data; what sound estimation principles look like; how generalization is  achieved; and how to evaluate the performance of learned models. Specific topics include: basic probability and optimization concepts, maximum likelihood, linear regression and polynomial regression, classification with logistic regression and regularization. Prerequisites: CMPUT 174 or 274; one of MATH 100, 114, 117, 134, 144, or 154. Corequisites: CMPUT 175 or 275; CMPUT 272; MATH 125 or 127; one of STAT 141, 151, 235, or 265, or SCI 151.",
      "color": "#3f87a6"
    },
    {
      "id": 14,
      "title": "CMPUT 272",
      "desc": "An introduction to the tools of set theory, logic, and induction, and their use in the practice of reasoning about algorithms and programs. Basic set theory; the notion of a function; counting; propositional and predicate logic and their proof systems; inductive definitions and proofs by induction; program specification and correctness. Prerequisites: Any 100-level CMPUT course, CMPUT 274 or SCI 100.",
      "color": "#3f87a6"
    },
    {
      "id": 15,
      "title": "CMPUT 274",
      "desc": "This is part 1 of a 2 sequence intensive problem-based introduction to Computing Science. In part 1, the key concepts of procedural programming, basic algorithm design and analysis (lists, queues, trees, sorting, searching), and reactive interfacing with the world are learned by solving a series of problems using the Arduino platform and C/C++. The use of a resource-limited processor with no operating system opens up the inner workings of computing. Development is done using the Linux operating system with the exposed compiler tool chain. Prerequisites: No specific programming experience or discrete-math background is assumed. Math 30 or 31. Note: this course is taught in studio-style, where lectures and labs are blended into 3 hour sessions, twice a week. Enrollment is limited by the capacity of the combined lecture/lab facilities. Credit cannot be obtained for CMPUT 274 if one already has credit for any of CMPUT 174, 175, or 201, except with permission of the Department.",
      "color": "#3f87a6"
    },
    {
      "id": 17,
      "title": "CMPUT 291",
      "desc": "Basic concepts in computer data organization and information processing; entity-relationship model; relational model; SQL and other relational query languages; storage architecture; physical organization of data; access methods for relational data. Programming experience (e.g., Python) is required for the course project. Prerequisites: CMPUT 175 or 274, and 272. Corequisite: one of CMPUT 201 or 275.",
      "color": "#3f87a6"
    },
    {
      "id": 31,
      "title": "CMPUT 301",
      "desc": "Object-oriented design and analysis, with interactive applications as the primary example. Topics include: software process; revision control; Unified Modeling Language (UML); requirements; software architecture, design patterns, frameworks, design guidelines; unit testing; refactoring; software tools.  Prerequisite: CMPUT 201 or 275. This course may not be taken for credit if credit has been obtained in MIS 419.",
      "color": "#3f87a6"
    },
    {
      "id": 33,
      "title": "CMPUT 304",
      "desc": "The second course of a two-course sequence on algorithm design. Emphasis on principles of algorithm design. Categories of algorithms such as divide-and-conquer, greedy algorithms, dynamic programming; analysis of algorithms; limits of algorithm design; NP-completeness; heuristic algorithms. Prerequisites: CMPUT 204; one of STAT 141, 151, 235 or 265 or SCI 151; one of MATH 225, 227, 228; or consent of the instructor.",
      "color": "#3f87a6"
    },
    {
      "id": 34,
      "title": "CMPUT 307",
      "desc": "An introductory course on the theory and applications of computer based 3D modeling and animation. The course will cover a selection of topics from overview of tools supporting modeling and animation, automatically generating 3D models, and animation of skeleton based models through algorithms and software. Applications of 3D modeling and animation in games, virtual/augmented environments, movies, and emerging video transmission algorithms will be discussed. Prerequisites: one of CMPUT 206, 308, or 411; or consent of the instructor.",
      "color": "#3f87a6"
    },
    {
      "id": 35,
      "title": "CMPUT 308",
      "desc": "An introductory course in video data processing, with implementations in programming languages, like Python, C and MATLAB, using libraries like OpenCV. Topics in this course may include video capture, video compression, tracking, video content understanding, real-time video conferencing and surveillance. Time permitting, advanced topics like video mining, 3D modeling, and motion capture-based video coding, video-based 3D scene understanding could be discussed. Prerequisites: CMPUT 201, 206, MATH 125 or 127, STAT 151 or 265, or consent of the instructor.",
      "color": "#3f87a6"
    },
    {
      "id": 37,
      "title": "CMPUT 313",
      "desc": "Introduction to computer communication networks; protocols for error and flow control; wired and wireless medium access protocols; routing and congestion control; internet architecture and protocols; multimedia transmission; recent advances in networking. Prerequisites: CMPUT 201 and 204 or 275; one of CMPUT 229, E E 380 or ECE 212; and STAT 252 or 266.",
      "color": "#3f87a6"
    },
    {
      "id": 38,
      "title": "CMPUT 325",
      "desc": "A study of the theory, run-time structure, and implementation of selected non-procedural programming languages. Languages will be selected from the domains of functional, and logic-based languages. Prerequisites: CMPUT 201 and 204 or 275; one of CMPUT 229, E E 380 or ECE 212, and MATH 125.",
      "color": "#3f87a6"
    },
    {
      "id": 39,
      "title": "CMPUT 328",
      "desc": "Introduction to visual recognition to recognize objects and classify scenes or images automatically by a computer. Supervised and unsupervised machine learning principles and deep learning techniques will be utilized for visual recognition. Successful commercial systems based on visual recognition range from entertainment to serious scientific research: face detection and recognition on personal devices, social media. Prerequisites: CMPUT 115 or 175; one of MATH 100, 113, 114, 117, 134, 144, 154; MATH 125; STAT 141, 151 or 235.",
      "color": "#3f87a6"
    },
    {
      "id": 41,
      "title": "CMPUT 331",
      "desc": "Cryptography is the science of secure communications. This course is an introduction to computational methods for encrypting and deciphering messages, with an emphasis on computer implementation. Prerequisites: CMPUT 201 or 275 and CMPUT 272.",
      "color": "#3f87a6"
    },
    {
      "id": 43,
      "title": "CMPUT 340",
      "desc": "Computer arithmetic and errors. The study of computational methods for solving problems in linear algebra, non-linear equations, optimization, interpolation and approximation, and integration. This course will provide a basic foundation in numerical methods that supports further study in machine learning; computer graphics, vision and multimedia; robotics; and other topics in Science and Engineering. Prerequisites: CMPUT 204 or 275; MATH 125, 214; one of STAT 141, 151, 235 or 265 or SCI 151.",
      "color": "#3f87a6"
    },
    {
      "id": 44,
      "title": "CMPUT 350",
      "desc": "This course focuses on state-of-the-art AI and graphics programming for video games. Part 1 introduces C++, the language of choice for video game engines, emphasizing efficiency, safety, the Standard Template Library, and OpenGL. Part 2 on real time strategy deals with efficient pathfinding algorithms, planning, and scripting AI systems. Student projects give hands-on experience directly applicable to the video games industry. Prerequisites: CMPUT 201 or 275, and 204.",
      "color": "#3f87a6"
    },
    {
      "id": 46,
      "title": "CMPUT 361",
      "desc": "Introduction to information retrieval focusing on algorithms and data structures for organizing and searching through large collections of documents, and techniques for evaluating the quality of search results. Topics include boolean retrieval, keyword and phrase queries, ranking, index optimization, practical machine-learning algorithms for text, and optimizations used by Web search engines. Prerequisites: CMPUT 201 and CMPUT 204, or 275. One of MATH 102, 125, or 127 is strongly recommended.",
      "color": "#3f87a6"
    },
    {
      "id": 47,
      "title": "CMPUT 365",
      "desc": "This course provides an introduction to reinforcement learning intelligence, which focuses on the study and design of learning agents that interact with a complex, uncertain world to achieve a goal. Topics include multi-armed bandits, Markov decision processes, reinforcement learning, planning, and function approximation (online supervised learning). The course takes an information-processing approach to the concept of mind and briefly touches on perspectives from psychology, neuroscience, and philosophy. The course uses a recently created MOOC on Reinforcement Learning. Prerequisites: CMPUT 175 or CMPUT 275; CMPUT 267 or consent of the instructor.",
      "color": "#3f87a6"
    },
    {
      "id": 48,
      "title": "CMPUT 366",
      "desc": "Introduction to artificial intelligence focusing on techniques for building intelligent software systems and agents. Topics include search and problem-solving techniques, knowledge representation and reasoning, reasoning and acting under uncertainty, and machine learning (including neural networks). Recent applications such as planning and scheduling, diagnosis, decision support systems, and data mining. Prerequisites: CMPUT 204 or 275; one of STAT 141, 151, 235 or 265 or SCI 151.",
      "color": "#3f87a6"
    },
    {
      "id": 49,
      "title": "CMPUT 367",
      "desc": "This course in machine learning focuses on higher- dimensional data and a broader class of nonlinear  function approximation approaches. Topics include: optimization approaches (constrained optimization, hessians, matrix solutions), kernel machines, neural networks, dimensionality reduction, latent variables, feature selection, more advanced methods for assessing generalization (cross-validation, bootstrapping), introduction to non-iid data and missing data. Prerequisites: CMPUT 204 and 267; one of MATH 115, 118, 135, 145, or 155.",
      "color": "#3f87a6"
    },
    {
      "id": 50,
      "title": "CMPUT 379",
      "desc": "Introduction to the structure, components, and concepts behind modern general-purpose operating systems. Processes: process state transitions; operations on processes; interrupt processing; multiprocessor considerations; resource allocation; synchronization; critical sections and events; semaphores; deadlock: avoidance, detection, and recovery; memory management; virtual memory; paging and segmentation; page replacement strategies; working sets; demand paging; process scheduling; scheduling algorithms; file system functions; file organization; space allocation; virtual machines. Prerequisites: CMPUT 201 and 204, or 275; one of CMPUT 229, E E 380 or ECE 212.",
      "color": "#3f87a6"
    },
    {
      "id": 51,
      "title": "CMPUT 382",
      "desc": "Graphics processing units (GPU) can be programmed like a coprocessor to solve non-graphics problems, including voice recognition, computational physics, convolutional neural networks, and machine learning. The many processing cores of a GPU support a high-degree of parallelism. Course topics include hardware architecture, algorithmic design, programming languages (e.g., CUDA, OpenCL), and principles of programming for GPUs for high performance. Prerequisites: CMPUT 201 or 275, and CMPUT 229.",
      "color": "#3f87a6"
    },
    {
      "id": 52,
      "title": "CMPUT 391",
      "desc": "This course covers the implementation of RDBMSs and some non- relational data models, along with their query languages. Topics:  compilation, execution, and optimization of SQL queries; concurrent execution of transactions; indexing; advanced constructs in SQL; semi-structured data models and query languages; distributed and parallel databases; NoSQL and cloud-based database systems. Prerequisites: CMPUT 201 and 204, or 275; and CMPUT 291.",
      "color": "#3f87a6"
    },
    {
      "id": 68,
      "title": "CMPUT 404",
      "desc": "Introduction to modern web architecture, from user-facing applications to machine-facing web-services. Topics include: the evolution of the Internet, relevant technologies and protocols, the architecture of modern web-based information systems, web data exchange and serialization, and service-oriented middleware. Prerequisites: CMPUT 301 and 291, or consent of the instructor.",
      "color": "#3f87a6"
    },
    {
      "id": 70,
      "title": "CMPUT 411",
      "desc": "2D and 3D transformation; 3D modeling and viewing; illumination models and shading methods; texture mapping; ray tracing. Prerequisites: CMPUT 204 or 275, 301; one of CMPUT 340, 418 or equivalent knowledge, and MATH 214.",
      "color": "#3f87a6"
    },
    {
      "id": 71,
      "title": "CMPUT 412",
      "desc": "A project-based course dealing with the design and implementation of mobile robots to accomplish specific tasks. Students work in groups and are introduced to concepts in sensor technologies, sensor data processing, motion control based on feedback and real-time programming. Prerequisites: CMPUT 201 and 204, or 275; one of CMPUT 340, 418 or equivalent knowledge; MATH 214.",
      "color": "#3f87a6"
    },
    {
      "id": 72,
      "title": "CMPUT 414",
      "desc": "Introduction to basic principles and algorithms used in multimedia systems. Students obtain hands-on experience in issues relating to multimedia data representation, compression, processing, and animation. Topics will be selected from image and video coding and transmission, animation, human perceptual issues associated to multimedia technologies. Prerequisites: one of CMPUT 306, CMPUT 307 or CMPUT 411, or consent of the instructor.",
      "color": "#3f87a6"
    },
    {
      "id": 73,
      "title": "CMPUT 415",
      "desc": "Compilers, interpreters, lexical analysis, syntax analysis, syntax- directed translation, symbol tables, type checking, flow analysis, code generation, code optimization. Prerequisites: one of CMPUT 229, E E 380 or ECE 212, and a 300-level Computing Science course or consent of the instructor.",
      "color": "#3f87a6"
    },
    {
      "id": 74,
      "title": "CMPUT 416",
      "desc": "Introduction to the main concepts of program analysis such as intermediate representations, inter-procedural and intra-procedural analysis techniques, call graphs, pointer analysis, and analysis frameworks. The course will also include relevant research papers that introduce both classical and state-of-the-art research in the field. The course will give an overview of the program analyses that work and those that do not work in practice and how to design program analyses for modern software systems. Prerequisites: CMPUT 201 or 275, and CMPUT 272. Knowledge of grammars and automata, regular expressions, and finite state machines is recommended.",
      "color": "#3f87a6"
    },
    {
      "id": 75,
      "title": "CMPUT 428",
      "desc": "Introduction to the geometry and photometry of the 3D to 2D image formation process for the purpose of computing scene properties from camera images. Computing and analyzing motion in image sequences. Recognition of objects (what) and spatial relationships (where) from images and tracking of these in video sequences. Prerequisites: CMPUT 201 or 275; one of CMPUT 340, 418, ECE 240, or equivalent knowledge; one of MATH 101, 115, 118, 136, 146 or 156, and one of MATH 102, 125, or 127.",
      "color": "#3f87a6"
    },
    {
      "id": 76,
      "title": "CMPUT 429",
      "desc": "A discussion of computer system design concepts with stress on modern ideas that have shaped the high-performance architecture of contemporary systems. Instruction sets, pipelining, instruction-level parallelism, register reuse, branch prediction, CPU control, cache- coherence, accelerators, and related concepts. Memory technologies, caches, I/O, high-performance networks. Prerequisites: CMPUT 201 or 275; one of CMPUT 229, E E 380 or ECE 212. Credit may be obtained in only one of CMPUT 429 or CMPE 382.",
      "color": "#3f87a6"
    },
    {
      "id": 78,
      "title": "CMPUT 463",
      "desc": "Probabilistic graphical models (PGMs; including Bayesian Belief Nets, Markov Random Fields, etc.) now contribute significantly to many areas, including expert systems, computer perception (vision and speech), natural language interpretation, automated decision making, and robotics. This course provides an introduction to this field, describing semantics, inference and learning, as well as practical applications of these systems. Programming assignments will include hands-on experiments with various reasoning systems. Prerequisites: one of CMPUT 340 or 418; one of STAT 141, 151, 235 or 265 or SCI 151; or consent of the instructor.",
      "color": "#3f87a6"
    },
    {
      "id": 79,
      "title": "CMPUT 466",
      "desc": "Learning is essential for many real-world tasks, including recognition, diagnosis, forecasting and data-mining. This course covers a variety of learning scenarios (supervised, unsupervised and partially supervised), as well as foundational methods for regression, classification, dimensionality reduction and modeling. Techniques such as kernels, optimization and probabilistic graphical models will typically be introduced. It will also provide the formal foundations for understanding when learning is possible and practical. Prerequisites: one of CMPUT 340 or 418; one of STAT 141, 151, 235 or 265 or SCI 151; or consent of the instructor.",
      "color": "#3f87a6"
    },
    {
      "id": 80,
      "title": "CMPUT 469",
      "desc": "Students will experience the challenges, and rewards, of working in a team to address a real-world task, related to artificial intelligence or machine learning. This will involve first identifying the task itself, then iteratively addressing relevant issues (typically with feedback from a domain expert), leading to an implementation and culminating in evaluating that system. Students will also learn about best practices in organizing team projects, as well as important information about effective communication. Prerequisites: CMPUT 267, 365, and 366.",
      "color": "#3f87a6"
    },
    {
      "id": 81,
      "title": "CMPUT 470",
      "desc": "This is an interdisciplinary course covering areas in Computing Science, Neuroscience and Biomedical Engineering. It covers three main areas. How do biological systems represent and process information at the level of single neurons? How is this information processed at the level of small neural networks? How this information is used to control body movements. Given the interdisciplinary nature of this course, we will ensure that students first learn the fundamental concepts of other the disciplines before they are applied. Prerequisites: one of PHYSL 372, PMCOL 371, PEDS 302, CMPUT 340, or consent of instructor. Credit may be obtained in only one of CMPUT 470 or NEURO 496.",
      "color": "#3f87a6"
    },
    {
      "id": 82,
      "title": "CMPUT 474",
      "desc": "Formal grammars; relationship between grammars and automata; regular expressions; finite state machines; pushdown automata; Turing machines; computability; the halting problem; time and space complexity. Prerequisites: CMPUT 204, one of CMPUT 229, E E 380 or ECE 212 and one of MATH 225, 227, or 228 or consent of the instructor.",
      "color": "#3f87a6"
    },
    {
      "id": 83,
      "title": "CMPUT 481",
      "desc": "This course provides an undergraduate-level introduction to parallel programming, parallel and distributed systems, and high-performance computing in science and engineering. Both shared-memory parallel computers and distributed-memory multi computers (e.g., clusters) will be studied. Aspects of the practice of, and (some) research issues in, parallelism will be covered. There will be an emphasis on thread programming, data-parallel programming, and performance evaluation. Prerequisites: CMPUT 201, CMPUT 379, or consent of the instructor.",
      "color": "#3f87a6"
    },
    {
      "id": 100,
      "title": "ZOOL 241",
      "desc": "Survey of physiological systems that regulate levels of gases, food, energy, temperature, water, and ions. Examples from invertebrates and vertebrates. Prerequisite: BIOL 107 or SCI 100. This course may not be taken for credit if credit has been obtained in PHYSL 210 or 212.",
      "color": "#41ffd5"
    },
    {
      "id": 104,
      "title": "ZOOL 325",
      "desc": "A comparative survey of form and function in vertebrate animals. Lectures focus on patterns of evolution and adaptation. Laboratories offer detailed examinations of major organ systems in representative species. Prerequisite: a 200-level ZOOL course; ZOOL 224 strongly recommended. May not be taken for credit if credit already obtained in ZOOL 225.",
      "color": "#41ffd5"
    },
    {
      "id": 105,
      "title": "ZOOL 340",
      "desc": "A comparative examination of the integrated responses of animals to environmental changes. This course focuses on both the acute physiological and long-term adaptations to dealing with environmental challenges. Focus is on biochemical and physiological responses to extreme environments. Prerequisite: ZOOL 241 or  PHYSL 210 or 212 or 214.",
      "color": "#41ffd5"
    },
    {
      "id": 106,
      "title": "ZOOL 342",
      "desc": "Nerve cells, nervous systems and neuromuscular systems from molecular, physiological, behavioral, and developmental perspectives. Examples from both invertebrates and vertebrates are given. Prerequisite: ZOOL 242 or PHYSL 210 or 212. Students who have taken PMCOL 371 may not receive credit in ZOOL 342.",
      "color": "#41ffd5"
    },
    {
      "id": 111,
      "title": "ZOOL 352",
      "desc": "An introduction to protozoan, helminth and arthropod parasites of animals; principles of host and parasite adaptations, host defense, pathology, epidemiology, and ecology, and control of parasitic infections. World wide web-based laboratory tutorials emphasize morphology, life cycles, behavior, systematics and life history of parasites. Prerequisite: a 200-level Biological Sciences course (ZOOL 250 and IMIN 200 recommended).",
      "color": "#41ffd5"
    },
    {
      "id": 116,
      "title": "ZOOL 405",
      "desc": "A survey of fish diversity focussing on the morphology, systematics, behavior, and ecology of the major groups. Laboratories feature extensive use of departmental collections, with an emphasis on Alberta species. Prerequisites: ZOOL 325 or both ZOOL 224 and a 300-level Biological Sciences course. Offered in alternate years.",
      "color": "#41ffd5"
    },
    {
      "id": 118,
      "title": "ZOOL 407",
      "desc": "A survey of bird diversity focussing on the morphology, systematics, behaviour, and ecology of the major groups. Laboratories feature extensive use of departmental collections, with an emphasis on Alberta species. Prerequisites: ZOOL 325 or both ZOOL 224 and a 300-level Biological Sciences course.",
      "color": "#41ffd5"
    },
    {
      "id": 119,
      "title": "ZOOL 408",
      "desc": "A survey of mammal diversity focussing on the morphology, systematics, behavior, and ecology of the major groups. Laboratories feature extensive use of departmental collections, with an emphasis on Alberta species. Prerequisites: ZOOL 325 or both ZOOL 224 and a 300-level Biological Sciences course.",
      "color": "#41ffd5"
    },
    {
      "id": 120,
      "title": "ZOOL 441",
      "desc": "Discussion of selected topics in cardiac, gut, renal, respiratory, temperature, and metabolic physiology. Evaluation of the primary literature and communication skills are emphasized. Prerequisites: ZOOL 340 or 342 or 343, or PHYSL 372, and consent of instructor. Credit for this course may be obtained more than once. Offered in alternate years.",
      "color": "#41ffd5"
    },
    {
      "id": 128,
      "title": "PHYSL 210A",
      "desc": "Introductory course in human physiology. Students will study the function and regulation of the human body and the complexities and interactions of cells, tissues, major organs and systems. This course is offered as a classroom-based course or in an online format. Students may not transfer from one mode of instruction to the other. Prerequisites: BIOL 107; plus 6 credits in University level Chemistry. Credit may be obtained in only one of PHYSL 210 or 212 and 214. This course may not be taken for credit if credit has been obtained in ZOOL 241 and/or 242.",
      "color": "#603fdb"
    },
    {
      "id": 129,
      "title": "PHYSL 210B",
      "desc": "Introductory course in human physiology. Students will study the function and regulation of the human body and the complexities and interactions of cells, tissues, major organs and systems. This course is offered as a classroom-based course or in an online format. Students may not transfer from one mode of instruction to the other. Prerequisites: BIOL 107; plus 6 credits in University level Chemistry. Credit may be obtained in only one of PHYSL 210 or 212 and 214. This course may not be taken for credit if credit has been obtained in ZOOL 241 and/or 242.",
      "color": "#603fdb"
    },
    {
      "id": 130,
      "title": "PHYSL 212",
      "desc": "An introduction to human physiology. Part 1, covering: membrane transport mechanisms; intracellular and electrical signaling; the physiology of excitable tissues; the physiology of blood; and the cardiovascular system. Required for students in the Physiology Honors program. Recommended for students in other Honors/Specialization programs. Prerequisites: BIOL 107; CHEM 101 and 102. Pre- or corequisites: CHEM 164 or 261, and 263. Credit may be obtained in only one of PHYSL 212 and 214, or 210. This course may not be taken for credit if credit has been obtained in ZOOL 241 and/or 242. Students in some Honors/Specialization programs may require PHYSL 212 and 214, or 210. See your departmental advisor",
      "color": "#603fdb"
    },
    {
      "id": 131,
      "title": "PHYSL 214",
      "desc": "An introduction to human physiology. Part 2, covering: the physiology of the gastrointestinal tract; the respiratory system; the renal system; endocrinology; and the reproductive system. Required for students in the Physiology Honors program. Recommended for students in other Honors/Specialization programs. Prerequisite: PHYSL 212.",
      "color": "#603fdb"
    },
    {
      "id": 132,
      "title": "PHYSL 310",
      "desc": "Modern techniques in Physiology (involving cell biology, molecular, histological and live cell imaging, and non-invasive experimentation) will be discussed in theory and demonstrated/utilized in a series of laboratory experiments. Student participation as subjects may be required in some labs. Prerequisites: Successful completion of PHYSL 210 or PHYSL 212 and 214 and consent of Department.",
      "color": "#603fdb"
    },
    {
      "id": 133,
      "title": "PHYSL 372",
      "desc": "Introduction to the organization and function of vertebrate nervous systems. Major topics will be neural development, control of movement, integration of sensory information, and the neuronal mechanisms underlying memory and learning. Prerequisites: PHYSL 212 and 214, or 210, or ZOOL 242.",
      "color": "#603fdb"
    },
    {
      "id": 134,
      "title": "PHYSL 400",
      "desc": "The aim of this course is to describe (i) the causes of infertility, (ii) therapeutic approaches to restore or enhance fertility and (iii) contraceptive approaches to avoid pregnancy. Prerequisites: PHYSL 212 and 214, or 210 and consent of Department.",
      "color": "#603fdb"
    },
    {
      "id": 135,
      "title": "PHYSL 403",
      "desc": "The physiological and pathophysiological interrelationships between the nervous, endocrine and immune systems. Prerequisites: PHYSL 212 and 214, or 210 and consent of Department.",
      "color": "#603fdb"
    },
    {
      "id": 136,
      "title": "PHYSL 404",
      "desc": "General concepts in human cardiovascular physiology: properties of the myocardium, heart function, vascular biology, hemodynamics and control of cardiovascular system. Discussion of cardiovascular pathologies and relevant clinical situations. Prerequisites: PHYSL 212 and 214, or 210 and consent of Department.",
      "color": "#603fdb"
    },
    {
      "id": 137,
      "title": "PHYSL 405",
      "desc": "The sensory systems in human physiology. The topics covered will be vision, hearing, vestibular mechanisms, taste, smell and touch, including receptor mechanisms and central organization. Prerequisites: PHYSL 212 and 214, or 210 and consent of Department.",
      "color": "#603fdb"
    },
    {
      "id": 138,
      "title": "PHYSL 407",
      "desc": "The molecular and cellular aspects of physiological processes. Main areas include the structure and functions of plasma membranes (emphasizing transport processes, their regulation and methods of study) and the mechanism of action of hormones (hormonereceptor interactions, receptor regulation and interactions of intracellular mediators). The physiological significance of these processes will be stressed throughout. Prerequisites: PHYSL 212 and 214, or 210 and consent of Department.",
      "color": "#603fdb"
    },
    {
      "id": 139,
      "title": "PHYSL 409",
      "desc": "Advanced principles of regulatory mechanisms in human and mammalian physiology, with in depth analysis of interrelationships between different organ systems in the maintenance of homeostasis. Clinical and physiologic perspectives are highlighted in the demonstration of how organ systems interact in health and the disruption in homeostasis which occurs in disease. Contemporary topics in energy and cardiovascular homeostasis such as the physiological adaptations to pregnancy, exercise, obesity and diabetes will be explored using an integrative, systems physiology approach. Suitable as preparation for careers in medicine, biomedical research and health-related fields. Prerequisites: PHYSL 212 and 214 (or 210), 404 and consent of Department.",
      "color": "#603fdb"
    },
    {
      "id": 140,
      "title": "PHYSL 410",
      "desc": "Innovative online course featuring unique systems approach to learning fundamental concepts in physiology and biomedical research. Real-world cases in clinical medicine highlighting each major organ system are presented in a problem-based learning format. Essential themes in physiology and pathophysiology including complex inter-relationships between organ and control systems are used to unravel each clinical case. Gaps in clinical knowledge and practice are linked to current scientific and translational research strategies. Enriches preparation for careers in medicine, biomedical research and health- related fields. Prerequisites: PHYSL 212 and 214 (or 210) or equivalent and consent of Department. Note: this course is not open to students with credit in the corresponding PHYSL 510.",
      "color": "#603fdb"
    },
    {
      "id": 141,
      "title": "PHYSL 412",
      "desc": "Key historical scientific/medical discoveries as well as modern socio-cultural phenomena serve as a catalyst for discussion of fundamental concepts in Physiology spanning all body systems. Historical case presentation contrasts ideological, technological and scientific approaches with modern views and advances. Popular culture references initiate in-depth investigation of the physiological basis of modern social phenomena. Highlighted case presentations facilitate application of physiology knowledge through discovery learning approaches to study historical foundations and modern marvels by evoking vivid imagery, curiosity and relatability. Suitable for preparation for careers in medicine, biomedical research and health-related fields; relevant for fields involving knowledge dissemination such as public health promotion and education. Prerequisites: PHYSL 212 and 214 (or 210) or equivalent and consent of Department. Note: this course is not open to students with credit PHYSL 512.",
      "color": "#603fdb"
    },
    {
      "id": 142,
      "title": "PHYSL 413",
      "desc": "The course stresses experimental approaches to understanding fetal physiology as well as the development and function of the fetus from ovulation to birth and adaptation to independent life. This course also deals with maternal physiology during pregnancy, complications of pregnancy, and newborn health. Prerequisites: PHYSL 212 and 214, or 210 and consent of Department. Note: this course is not open to students with credit in PHYSL 513.",
      "color": "#603fdb"
    },
    {
      "id": 143,
      "title": "PHYSL 444",
      "desc": "A lecture course emphasizing contemporary aspects of developmental, cellular, systems and cognitive neurophysiology. Topics will include experience-dependent processes in the development of the nervous system, the molecular and cellular mechanisms for learning and memory, the electrophysiology of rhythmic activity in identified brain circuits, the microphysiology of transmitter secretion, and the representation and transformation of information in the nervous system. Students will be expected to demonstrate a thorough understanding of selected readings from current and classical literature. Suitable for honors students in Physiology, Pharmacology, Psychology and Neuroscience. Prerequisites: PMCOL 371 or ZOOL 342, and PHYSL 372 and consent of Department.",
      "color": "#603fdb"
    },
    {
      "id": 144,
      "title": "PHYSL 455",
      "desc": "Advanced course focusing on specific aspects of the physiological regulation of lipid and lipoprotein metabolism. Topics include the transcriptional and post-translational mechanisms governing the synthesis and degradation of important enzymes, lipids, and lipid transport molecules; the role of lipid mediators in signaling pathways and protein modification; the assembly and dynamics of lipoproteins and biological membranes; genetic disruptions of lipid regulatory proteins such as cell surface receptors leading to human disease. Prerequisites: A minimum grade of B- in PHYSL 210 or 212/214 or consent of Department. This course is intended for students in Honors in Physiology. Students in other programs may be admitted subject to availability and with the consent of the Department. Graduate students may not register for credit (see PHYSL 555).",
      "color": "#603fdb"
    },
    {
      "id": 145,
      "title": "PHYSL 456",
      "desc": "Focus will be on internal respiration and common acute and chronic respiratory diseases including diagnosis and treatments. Prerequisites: PHYSL 212 and 214, or 210 and consent of Department.",
      "color": "#603fdb"
    },
    {
      "id": 146,
      "title": "PHYSL 457",
      "desc": "Acute and chronic adaptations to various modalities of exercise. Focus will be on metabolism, muscular, cardiovascular, and respiratory systems. An introduction to clinical exercise physiology will also be covered. Prerequisites: PHYSL 212 and 214, or 210 and consent of Department.",
      "color": "#603fdb"
    },
    {
      "id": 147,
      "title": "PHYSL 461",
      "desc": "Individual study, open to undergraduate students who have identified a supervisor in the Department of Physiology. Co-supervisors from other Departments are permitted. Students will spend one term in the laboratory of a faculty member and carry out a laboratory research project. Registration package and further information are available. Prerequisites: PHYSL 210 or PHYSL 212/214 and consent from the course coordinator.",
      "color": "#603fdb"
    },
    {
      "id": 148,
      "title": "PHYSL 463",
      "desc": "Open to undergraduate students in the Honors Physiology program. Students will identify, present, and critically discuss recent advances in Physiology research with classmates and instructors in a journal club-type format. Registration package and further information are available. Prerequisites: PHYSL 210 or PHYSL 212/214 and consent from the course coordinators. Must be taken in conjunction with PHYSL 464.",
      "color": "#603fdb"
    },
    {
      "id": 149,
      "title": "PHYSL 464",
      "desc": "Taken in conjunction with PHYSL 463, this course is open to undergraduate students in the Honors Physiology program. Students will undertake self-directed research and provide a critical review of recent literature in one specific field of Physiology (to be identified by the student in consultation with the course coordinators). Registration package and further information are available. Prerequisites: PHYSL 210 or PHYSL 212/214, PHYSL 463 and consent from the course coordinators.",
      "color": "#603fdb"
    },
    {
      "id": 151,
      "title": "PHYSL 467A",
      "desc": "Individual study, open to undergraduate students who have identified a supervisor in the department of Physiology. Co-supervision with Professors from other Departments is possible, provided that a supervisor from the department of Physiology is identified. Students will spend two terms in the laboratory of a faculty member and carry out a laboratory research project. Prerequisites: PHYSL 210 or PHYSL 212/214 and consent from the course coordinator.",
      "color": "#603fdb"
    },
    {
      "id": 152,
      "title": "PHYSL 467B",
      "desc": "Individual study, open to undergraduate students who have identified a supervisor in the department of Physiology. Co-supervision with Professors from other Departments is possible, provided that a supervisor from the department of Physiology is identified. Students will spend two terms in the laboratory of a faculty member and carry out a laboratory research project. Prerequisites: PHYSL 210 or PHYSL 212/214 and consent from the course coordinator.",
      "color": "#603fdb"
    },
    {
      "id": 153,
      "title": "PHYSL 468",
      "desc": "Individual study, open to undergraduate students who have identified a supervisor in the Department of Physiology. Taken in conjunction with PHYSL 469, this 6-credit course is the first part of a 12-credit program in two terms resulting in an honours research thesis in physiology. Students will spend the Fall term in the laboratory of a supervisor and carry out a research project to be continued in the second term as PHYSL 469. Co-supervision with Professors from other Departments is possible, provided that a supervisor from the Department of Physiology is identified. Students will be evaluated on an oral presentation, a written research proposal and performance in the laboratory. Prerequisites: PHYSL 210 or PHYSL 212/214 and consent from the course coordinator.",
      "color": "#603fdb"
    },
    {
      "id": 154,
      "title": "PHYSL 469",
      "desc": "Taken in conjunction with PHYSL 468, this 6-credit course is the second part of a 12-credit program in two terms resulting in an honours research thesis in Physiology. Upon satisfactory progress in first-term PHYSL 468, students will continue their research and produce an honours thesis on their project. Students will be evaluated on a final oral presentation, a written research Thesis and performance in the laboratory. Prerequisites: PHYSL 210 or PHYSL 212/214 and consent from the course coordinator.",
      "color": "#603fdb"
    },
    {
      "id": 155,
      "title": "PHYSL 500",
      "desc": "The aim of this course is to describe (i) the causes of infertility, (ii) therapeutic approaches to restore or enhance fertility and (iii) contraceptive approaches to avoid pregnancy. Lectures are the same as PHYSL 400, but with additional assignments and evaluation appropriate to graduate studies. Credit cannot be obtained for both PHYSL 400 and 500. Prerequisites: PHYSL 212 and 214, or 210 and consent of Department.",
      "color": "#603fdb"
    },
    {
      "id": 156,
      "title": "PHYSL 501",
      "desc": "The goal of PHYSL 501 is to develop critical appraisal and presentation skills in advanced undergraduate and graduate students. Through critical review of controversial topics in modern cardiovascular physiology, the participant will learn to appreciate that literature is a dynamic, changing and fallible source of information. Presentation skills are developed through both oral and written assignments and facility with the use of electronic library resources is encouraged. Course content varies from year to year. Prerequisites: PHYSL 212 and 214, or 210, 404 and consent of Department.",
      "color": "#603fdb"
    },
    {
      "id": 164,
      "title": "PHYSL 510",
      "desc": "Innovative online course featuring unique systems approach to learning fundamental concepts in physiology and biomedical research. Real-world cases in clinical medicine highlighting each major organ system are presented in a problem-based learning format. Essential themes in physiology and pathophysiology including complex inter-relationships between organ and control systems are used to unravel each clinical case. Gaps in clinical knowledge and practice are linked to current scientific and translational research strategies. Enriches preparation for careers in medicine, biomedical research and health-related fields. Prerequisites: PHYSL 212 and 214 (or 210) or equivalent and consent of Department. This course may not be taken for credit if credit has already been obtained in PHYSL 410.",
      "color": "#603fdb"
    },
    {
      "id": 165,
      "title": "PHYSL 512",
      "desc": "Key historical scientific/medical discoveries as well as modern socio-cultural phenomena serve as a catalyst for discussion of fundamental concepts in Physiology spanning all body systems. Historical case presentation contrasts ideological, technological and scientific approaches with modern views and advances. Popular culture references initiate in-depth investigation of the physiological basis of modern social phenomena. Highlighted case presentations facilitate application of physiology knowledge through discovery learning approaches to study historical foundations and modern marvels by evoking vivid imagery, curiosity and relatability. Suitable for preparation for careers in medicine, biomedical research and health-related fields; relevant for fields involving knowledge dissemination such as public health promotion and education. Prerequisites: PHYSL 212 and 214 (or 210) or equivalent and consent of Department. Note: This course may not be taken for credit if credit has already been obtained in PHYSL 412.",
      "color": "#603fdb"
    },
    {
      "id": 166,
      "title": "PHYSL 513",
      "desc": "The course stresses experimental approaches to understanding fetal physiology as well as the development and function of the fetus from ovulation to birth and adaptation to independent life. This course also deals with maternal physiology during pregnancy, complications of pregnancy, and newborn health. Prerequisites: PHYSL 212 and 214, or 210 and consent of Department.",
      "color": "#603fdb"
    },
    {
      "id": 168,
      "title": "PHYSL 545",
      "desc": "A consideration of transport mechanisms primarily from the physiological rather than biochemical viewpoint. Major models considered are the erythrocyte and a variety of epithelia from vertebrates. Designed for advanced undergraduate and graduate students. Offered in alternate years. Prerequisites: PHYSL 212 and 214, or 210, or ZOOL 241 and 242.",
      "color": "#603fdb"
    },
    {
      "id": 169,
      "title": "PHYSL 555",
      "desc": "Advanced course focusing on specific aspects of the physiological regulation of lipid and lipoprotein metabolism. Topics include the transcriptional and post-translational mechanisms governing the synthesis and degradation of important enzymes, lipids, and lipid transport molecules; the role of lipid mediators in signaling pathways and protein modification; the assembly and dynamics of lipoproteins and biological membranes; genetic disruptions of lipid regulatory proteins such as cell surface receptors leading to human disease. Prerequisites: A minimum grade of B- in PHYSL 210 or 212/214 or consent of Department. Lectures are the same as for PHYSL 455, but with additional assignments and evaluation appropriate to graduate studies. This course may not be taken for credit if credit has already been obtained in PHYSL 455.",
      "color": "#603fdb"
    },
    {
      "id": 191,
      "title": "CELL 201",
      "desc": "An introductory Cell Biology course suitable for students interested in pursuing Cell Biology specialization/honors. This course focuses on the molecular aspects of modern cell biology. Topics covered include the nucleus and gene expression; membrane structure and function; signal transduction; organelle biogenesis; cytoskeleton and cell motility; cell adhesion; the cell cycle; cancer; differentiation and stem cell technology. Reference will be made to key investigations and new technologies that have defined modern cell biology. Prerequisite: BIOL 107 or SCI 100. Pre or corequisite: CHEM 164 or 261 or SCI 100. Note: Not to be taken by students with credit in BIOL 201, in addition, not available to students currently enrolled in BIOL 201.",
      "color": "#dc5b0c"
    },
    {
      "id": 192,
      "title": "CELL 300",
      "desc": "Advanced course studying various topics in modern molecular cell biology emphasizing the design of experiments, the interpretation of their results and the extrapolation of their findings. Examines aspects of eukaryotic cell structure and function. Includes, but not restricted to, areas such as protein targeting, organelle biogenesis, intracellular signaling, pathogen-cell interactions and cell-cell interactions. Makes extensive use of scientific literature to illustrate important concepts. Prerequisites: BIOL 201 or CELL 201 and BIOCH 200.",
      "color": "#dc5b0c"
    },
    {
      "id": 201,
      "title": "CELL 425",
      "desc": "Systems biology is the molecular analysis of organisms and involves understanding the integrated and interacting network of genes, proteins and biochemical processes that give rise to what we define as life. Systems biology connects and integrates genomics, proteomics, bioinformatics, engineering, cell biology and genetics with mathematics and computational analysis to enable the comprehensive discovery of principles underlying the functioning of living organisms. This course provides the student with the fundamentals of a systems biology approach to understanding organisms. Systems biology projects using database analysis software will be a large component of this course and therefore personal computers are required. Prerequisites: CELL 201, BIOL 201 or consent of Department. Note: Offered in odd-numbered years.",
      "color": "#dc5b0c"
    },
    {
      "id": 218,
      "title": "BIOCH 200",
      "desc": "An introduction to the fundamental principles of biochemistry. Protein structure and function; enzymes; lipids and the structure of biological membranes; nucleotides and the structure of nucleic acids; bioenergetics and the catabolism of carbohydrates. Prerequisites: CHEM 101 and CHEM 261 or 164, or SCI 100.",
      "color": "#5fbd2a"
    },
    {
      "id": 222,
      "title": "BIOCH 310",
      "desc": "This course is designed to enable rigorous study of the molecular mechanisms in bioenergetics and metabolism. It covers: the principles of bioenergetics; the reactions and pathways of carbohydrate, lipid, and nitrogen metabolism, and their regulation; oxidative phosphorylation; the integration and hormonal regulation of mammalian metabolism. Prerequisites: BIOCH 200, CHEM 102 (or SCI 100) and CHEM 263 with a minimum GPA of 2.70 for these three courses. In the case of over-subscription, preference will be given to students enrolled in programs with a requirement for this course.",
      "color": "#5fbd2a"
    },
    {
      "id": 223,
      "title": "BIOCH 320",
      "desc": "This course is designed to illustrate, in detail, the relationships between structure and function in biological molecules. It covers: the structure of proteins; experimental techniques used to study proteins; selected illustrations of protein function; enzyme catalysis, kinetics, and regulation; structural carbohydrates and glycobiology; the structure of lipids; biological membranes and mechanisms of transport. Prerequisites: BIOCH 200, CHEM 102 (or SCI 100) and CHEM 263 with a minimum GPA of 2.70 for these three courses. In the case of over-subscription, preference will be given to students enrolled in programs with a requirement for this course.",
      "color": "#5fbd2a"
    },
    {
      "id": 224,
      "title": "BIOCH 330",
      "desc": "This course is designed to provide students with a comprehensive introduction to the biochemistry of nucleic acids. It covers: the structure and properties of nucleotides and nucleic acids; DNA-based information technologies; genes and chromosome structure; molecular mechanisms in DNA replication, repair, and recombination; RNA metabolism; protein synthesis and targeting; the regulation of gene expression. Prerequisites: BIOCH 200, CHEM 102 (or SCI 100), and CHEM 263, with a minimum GPA of 2.70 for these three courses. In the case of over-subscription, preference will be given to students enrolled in programs with a requirement for this course.",
      "color": "#5fbd2a"
    },
    {
      "id": 225,
      "title": "BIOCH 398",
      "desc": "Supervised research within a laboratory in the Department of Biochemistry. The results of the research project will be presented in a poster. This course is available only as a six week Spring or Summer session course. Prerequisites: Credit in at least one 300-level BIOCH course and consent of the Department. BIOCH 398 may not be taken for credit if credit has been obtained in BIOCH 498 or 499.",
      "color": "#5fbd2a"
    },
    {
      "id": 226,
      "title": "BIOCH 400",
      "desc": "A laboratory course which introduces a range of the experimental techniques important in biochemical research, and which focuses on development of fundamental laboratory skills and practices. Together with BIOCH 404, this course is intended as preparation for undertaking a directed research project in biochemistry. Pre or co-requisites: BIOCH 320 and 330, and consent of the Department.",
      "color": "#5fbd2a"
    },
    {
      "id": 228,
      "title": "BIOCH 404",
      "desc": "This course is a continuation of BIOCH 400. It introduces additional experimental techniques important in biochemical research and continues to focus on development of fundamental laboratory skills and practices. Together with BIOCH 400, this course is intended as preparation for undertaking a directed research project in biochemistry. Prerequisites: BIOCH 400 and consent of the Department.",
      "color": "#5fbd2a"
    },
    {
      "id": 229,
      "title": "BIOCH 409",
      "desc": "Research and/or reading course. This course allows a student to study an area of biochemistry in much greater detail than is usual in most courses. The format is usually a reading/tutorial in which the student carries out directed reading and meets with the tutor at regular intervals for discussion and further guidance. Term papers or presentations may be used for evaluation purposes. A mature attitude towards learning is essential, as the course often requires independent study and research. Students who have a particular interest in any specific area of biochemistry are encouraged to meet with the faculty members to explore the possibilities of arranging a mutually satisfactory topic. Prerequisites: At least one of BIOCH 410, 420, 430, 441, 455, or 465. Available only to students in the Biochemistry Specialization or Honors programs. Credit for this course may be obtained more than once.",
      "color": "#5fbd2a"
    },
    {
      "id": 230,
      "title": "BIOCH 410",
      "desc": "Principles of the biochemistry of cell communication and signal transduction through receptor activation, the generation of second messengers, and the control of protein modifications. The course will emphasize the mechanisms responsible for the regulation of cell migration, division and death. Prerequisites: BIOCH 310, 320 and 330, all with a minimum grade of B-, or consent of the Department. This course is intended for students in Honors or Specialization in Biochemistry. Students in other programs may be admitted subject to availability and with the consent of the Department. Graduate students may not register for credit (see BIOCH 510).",
      "color": "#5fbd2a"
    },
    {
      "id": 232,
      "title": "BIOCH 419",
      "desc": "This course introduces students to the skills required to effectively communicate research in biochemistry. Communication skills will be developed through critical evaluation, identification of effective techniques, and practice. Students will communicate research data to various target audiences, through oral presentations in particular and with a focus on the effective use of images and diagrams to represent and explain research findings. Prerequisites: BIOCH 310, 320 and 330, and consent of the instructor. Co-requisite: BIOCH 499. This course is restricted to students in Honors or Specialization in Biochemistry.",
      "color": "#5fbd2a"
    },
    {
      "id": 233,
      "title": "BIOCH 420",
      "desc": "Principles of protein structure, function, and dynamics, with an introduction to force fields used in modern molecular dynamics. Focus topics include an introduction to intrinsically disordered proteins and their role in misfolding diseases, the structural biology, ligand binding, and mechanisms of membrane bound enzymes, and mechanisms underlying the regulation of protein function and enzymes involved in cell signaling. Prerequisites: BIOCH 320, with a minimum grade of B- or consent of Department. This course is intended for students in Honors or Specialization in Biochemistry. Students in other programs may be admitted subject to availability and with the consent of the Department. Graduate students may not register for credit (see BIOCH 520).",
      "color": "#5fbd2a"
    },
    {
      "id": 234,
      "title": "BIOCH 425",
      "desc": "An advanced course focusing on the analysis of protein function and protein-protein interactions within the context of the entire protein complement of a cell. Some aspects of protein structure as it pertains to the principles of protein-protein interactions will be covered along with genetic and biochemical methods for the analysis of protein complexes, protein interaction networks and system wide protein identification and dynamics. This course is intended for students in Honors or Specialization in Biochemistry. Students in other programs may be admitted subject to availability and with the consent of the Department. Prerequisites: BIOCH 320 and BIOCH 330 with a minimum GPA of 3.0 in these courses.",
      "color": "#5fbd2a"
    },
    {
      "id": 235,
      "title": "BIOCH 430",
      "desc": "The organization and expression at the molecular level of information encoded in the nucleic acids of eukaryotic cells. The focus will be on genome structure and the regulation of gene expression at the levels of transcription, post-transcriptional processing, translation, post-translational modification and protein sorting. Recombinant DNA technologies and genetic engineering will be discussed as methods for studying the cellular processing of genetic information. Prerequisites: BIOCH 320 and 330, both with a minimum grade of B- or consent of Department. This course is intended for students in Honors or Specialization in Biochemistry. Students in other programs may be admitted subject to availability and with the consent of the Department. Graduate students may not register for credit (see BIOCH 530).",
      "color": "#5fbd2a"
    },
    {
      "id": 236,
      "title": "BIOCH 441",
      "desc": "Survey of the structure and function of biological membranes. Topics include the structure, properties and composition of biomembranes, characterization and structural principles of membrane lipids and proteins, lateral and transverse asymmetry, dynamics, lipid-protein interactions, membrane enzymology, permeability, and biogenesis. Prerequisites: BIOCH 320, with a minimum grade of B- or consent of Department. This course is intended for students in Honors or Specialization in Biochemistry. Students in other programs may be admitted subject to availability and with the consent of the Department. Graduate students may not register for credit (see BIOCH 541).",
      "color": "#5fbd2a"
    },
    {
      "id": 237,
      "title": "BIOCH 450",
      "desc": "This course will focus on virus structure, replication, and interaction with host cells at the molecular level. Lytic viruses with single- or double-stranded DNA or RNA genomes will be discussed, as will the mechanisms of viral oncogenesis. Prerequisites: BIOCH 320 and 330, with a minimum grade of B- or consent of Department. This course is intended for students in Honors or Specialization in Biochemistry. Students in other programs may be admitted subject to availability and with the consent of the Department. Graduate students may not register for credit (see BIOCH 550).",
      "color": "#5fbd2a"
    },
    {
      "id": 238,
      "title": "BIOCH 465",
      "desc": "Survey of biophysical methods used in the characterization and structural determination of biological macromolecules, from ensemble measurements to single-molecule detection. Topics include mass spectrometry, optical spectroscopy, light microscopy, X-ray and neutron diffraction, electron microscopy, molecular dynamics and nuclear magnetic resonance. Emphasis is on using techniques in evaluating structure-function relationships through the discussion of representative macromolecular systems. Prerequisites: BIOCH 320 with a minimum grade of B- or consent of the Department. This course is intended for students in Honors or Specialization in Biochemistry. Students in other programs may be admitted subject to availability and with the consent of the Department. This course cannot be taken for credit if credit has already been obtained in BIOCH 460.",
      "color": "#5fbd2a"
    },
    {
      "id": 239,
      "title": "BIOCH 481",
      "desc": "This course explores both the opportunities and challenges of synthetic life by providing a practical and theoretical introduction to this new discipline through lectures, class discussion, and hands on computational exercises. Topics covered include: natural vs artificial design of genetic circuits, and the theoretical aspects of gene and gene network construction using molecular biology techniques. Prerequisites: BIOCH 330 (or equivalent), registration in the Faculties of Science or Engineering, and a minimum GPA 3.3 (or consent of the department).",
      "color": "#5fbd2a"
    },
    {
      "id": 240,
      "title": "BIOCH 482",
      "desc": "This course expands on BIOCH 481, providing opportunity for further skill development in analysis of the function of natural and engineered gene and metabolic networks. These computational labs are intended to explore the concepts applied in computer modeling during the design, testing, and optimization steps required to create biological model systems. Prerequisites: BIOCH 481.",
      "color": "#5fbd2a"
    },
    {
      "id": 241,
      "title": "BIOCH 495",
      "desc": "Covers specialized topics of current interest to advanced undergraduates in Biochemistry programs. Consult the Department for details about current offerings. Prerequisites: BIOCH 310, 320 and 330, and consent of the instructor. This course is restricted to students in Honors or Specialization in Biochemistry. Credit for this course may be obtained more than once.",
      "color": "#5fbd2a"
    },
    {
      "id": 246,
      "title": "BIOCH 510",
      "desc": "Principles of the biochemistry of cell communication and signal transduction through receptor activation, the generation of second messengers, and the control of protein modifications. The course will emphasize the mechanisms responsible for the regulation of cell migration, division and death. Prerequisites: BIOCH 310, 320 and 330, or BIOCH 203 and 205, all with a minimum grade of B-, or consent of the Department. Lectures are the same as for BIOCH 410, but with additional assignments and evaluation appropriate to graduate studies. This course may not be taken for credit if credit has already been obtained in BIOCH 410.",
      "color": "#5fbd2a"
    },
    {
      "id": 247,
      "title": "BIOCH 520",
      "desc": "Protein chemistry and purification. The intra- and intermolecular forces that determine protein structure. Principles of protein folding and dynamics. Enzyme mechanisms and ligand binding interactions. Prerequisites: BIOCH 320, or BIOCH 203 and 205, all with a minimum grade of B- or consent of Department. Lectures are the same as for BIOCH 420, but with additional assignments and evaluation appropriate to graduate studies. This course may not be taken for credit if credit has already been obtained in BIOCH 420.",
      "color": "#5fbd2a"
    },
    {
      "id": 248,
      "title": "BIOCH 525",
      "desc": "An advanced course focusing on the analysis of protein function and protein-protein interactions within the context of the entire protein complement of a cell. Some aspects of protein structure as it pertains to the principles of protein-protein interactions will be covered along with genetic and biochemical methods for the analysis of protein complexes, protein interaction networks and system wide protein identification and dynamics. This course is intended for students in Biochemistry but students in other programs may be admitted subject to availability and with the consent of the Department. Prerequisites: BIOCH 420 and BIOCH 430 or their equivalent with a minimum GPA of 3.2 in these courses.",
      "color": "#5fbd2a"
    },
    {
      "id": 249,
      "title": "BIOCH 530",
      "desc": "The organization and expression at the molecular level of information encoded in the nucleic acids of eukaryotic cells. The focus will be on genome structure and the regulation of gene expression at the levels of transcription, post-transcriptional processing, translation, post-translational modification and protein sorting. Recombinant DNA technologies and genetic engineering will be discussed as methods for studying the cellular processing of genetic information. Prerequisites: BIOCH 320 and 330, or BIOCH 203 and 205, all with a minimum grade of B- or consent of Department. Lectures are the same as for BIOCH 430, but with additional assignments and evaluation appropriate to graduate studies. This course may not be taken for credit if credit has already been obtained in BIOCH 430.",
      "color": "#5fbd2a"
    },
    {
      "id": 250,
      "title": "BIOCH 541",
      "desc": "Survey of the structure and function of biological membranes. Topics include the structure, properties and composition of biomembranes, characterization and structural principles of membrane lipids and proteins, lateral and transverse asymmetry, dynamics, lipid-protein interactions, membrane enzymology, permeability, and biogenesis. Prerequisites: BIOCH 320, or BIOCH 203 and 205, all with a minimum grade of B- or consent of Department. Lectures are the same as for BIOCH 441, but with additional assignments and evaluation appropriate to graduate studies. This course may not be taken for credit if credit has already been obtained in BIOCH 441.",
      "color": "#5fbd2a"
    },
    {
      "id": 251,
      "title": "BIOCH 550",
      "desc": "This course will focus on virus structure, replication, and interaction with host cells at the molecular level. Lytic viruses with single- or double-stranded DNA or RNA genomes will be discussed, as will the mechanisms of viral oncogenesis. Prerequisites: BIOCH 320 and 330, or BIOCH 203 and 205, all with a minimum grade of B- or consent of Department. Lectures are the same as for BIOCH 450, but with additional assignments and evaluation appropriate to graduate studies. This course may not be taken for credit if credit has already been obtained in BIOCH 450.",
      "color": "#5fbd2a"
    },
    {
      "id": 287,
      "title": "NEURO 375",
      "desc": "The study of the human central nervous system (CNS), including its development and function from an anatomical perspective. The course will include some disorders of the CNS as they relate to structure and function. Prerequisite: PSYCO 275 or consent of the Neuroscience and Mental Health Institute. This course may not be taken for credit if credit has been obtained in ANAT 401.",
      "color": "#7b1905"
    },
    {
      "id": 288,
      "title": "NEURO 410",
      "desc": "Designed to provide senior undergraduate students in the Neuroscience program a comprehensive overview on neurobiology of normal aging and the cellular/molecular phenomena that may underlie various age-related neurodegenerative diseases. Aspects of neuronal and glial changes during the normal aging process will be covered. We also intend to include a video presentation of patients with neurodegenerative disorders to outline the impact of cellular/molecular changes on major clinical and psychological features. In addition, papers on the most recent developments in the field of aging research have been integrated into the course. Prerequisites: NEURO 375 or PMCOL 371 or ZOOL 342 or consent from course coordinator. Credit may be obtained for either NEURO 410 or 510 but not both.",
      "color": "#7b1905"
    },
    {
      "id": 289,
      "title": "NEURO 411",
      "desc": "Designed to provide senior undergraduate students in the Neuroscience program a comprehensive overview on neurobiology of various neurodegenerative disorders. Both clinical and basic science aspects of major neurodegenerative disorders such as Alzheimer's disease, Parkinson's disease, Huntington disease, Prion disease, Motor neuron disease (MND), Frontotemporal Dementia, Multiple Sclerosis and Chronic Traumatic Encephalopathy will be covered. We also intend to include a video presentation of patients with neurodegenerative disorders to outline major clinical and psychological features. In addition, papers on the most recent developments in the field of aging research have been integrated into the course. Prerequisites: NEURO 375 or PMCOL 371 or ZOOL 342 or consent from course coordinator. Credit may be obtained for either NEURO 411 or 511 but not both.",
      "color": "#7b1905"
    },
    {
      "id": 291,
      "title": "NEURO 450",
      "desc": "An individual study course involving detailed reading on a selected topic in cellular, molecular, systems, or cognitive neuroscience. Students will select a member of the Neuroscience and Mental Health Institute (NMHI) who will guide them through a course of reading on a specialized topic at an advanced level. Completion of this course requires an oral presentation to an examining committee. Restricted to students in the Honors program in Neuroscience. Registration must be approved by the Neuroscience and Mental Health Institute (NMHI). Prerequisites: PMCOL 371, PHYSL 372.",
      "color": "#7b1905"
    },
    {
      "id": 292,
      "title": "NEURO 451",
      "desc": "Research project involving laboratory experimentation done under the supervision of a member of the Neuroscience and Mental Health Institute (NMHI). Laboratory projects may involve current topics and methodologies encountered in specific areas of cellular, molecular, systems, or cognitive neuroscience. Completion of this course requires a written report of the project and an oral presentation to an examining committee. Restricted to students in the Honors program in Neuroscience. Registration must be approved by the Neuroscience and Mental Health Institute (NMHI). Prerequisites: PMCOL 371, PHYSL 372.",
      "color": "#7b1905"
    },
    {
      "id": 293,
      "title": "NEURO 452",
      "desc": "Research project involving laboratory experimentation done under the supervision of a member of the Neuroscience and Mental Health Institute (NMHI). Laboratory projects may involve current topics and methodologies encountered in specific areas of cellular, molecular, systems, or cognitive neuroscience. Completion of this course requires a written report of the project and an oral presentation to an examining committee at the end of the course. Restricted to students in the Honors program in Neuroscience. Registration must be approved by the Neuroscience and Mental Health Institute (NMHI). Prerequisites: PMCOL 371, PHYSL 372.",
      "color": "#7b1905"
    },
    {
      "id": 294,
      "title": "NEURO 472",
      "desc": "Lectures presented by members of the Neuroscience and Mental Health Institute (NMHI) on neurophysiological, anatomical, clinical, pharmacological and cellular aspects of the autonomic nervous system. Topics include neural regulation of homeostasis and reproduction, disorders of autonomic function, sympathetically maintained pain, effects of spinal cord injury and current research issues. Prerequisites: PHYSL 210 or 212/214 or ZOOL 241 or equivalent and PMCOL 202 or 371 or ZOOL 342 or PHYSL 372.",
      "color": "#7b1905"
    },
    {
      "id": 295,
      "title": "NEURO 496",
      "desc": "An interdisciplinary course designed to introduce students in biological science programs (Biology, Neuroscience, Kinesiology, Physiology and Psychology) to computational neuroscience. Students will learn the basic methods of computer programming and how computer simulations can be used to further our understanding of neurons, neuronal networks, processing of sensory information, and control of movements. The lectures are complemented by laboratory exercises that will allow students to develop programming skills and to construct computer simulations of neurophysiological processes. Prerequisites: PMCOL 371 or PHYSL 372 or KIN 302 or ZOOL 342 or permission of instructor.",
      "color": "#7b1905"
    },
    {
      "id": 301,
      "title": "NEURO 510",
      "desc": "Designed to provide graduate students in the Neuroscience program a comprehensive overview of the neurobiology of normal aging and the cellular/molecular phenomena that may underlie various age-related neurodegenerative diseases. Aspects of neuronal and glial changes during the normal aging process will be covered. We also intend to include a video presentation of patients with neurodegenerative disorders to outline the impact of cellular/molecular changes on major clinical and psychological features. In addition, papers on the most recent developments in the field of aging research have been integrated into the course. Prerequisites: NEURO 375 or PMCOL 371 or ZOOL 342 or consent from course coordinator. Credit may be obtained for either NEURO 410 or 510 but not both.",
      "color": "#7b1905"
    },
    {
      "id": 302,
      "title": "NEURO 511",
      "desc": "Designed to provide graduate students in the Neuroscience program a comprehensive overview on neurobiology of various neurodegenerative disorders. Both clinical and basic science aspects of major neurodegenerative disorders such as Alzheimer's disease, Parkinson's disease, Huntington disease, Prion disease, Motor neuron disease (MND), Frontotemporal Dementia, Multiple Sclerosis and Chronic Traumatic Encephalopathy will be covered. We also intend to include a video presentation of patients with neurodegenerative disorders to outline major clinical and psychological features. In addition, papers on the most recent developments in the field of aging research have been integrated into the course. Prerequisites: NEURO 375 or PMCOL 371 or ZOOL 342 or consent from course coordinator. Credit may be obtained for either NEURO 411 or 511 but not both.",
      "color": "#7b1905"
    },
    {
      "id": 323,
      "title": "ONCOL 520",
      "desc": "The course will provide an introduction to the basic science of oncology. Topics to be covered comprise: the genetic basis of cancer, including the role of proto-oncogenes and tumor suppressor genes; mechanisms of carcinogenesis and radiation-sensitivity, including DNA repair and cell cycle control; the molecular basis of tumor metastasis, including tumor cell invasion, extravasation and dormancy; the role of inflammation in cancer initiation and progression; angiogenesis; cancer genetics, and epigenetics; cell signaling; experimental therapeutics; cancer stem cells; drug-resistance; metabolism and palliation. Course offered in alternate (even-numbered) years. Prerequisites: BIOCH 200, and one of the following: BIOCH 320 or 330 or ONCOL 320.",
      "color": "#72961e"
    },
    {
      "id": 325,
      "title": "ONCOL 550",
      "desc": "Fundamentals of radiation physics, production and properties of ionizing radiation and their interactions with matter and tissue. Interactions of photons and of charged particles with matter. Concepts of radiation dosimetry (theoretical and experimental, cavity theory and ionization chambers). Consent of Department required.",
      "color": "#72961e"
    },
    {
      "id": 328,
      "title": "ONCOL 556",
      "desc": "Practical experience with medical physics applied to diagnostic imaging. Operation of radiographic imaging systems and their evaluation with various test equipment and dosimetry systems. Introduction to the operation and evaluation of some advanced imaging modalities. Prerequisites: ONCOL 550 and 562. Corequisites: ONCOL 568 and 564.",
      "color": "#72961e"
    },
    {
      "id": 331,
      "title": "ONCOL 562",
      "desc": "A system theory approach to the production, analysis, processing and reconstruction of medical images. An extensive use of Fourier techniques is used to describe the processes involved with conventional radiographic detectors, digital and computed radiography. Review and application of image processing techniques used in diagnostic and therapeutic medicine. Consent of Department required.",
      "color": "#72961e"
    },
    {
      "id": 332,
      "title": "ONCOL 564",
      "desc": "Discussion of the fundamental physics of radioactivity, the use of unsealed sources in medical diagnosis and treatment. Unsealed source dosimetry, nuclear measurement instrumentation, spectrometry. Design and function of gamma cameras, single photon emission tomography, and positron emission tomography. Prerequisites: ONCOL 550 and 562.",
      "color": "#72961e"
    },
    {
      "id": 334,
      "title": "ONCOL 568",
      "desc": "Rigorous development of the physics of x-ray production, interaction and detection in diagnostic radiology, including mammography and ultrasound. In-depth analysis of analog and digital systems in radiography and fluoroscopy is given. The description and design of computed tomographic systems as well as the associated reconstruction algorithms from single to multislice helical systems are studied. Prerequisites: ONCOL 550, 562.",
      "color": "#72961e"
    },
    {
      "id": 340,
      "title": "ONCOL 620",
      "desc": "A directed reading and seminar course based on recent developments in the cellular and molecular biology of cancer. The students will critically review papers selected from the recent literature and give oral presentations. Prerequisites: ONCOL 520 and consent of Department. Offered in alternate years.",
      "color": "#72961e"
    },
    {
      "id": 347,
      "title": "PMCOL 200 - Drugs",
      "desc": "Using examples of commonly used drugs (both therapeutic and illicit), we will explore what drugs do to the human body and in turn, what the body does to drugs. Recommended for students with an interest in pursuing medical science degrees and programs. Prerequisites: CHEM 101 and BIOL 107 or equivalent. Open to 2nd and 3rd year students only.",
      "color": "#79ecfa"
    },
    {
      "id": 351,
      "title": "PMCOL 303",
      "desc": "The adverse effects of xenobiotics on biological systems are discussed. Principles of toxicology are introduced. Responses of target organs to selected toxicants are described, with emphasis on molecular mechanisms. Special topics include chemical carcinogenesis, nanotoxicology, and endocrine disruptors. Prerequisites: PMCOL 200,  BIOCH 200, PHYSL 210, or 212 and 214, or consent of Department.",
      "color": "#79ecfa"
    },
    {
      "id": 352,
      "title": "PMCOL 305",
      "desc": "An introduction to the complexities of drug abuse and the drugs of abuse. The student will be introduced to the psychological and social problems of drug abuse and their impact upon the abuser. Objectives of the course are to develop an understanding of addiction and a detailed knowledge of the nature of the commonly abused substances. Emphasis will be placed upon the pharmacology of drugs of abuse. Prerequisites: one of the following BIOCH 200, BIOL 201, CELL 201, PHYSL 210, PHSYL 212 and 214, PMCOL 200, PSYCO 275, ZOOL 241 and 242.",
      "color": "#79ecfa"
    },
    {
      "id": 354,
      "title": "PMCOL 343",
      "desc": "This course, together with the subsequent PMCOL 344, provides a comprehensive study of the modern science of pharmacology. The objective of the course is to study how drugs act on physiological systems with an emphasis on therapeutic applications. This course may be especially useful to those students who wish to pursue a career in health sciences. Prerequisite: a 200-level PMCOL course or consent of instructor. Pre or corequisite: PHYSL 210, or 212 and 214, or consent of instructor. In the case of over subscription, preference will be given to students in the Pharmacology Specialization or Honors Programs.",
      "color": "#79ecfa"
    },
    {
      "id": 355,
      "title": "PMCOL 344",
      "desc": "A continuation of PMCOL 343, this course will examine the therapeutic application of a variety of drugs and the mechanism(s) by which they affect physiological systems. Pre or co-requisite: PHYSL 210, or 212 and 214, or consent of instructor. In the case of over subscription, preference will be given to students in the Pharmacology Specialization or Honors Programs.",
      "color": "#79ecfa"
    },
    {
      "id": 357,
      "title": "PMCOL 401",
      "desc": "Independent research course. Hands-on experience is seen as a valuable asset for students graduating from BSc programs. With this in mind, this course provides an opportunity to work with a Faculty member on a research project during the Fall semester. The student and supervisor will mutually agree upon the details of the project. This is an excellent opportunity to learn current laboratory techniques, data analysis, laboratory notebook maintenance and presentation skills. Literature-based projects may also be available in which the student will be required to identify a research question and meet with the supervisor at regular intervals for discussion and guidance on preparation of a term paper and poster presentation. Prerequisites: PMCOL 343 and 344. Available only to students in the Pharmacology Specialization program or students who are granted consent by the Department of Pharmacology.",
      "color": "#79ecfa"
    },
    {
      "id": 358,
      "title": "PMCOL 402",
      "desc": "Independent research course. Hands-on experience is seen as a valuable asset for students graduating from BSc programs . With this in mind, this course provides an opportunity to work with a Faculty member on a research project during the Winter semester. The student and supervisor will mutually agree upon the details of the project. This is an excellent opportunity to learn current laboratory techniques, data analysis, laboratory notebook maintenance and presentation skills. Literature-based projects may also be available in which the student will be required to identify a research question and meet with the supervisor at regular intervals for discussion and guidance on preparation of a term paper and poster presentation. Prerequisites: PMCOL 343 and 344. Available only to students in the Pharmacology Specialization program or students who are granted consent by the Department of Pharmacology.",
      "color": "#79ecfa"
    },
    {
      "id": 359,
      "title": "PMCOL 403",
      "desc": "This course is designed to allow students to explore current topics and issues in pharmacology via projects such as literature reviews, systematic reviews, and community outreach and service. Under the guidance of a Faculty member, students will be expected to explore the current literature surrounding their topic of interest and will also be provided with selected readings by the supervisor. Prerequisites: PMCOL 303, PMCOL 305, PMCOL 343, PMCOL 344 or consent of instructor. This course will normally be restricted to students in the Pharmacology Specialization or Honors Programs. Students should consult the Department regarding the availability of projects.",
      "color": "#79ecfa"
    },
    {
      "id": 360,
      "title": "PMCOL 404",
      "desc": "Topics will include the drug discovery process, advanced concepts in pharmacodynamics and pharmacokinetics, the use of animal models of disease by the pharmaceutical industry, and therapeutic drug monitoring. Prerequisites: PMCOL 343 and PMCOL 344. In the case of over subscription, preference will be given to students in the Pharmacology Specialization or Honors Programs.",
      "color": "#79ecfa"
    },
    {
      "id": 361,
      "title": "PMCOL 412",
      "desc": "The goal of PMCOL 412 is to learn about the molecular basis of disorders of the nervous system, current therapies in use, as well as novel potential treatments that are in clinical trials or at the preclinical experimental stage. Research frontiers in pain and neurodegenerative disorders such as Alzheimer, Parkinson and Huntington's disease, amyotrophic lateral sclerosis and multiple sclerosis among others, will be explored. Novel therapeutic targets and the potential treatments of tomorrow will be discussed. Prerequisites: PMCOL 343 and 344 or 371 or ZOOL 342 or consent of instructor.",
      "color": "#79ecfa"
    },
    {
      "id": 362,
      "title": "PMCOL 415",
      "desc": "Critical discussion and analysis of current research papers in cardiovascular pharmacology, grouped into themes. Recent developments and use of the literature will be emphasized. In-class participation during roundtable discussion to critique assigned papers is essential. Each theme will be accompanied by the student's written analyses of papers assigned but not discussed in class, in the format of a condensation/critique. Prerequisites: PMCOL 343 and 344. In cases of limited space, preference will be given to students in the Pharmacology program.",
      "color": "#79ecfa"
    },
    {
      "id": 364,
      "title": "PMCOL 425",
      "desc": "Students will be presented with problem cases involving patients with conditions, possibly needing drug therapy. They will identify the issues needing resolution, work collectively to find information to resolve them, and present these and their application to each patient to the group. The group will work to resolve outstanding issues after the presentations. Intended for senior undergraduate students. Prerequisites: PMCOL 343 and 344 and consent of Instructor.",
      "color": "#79ecfa"
    },
    {
      "id": 365,
      "title": "PMCOL 450",
      "desc": "This course will provide an overview of the current understanding of blood glucose homeostasis, insulin secretion and action, the actions of other important blood sugar-regulating hormones and the pathology of diabetes. Current pharmacological approaches for lowering blood glucose will be discussed, as will the latest experimental approaches in identifying potential drug targets and new treatments for diabetes. At the end of the course, students should have an appreciation for the mechanisms that control glucose homeostasis in health and diabetes, the diversity of drug targets and mechanisms by which diabetes drugs promote glucose control, and current rationale and lines of research leading to potential new treatments. Prerequisites: PMCOL 343 and 344 or consent of instructor.",
      "color": "#79ecfa"
    },
    {
      "id": 366,
      "title": "PMCOL 475",
      "desc": "Regulation of various aspects of cell regulation, including proliferation, differentiation, metabolism, survival, motility, and gene transcription takes place via an array of well-organized signal transduction pathways. This course will cover topics related to the investigation of cellular transduction systems, and how pharmacological manipulation of these signaling pathways may be useful in the treatment of a diverse range of neurologic, neurodegenerative, inflammatory, immune, and metabolic diseases .Prerequisites: PMCOL 343 and 344 or PMCOL 371 or ZOOL 342 or consent of the instructor.",
      "color": "#79ecfa"
    },
    {
      "id": 375,
      "title": "PMCOL 525",
      "desc": "Students will be presented with problem cases involving patients with conditions, possibly needing drug therapy. They will identify the issues needing resolution, work collectively to find information to resolve them, and present these and their application to each patient to the group. The group will work to resolve outstanding issues after the presentations. Intended for graduate students. Prerequisites: PMCOL 343 and 344 and consent of Instructor.",
      "color": "#79ecfa"
    },
    {
      "id": 376,
      "title": "PMCOL 550",
      "desc": "This course is intended for graduate students and will provide an overview of the current understanding of blood glucose homeostasis, insulin secretion and action, the actions of other important blood sugar-regulating hormones and the pathology of diabetes. Current pharmacological approaches for lowering blood glucose will be discussed, as will the latest experimental approaches in identifying potential drug targets and new treatments for diabetes. At the end of the course, students should have an appreciation for the mechanisms that control glucose homeostasis in health and diabetes, the diversity of drug targets and mechanisms by which diabetes drugs promote glucose control, and current rationale and lines of research leading to potential new treatments. Prerequisites: PMCOL 343 and 344 or consent of Department.",
      "color": "#79ecfa"
    },
    {
      "id": 379,
      "title": "CHEM 101",
      "desc": "Atoms and molecules, states of matter, chemistry of the elements. Prerequisite: Chemistry 30, or equivalent.",
      "color": "#055d32"
    },
    {
      "id": 380,
      "title": "CHEM 102",
      "desc": "Rates of reactions, thermodynamics and equilibrium, electro-chemistry, modern applications of chemistry.  Prerequisite: CHEM 101.",
      "color": "#055d32"
    },
    {
      "id": 383,
      "title": "CHEM 164",
      "desc": "The study of basic molecular structure and reactivity of organic compounds based on their functional groups. Introduction to nomenclature, three dimensional structure, physical properties, and reactivity of compounds of carbon. Functional groups covered will emphasize alkanes, alkenes, alkynes, alkyl halides, alcohols, and some aromatics. Examples will include hydrocarbons (petroleum products), halogenated organic compounds (e.g., pesticides), and polymers of industrial importance which may be found in everyday life. Note: Students who already have credit in CHEM 101 must register in CHEM 261. Prerequisite: Chemistry 30 or equivalent. Restricted to students with CHEM 30 averages of 90% or higher, or departmental approval.",
      "color": "#055d32"
    },
    {
      "id": 384,
      "title": "CHEM 211",
      "desc": "Principles, methods, and experimental applications emphasizing solution phase equilibria, titrimetry, volumetric laboratory skills, evaluation of experimental data, and experimental applications of electrochemistry. Includes examples of organic and inorganic analysis. Prerequisite: CHEM 102.",
      "color": "#055d32"
    },
    {
      "id": 385,
      "title": "CHEM 213",
      "desc": "A continuation of CHEM 211 emphasizing the principles, methods, and experimental applications of separation techniques, and atomic and molecular spectrometry, and evaluation of experimental data. Includes examples of organic and inorganic analysis and use of the analytical literature. Prerequisite: CHEM 211. Students who have previously taken CHEM 313 may not take CHEM 213 for credit.",
      "color": "#055d32"
    },
    {
      "id": 386,
      "title": "CHEM 241",
      "desc": "The chemistry of main-group elements including a survey of the structure, bonding, and reactivity of their compounds. Transition-metal chemistry will be introduced. The course will include applications in industrial, biochemical, environmental, and materials science. Students who have obtained credit for CHEM 331 cannot take CHEM 241 for credit. Prerequisites: CHEM 102 or 105 and CHEM 161 or 164 or 261.",
      "color": "#055d32"
    },
    {
      "id": 387,
      "title": "CHEM 243",
      "desc": "An extension of CHEM 241 with emphasis on the bonding, structure, and reactivity of transition-metal elements. The course will include applications in industrial, biochemical, environmental, and materials science. For Chemistry Honors and Specialization students only, except by consent of Department. Prerequisites: CHEM 241 or consent of Department.",
      "color": "#055d32"
    },
    {
      "id": 388,
      "title": "CHEM 261",
      "desc": "The correlation of structure and chemical bonding in carbon compounds with the physical properties and chemical reactivity of organic molecules. Discussion will be based on functional groups with emphasis on hydrocarbons and derivatives that contain halogens, oxygen, sulfur, and the hydroxy group. Introduction to stereochemistry, three dimensional structure, reaction mechanisms, especially addition to double bonds, nucleophilic substitution and elimination reactions. Prerequisite CHEM 101 or 103. Note: Students who have obtained credit for CHEM 161 or 164 cannot take CHEM 261 for credit. Engineering students who take this course will receive *4.5.",
      "color": "#055d32"
    },
    {
      "id": 389,
      "title": "CHEM 263",
      "desc": "Continuation of the structural and chemical properties of the basic functional groups of organic compounds including alkynes, aromatic compounds, aldehydes, ketones, carboxylic acids and their derivatives and amines. Illustration of these functional groups in natural products such as carbohydrates, amino acids and proteins, nucleic acids and lipids. Discussion of the application of spectroscopic methods for the structure determination in simple organic molecules. Prerequisites: CHEM 161 or 164 or 261 or SCI 100. Note: Students who have obtained credit for CHEM 163 cannot take CHEM 263 for credit.",
      "color": "#055d32"
    },
    {
      "id": 391,
      "title": "CHEM 265",
      "desc": "A remote delivery offering that is a continuation of the structural and chemical properties of the basic functional groups of organic compounds including alkynes, aromatic compounds, aldehydes, ketones, carboxylic acids and their derivatives and amines. Illustration of these functional groups in natural products such as carbohydrates, amino acids and proteins, nucleic acids and lipids. Discussion of the application of spectroscopic methods for the structure determination in simple organic molecules. Seminars will emphasize the virtual application of laboratory techniques in standard organic reactions, as well as online workshops for NMR and structure determination. Prerequisites: CHEM 261 or 264. Note: Students who have obtained credit for CHEM 263 cannot take CHEM 265 for credit.",
      "color": "#055d32"
    },
    {
      "id": 394,
      "title": "CHEM 282",
      "desc": "An introduction to the quantum view of nature with applications to atomic and molecular structure. Methods to describe the quantum world are introduced, used to describe simple electronic, vibrational and rotational structure of model systems, and applied to the hydrogen atom, many-electron atoms, simple diatomic molecules, and the electronic structure of polyatomic molecules. The laboratory portion of the course consists of practical applications enriching and illustrating the lecture material, and incorporates the use of computers as a routine aid to processing experimental results. Prerequisites: CHEM 102 or 105; one 200-level CHEM course; MATH 115 or 136 or 146 and PHYS 124 or 144. Corequisite: PHYS 146 if PHYS 144 presented as a prerequisite instead of PHYS 124.",
      "color": "#055d32"
    },
    {
      "id": 395,
      "title": "CHEM 298",
      "desc": "The course is an integrated introduction to the qualitative and instrumentation aspects of spectroscopy and its applications in chemistry. The subjects will include: absorption, emission, vibrational and rotational spectroscopy of atoms and molecules; and nuclear magnetic resonance spectroscopy. For Chemistry Honors and Specialization students only, except by consent of Department. Prerequisite: CHEM 102 or 105; CHEM 163 or 263.",
      "color": "#055d32"
    },
    {
      "id": 398,
      "title": "CHEM 303",
      "desc": "The chemistry of environmental processes. Atmospheric chemistry; thermal and photochemical reactions of atmospheric gases including oxygen, ozone, hydroxy radical, and oxides of nitrogen and sulfur. Aquatic chemistry; characterization, reactions, and equilibria of dissolved species, water purification treatments. Metals and organohalides in the environment. Risk assessment. Prerequisites: CHEM 102; CHEM 164 or 261; CHEM 263; and one 200-level CHEM course or CH E 243.",
      "color": "#055d32"
    },
    {
      "id": 399,
      "title": "CHEM 305",
      "desc": "The lecture and laboratory portions of this course will highlight sorption and phase partitioning; hydrolysis reactions; convective/diffusive transport; properties and behaviour of particles, including sedimentation, coagulation, and light scattering; and the significance of particulate matter in the atmosphere. Quantitative calculations will be emphasized. The lecture component will provide theoretical background for experiments and instrumentation used for chemical measurements. The course also includes an independent, student-designed air quality monitoring project. Prerequisites: CHEM 263; CHEM 213 or 298 or 313; CHEM 303 or 373. Note: Restricted to students in the Environmental Physical Sciences and Chemistry (Honors, Specialization, and General Science with concentration in Chemistry) programs.",
      "color": "#055d32"
    },
    {
      "id": 400,
      "title": "CHEM 313",
      "desc": "Instrumentation and analytical applications of spectroscopic, chromatographic and electroanalytical methods are discussed and applied in the laboratory. Prerequisites: CHEM 211 and PHYS 124 or 144. PHYS 126 or 146 is recommended.",
      "color": "#055d32"
    },
    {
      "id": 402,
      "title": "CHEM 361",
      "desc": "Mechanisms and reactions of aromatic and aliphatic compounds. Prerequisites: CHEM 102; CHEM 163 or 263.",
      "color": "#055d32"
    },
    {
      "id": 403,
      "title": "CHEM 371",
      "desc": "A study of the implications of the laws of thermodynamics for transformations of matter including phase changes, chemical reactions, and biological processes. Topics include: thermochemistry; entropy change and spontaneity of processes; activity and chemical potential; chemical and phase equilibria; properties of solutions; simple one- and two-component phase diagrams. The conceptual development of thermodynamic principles from both macroscopic and molecular levels, and the application of these principles to systems of interest to chemists, biochemists, and engineers will be emphasized. Note: This course may not be taken for credit if credit has already been received in CHEM 271. Prerequisites: CHEM 102 or 105; MATH 101 or 115 or 136 or 146. Engineering students who take this course will receive *4.5.",
      "color": "#055d32"
    },
    {
      "id": 404,
      "title": "CHEM 373",
      "desc": "A continuation of CHEM 371 in which the physical properties of chemical systems and the dynamics and energetics of chemical processes are discussed. Topics include: colligative properties; electrochemical cells and ion activities, implications for ionic equilibria; kinetic theory and transport properties of gases and liquids; surfaces and colloid chemistry; reaction dynamics, detailed mechanisms of chemical reactions, catalysis. The emphasis will be on the development of principles of physical chemistry and their application to properties and processes of interest to chemists, biochemists, and engineers. Note: This course may not be taken for credit if credit has already been received in CHEM 273 or 275. Prerequisite: CHEM 371 or 271.",
      "color": "#055d32"
    },
    {
      "id": 405,
      "title": "CHEM 398",
      "desc": "An integrated course in the quantitative and more advanced aspects of spectroscopy and its applications in chemistry. The subjects may include: absorption, emission, dichroism, vibrational and rotational spectroscopy of molecules; time-resolved spectroscopy; nuclear magnetic resonance spectroscopy; surface-specific spectroscopies. Prerequisites: CHEM 282; 298.",
      "color": "#055d32"
    },
    {
      "id": 411,
      "title": "CHEM 419",
      "desc": "This is a two-part course with the first half consisting of an introduction to bioanalytical chemistry and the second half consisting of environmental analytical chemistry. The bioanalytical component will focus on methods used to analyze biomolecules and the analytical methods that exploit the molecular recognition properties of biomolecules. Topics may include antibodies, immunoassays, surface plasmon resonance, biosensors, gel electrophoresis, DNA sequencing, microscopy and imaging. The environmental component will cover methods and strategies used to measure trace levels of contaminants in complex environmental matrices, including air, water, soil, and biota. Topics may include sample handling and quality control, sample preparation and matrix effects, modern analytical instrumentation, measurement of reactive species, and online analysis techniques. Prerequisites: BIOCH 200 and CHEM 313 or BIOCH 200, CHEM 213 and a 300-level Chemistry course.",
      "color": "#055d32"
    },
    {
      "id": 420,
      "title": "CHEM 451",
      "desc": "Introduction to the methods used to analyze and manipulate biological systems using engineered biomolecules and synthetic organic molecules. Topics may include biomolecule structure and function, enzymology, molecular biology, protein engineering, genome engineering, bioinformatic methods, inhibitor design, library screening methods, fluorescent probes, bioorthogonal chemistry, and various chemical biology methods. Prerequisites: BIOCH 200 and CHEM 361 (can be taken as co-requisite).",
      "color": "#055d32"
    },
    {
      "id": 421,
      "title": "CHEM 454",
      "desc": "Discussion of organic reactions to modify or label biopolymers including proteins, carbohydrates, and nucleic acids. Topics will include mechanistic and methodological details of commonly employed reactions used for chemoselective labeling or modification of biomolecules to produce synthetic vaccines, antibody-drug conjugates, and native chemical ligation will be discussed. Prerequisites: CHEM 361 and BIOCH 200, or consent of instructor. Note: This course may not be taken for credit if credit has already been received in CHEM 464.",
      "color": "#055d32"
    },
    {
      "id": 427,
      "title": "CHEM 479",
      "desc": "Rate laws for simple and complex reactions, reaction mechanisms, potential energy surfaces, molecular dynamics, theories of reaction rates, catalysis, with application to gas and liquid phase reactions, photochemical reactions in chemistry and biology, and enzyme catalysis. Prerequisites: CHEM 273 or CHEM 373; MATH 215, PHYS 230, and a 300-level Chemistry course.",
      "color": "#055d32"
    },
    {
      "id": 464,
      "title": "BIOIN 301",
      "desc": "Introduction to computational tools and databases used in the collection and analysis of sequence data and other analytical data from high-throughput molecular biology studies. Students will use existing tools, and learn the underlying algorithms and their limitations. Prerequisite: any 200-level Biological Sciences course or consent of instructor. Credit cannot be obtained for both BIOIN 301 and BIOL 501.",
      "color": "#e87b4f"
    },
    {
      "id": 465,
      "title": "BIOIN 401",
      "desc": "Advanced topics in bioinformatics will be covered. A major part of the course will be devoted to team-based projects involving writing novel bioinformatics tools to deal with current problems in bioinformatics. Prerequisites: BIOIN 301, a 300-level CMPUT course and a 300-level GENET course. (Offered jointly by the Departments of Computing Science and Biological Sciences). [Biological Sciences].",
      "color": "#e87b4f"
    },
    {
      "id": 467,
      "title": "ASTRO 120",
      "desc": "The development of astronomy and astronomical techniques, including results obtained from the latest orbiting observatories. The origin, evolution and nature of the Earth, the other planets and non-planetary bodies will be discussed. Viewing experience will be available using the campus observatory. Prerequisites: Mathematics 30-1 and Physics 30.",
      "color": "#8a8ea1"
    },
    {
      "id": 469,
      "title": "ASTRO 320",
      "desc": "Application of physics to stellar formation and stellar evolution; theoretical models and observational comparisons of main sequence stars, white dwarf stars, neutron stars, supernovae, black holes; binary star systems, stellar atmospheres and stellar spectra. Prerequisites: MATH 115, 118, 136, 146 or 156, and one of PHYS 124, PHYS 144, or EN PH 131, and one of PHYS 126, PHYS 146, or PHYS 130. Pre or corequisite: any 200-level PHYS course. Some additional knowledge of astronomy (ASTRO 120 and/or 122) is advantageous.",
      "color": "#8a8ea1"
    },
    {
      "id": 470,
      "title": "ASTRO 322",
      "desc": "The interstellar medium and interstellar reddening; galactic structure; kinematics and dynamics of stars in galaxies; quasars; introduction of cosmology. Prerequisites: MATH 115, 118, 136, 146, or 156 and one of PHYS 124, PHYS 144, or EN PH 131, and one of PHYS 126, PHYS 146, or PHYS 130, and PHYS 208 or 271. Previous knowledge of astronomy is advantageous. ASTRO 320 is strongly recommended.",
      "color": "#8a8ea1"
    },
    {
      "id": 472,
      "title": "ASTRO 430",
      "desc": "Observational cosmology; geometry and matter content of the Universe; physical processes in the early stages of the Universe; inflation, Big Bang nucleosynthesis and the cosmic microwave background radiation; cosmological aspects of galaxy formation and the growth of large-scale structure. Prerequisites: PHYS 310, MATH 334. Pre- or corequisite: PHYS 458.",
      "color": "#8a8ea1"
    },
    {
      "id": 473,
      "title": "ASTRO 465",
      "desc": "Stellar interiors and nuclear transformations; energy transport; model stars; variable stars; stellar evolution. Prerequisites: PHYS 310, 271, ASTRO 320, MATH 334. Note: Credit may be obtained for only one of ASTRO 465 or ASTRO 565.",
      "color": "#8a8ea1"
    },
    {
      "id": 477,
      "title": "PSYCO 104",
      "desc": "Principles and development of perception, motivation, learning, and thinking and their relationship to the psychological functioning of the individual. Fulfillment of the 1/4 laboratory credit typically entails serving as a research participant, but can be fulfilled through the completion of alternative assignments. The course is a prerequisite to all courses in the department and is normally followed by PSYCO 105. [Faculty of Science]",
      "color": "#62755d"
    },
    {
      "id": 478,
      "title": "PSYCO 105",
      "desc": "Introduction to the study of human individuality, personality, and social psychological processes. Some aspects of normal and abnormal human development, psychological assessment and treatment may be reviewed. Fulfillment of the ¼ laboratory credit typically entails serving as a research participant but can be fulfilled through the completion of alternative assignments. Prerequisite: PSYCO 104 or SCI 100. [Faculty of Arts]",
      "color": "#62755d"
    },
    {
      "id": 480,
      "title": "PSYCO 212",
      "desc": "Experimental and nonexperimental methods in psychology. Topics covered include philosophy of science, measurement, reliability and validity of methods, measures, and effects; experimental quasi-experimental, and single-subject designs; biases in experimentation; and research ethics. Prerequisites: PSYCO 104 or SCI 100, and PSYCO 105, and STAT 141 or 151 or 161. [Faculty of Arts]",
      "color": "#62755d"
    },
    {
      "id": 481,
      "title": "PSYCO 223",
      "desc": "Introduction to biological, cognitive and social aspects of psychological development. Prerequisites: PSYCO 104 or SCI 100, and PSYCO 105 or equivalent. [Faculty of Arts]",
      "color": "#62755d"
    },
    {
      "id": 482,
      "title": "PSYCO 239",
      "desc": "Nature and treatment of psychological disorders, such as cross-disciplinary perspectives and an emphasis on improving understanding of psychopathology in everyday life. Prerequisites: PSYCO 104 or SCI 100, and PSYCO 105. Not open to students with credit in PSYCO 339. [Faculty of Arts]",
      "color": "#62755d"
    },
    {
      "id": 483,
      "title": "PSYCO 241",
      "desc": "A survey of theories and research on the individual in a social context. Prerequisites: PSYCO 104 or SCI 100, and PSYCO 105 or equivalent. Note: PSYCO 241 and SOC 241 may not both be taken for credit. [Faculty of Arts]",
      "color": "#62755d"
    },
    {
      "id": 484,
      "title": "PSYCO 258",
      "desc": "A survey of findings of theoretical issues in the study of cognition, such as perception, attention, knowledge representation, memory, learning, language, reasoning, and problem solving. Prerequisites: PSYCO 104 or SCI 100, and STAT 141 or 151 or 161 or SCI 151. [Faculty of Science]",
      "color": "#62755d"
    },
    {
      "id": 485,
      "title": "PSYCO 275",
      "desc": "An introduction to brain mechanisms involved in sensation, perception, movement, motivation, learning, and cognition, as studied in both humans and lower animals. Prerequisites: PSYCO 104 or SCI 100. [Faculty of Science]",
      "color": "#62755d"
    },
    {
      "id": 486,
      "title": "PSYCO 282",
      "desc": "A study of applications of learning principles and laboratory findings to behavior problems in educational, clinical, and social settings, with emphasis on empirical research demonstrating the effectiveness of behavior modification and cognitive/behavioral techniques. Not open to students with credit in PSYCO 281. Prerequisites: PSYCO 104 or SCI 100. [Faculty of Science]",
      "color": "#62755d"
    },
    {
      "id": 487,
      "title": "PSYCO 299",
      "desc": "A credit/no-credit course for supervised participation in a faculty research project. Normally taken after completion of a minimum of *30 but not more than *60. Prerequisites: GPA of 2.5 or higher, PSYCO 104 or SCI 100 and one other PSYCO course; and consent of Department. Specific projects may require additional prerequisites. Project and course information available at ROPP website or Department of Psychology. Prospective enrollees in PSYCO 299 must apply to the Department of Psychology. Note: Application does not guarantee an ROPP position. Credit may be obtained twice. [Faculty of Science]",
      "color": "#62755d"
    },
    {
      "id": 489,
      "title": "PSYCO 302",
      "desc": "Review and discussion of special topics or methods in one or more of the areas of contemporary psychology such as experimental, perception, physiological, learning, memory, behavior, quantitative. Prerequisites: PSYCO 104 or SCI 100 and PSYCO 105 and one 200-level Psychology course. Students must check with the Department for the topics for the year and any additional prerequisites. [Faculty of Science]",
      "color": "#62755d"
    },
    {
      "id": 491,
      "title": "PSYCO 304",
      "desc": "An overview of the scientific discipline of psychology since the mid-20th century. Prerequisites:  PSYCO 104 or SCI 100 and PSYCO 105; one 200-level PSYCO offered by the Faculty of Arts; one 200-level PSYCO offered by the Faculty of Science. [Faculty of Science]",
      "color": "#62755d"
    },
    {
      "id": 492,
      "title": "PSYCO 305",
      "desc": "Review and discussion of special topics or methods in one or more of the areas of contemporary psychology such as developmental, social, personality, cognitive. Prerequisites: PSYCO 104 or SCI 100, and PSYCO 105. Note: Consult with the Department for the specific topic offered each year and any additional prerequisites. [Faculty of Arts]",
      "color": "#62755d"
    },
    {
      "id": 494,
      "title": "PSYCO 323",
      "desc": "Biological, cognitive and social aspects of psychological development during the period from infancy to childhood. Prerequisite: PSYCO 223. [Faculty of Arts]",
      "color": "#62755d"
    },
    {
      "id": 498,
      "title": "PSYCO 333",
      "desc": "An in-depth treatment of psychological theories of personality. Prerequisites: PSYCO 223, 239, or 241. Note: Not open to students with credit in PSYCO 233 or PSYCO 305 Topic: Personality. [Faculty of Arts].",
      "color": "#62755d"
    },
    {
      "id": 500,
      "title": "PSYCO 341",
      "desc": "Study of cultural variations in psychological processes such as self-perception, cognition, emotion, and motivation. The course also introduces the issues of cultural evolution and multiculturalism. Prerequisites: one of PSYCO 223, 241, or 258. [Faculty of Arts]",
      "color": "#62755d"
    },
    {
      "id": 501,
      "title": "PSYCO 342",
      "desc": "Introduction to research on social influence, including theory and empirical research on conformity, compliance, and obedience. Prerequisites: PSYCO 241 or SOC 241. Note: Not open to students with credit in PSYCO 305 Topic: Social Influence. [Faculty of Arts].",
      "color": "#62755d"
    },
    {
      "id": 502,
      "title": "PSYCO 344",
      "desc": "Review of theory and research on communication processes in intercultural social interactions. Prerequisites: PSYCO 105. Note: Not open to students with previous credit in PSYCO 405 Topic: Intercultural Communications [Faculty of Arts].",
      "color": "#62755d"
    },
    {
      "id": 503,
      "title": "PSYCO 347",
      "desc": "A general overview of research and theory in the domain of relationships, based on classic and contemporary findings from the social psychological literature. Most of the course content will focus on adult romantic relationships. Prerequisites: PSYCO 241 or SOC 241. Note: Not open to students with credit in HECOL 210 or PSYCO 305 Topic: Interpersonal Relationships. [Faculty of Arts].",
      "color": "#62755d"
    },
    {
      "id": 504,
      "title": "PSYCO 350",
      "desc": "An introduction to the study of human memory. Topics include verbal learning and interference theory, the short-term/long-term memory distinction, semantic memory, working memory, sensory memory, autobiographical memory, amnesia, and implicit memory. The emphasis will be on developing coherent theoretical accounts of the evidence. Prerequisite: PSYCO 258. [Faculty of Arts]",
      "color": "#62755d"
    },
    {
      "id": 505,
      "title": "PSYCO 351",
      "desc": "This course will survey research on how people learn and remember spatial information, and navigate their environments. Topics may include neurology, individual differences, cultural and cross-species comparisons. Prerequisites: One of: PSYCO 258, 267 or 275. [Faculty of Science]",
      "color": "#62755d"
    },
    {
      "id": 506,
      "title": "PSYCO 354",
      "desc": "An introduction to the theories and research practices of cognitive science by examining contributions of cognitive psychology, artificial intelligence, linguistics, and neuroscience to a variety of research areas. Prerequisites: STAT 141 or 151 or 161 or SCI 151 and PSYCO 258. [Faculty of Science]",
      "color": "#62755d"
    },
    {
      "id": 509,
      "title": "PSYCO 367",
      "desc": "An introduction to theoretical and experimental issues associated with sensory and perceptual experience. Prerequisites: PSYCO 275 or 258. [Faculty of Science]",
      "color": "#62755d"
    },
    {
      "id": 510,
      "title": "PSYCO 371",
      "desc": "The aim of this course is to provide students with an introduction to the neural basis of learning and memory. The course begins with a review of the historical background, experimental methods, and principles of neurobiology. Learning and memory are then analyzed at different levels of biological organization, including molecular, cellular, neural circuit, neural system, and behavioral levels. Prerequisite: PSYCO 275. [Faculty of Science]",
      "color": "#62755d"
    },
    {
      "id": 511,
      "title": "PSYCO 372",
      "desc": "An examination of the influence of genetic variations on behavioral differences in infra-human and human populations. Prerequisites: PSYCO 104 or SCI 100 and PSYCO 105 and STAT 141 or 151 or 161 or SCI 151 and BIOL 207. [Faculty of Science]",
      "color": "#62755d"
    },
    {
      "id": 514,
      "title": "PSYCO 381",
      "desc": "Principles and processes of learning including a consideration of classical conditioning, instrumental learning, and memory. Research involving non-human animals will be emphasized. Prerequisites: STAT 141 or 151 or 161 or SCI 151 and PSYCO 281 or 282. [Faculty of Science]",
      "color": "#62755d"
    },
    {
      "id": 521,
      "title": "PSYCO 403",
      "desc": "Discussion of advanced concepts and theories developed by selected fields within experimental psychology. The course will examine the relation between theory and data in these fields. Prerequisites: STAT 141 or 151 or 161 or SCI 151 and a 300-level PSYCO course. Students must check with the Department for the topics for the year and any additional prerequisites. [Faculty of Science]",
      "color": "#62755d"
    },
    {
      "id": 522,
      "title": "PSYCO 405",
      "desc": "Review and discussion of special theoretical or methodological topics, or a novel or emerging research areas in contemporary psychology. Prerequisites: PSYCO 104 or SCI 100, and PSYCO 105, and STAT 141 or 151 or 161. Note: Consult with the Department for the specific topic offered each year and any additional prerequisites. [Faculty of Arts].",
      "color": "#62755d"
    },
    {
      "id": 524,
      "title": "PSYCO 412",
      "desc": "The assumptions that inform the design of experimental, quasi-experimental, and field studies in sociocultural psychology; the development of scales, questionnaires, and survey instruments, and the coordination of quantitative and qualitative research methods. Prerequisites: PSYCO 212, and one of PSYCO 223, 233, 241, or 341. [Faculty of Arts]",
      "color": "#62755d"
    },
    {
      "id": 526,
      "title": "PSYCO 415",
      "desc": "The assumptions that inform the design of qualitative research in sociocultural psychology; the procedures for gathering meaningful information through interviews, conversation, observed interaction, and textual archives; and the analysis of such information. Prerequisites: STAT 141 or 151 or 161, and PSYCO 212, and one of PSYCO 223, 233, 241, or 341. [Faculty of Arts].",
      "color": "#62755d"
    },
    {
      "id": 527,
      "title": "PSYCO 421",
      "desc": "An in-depth review and analysis of research in an area of human development. Prerequisites: STAT 141 or 151 or 161 or SCI 151, and PSYCO 323 or PSYCO 327 or PSYCO 329. Note: Consult with the Department for the specific topic offered each year and any additional prerequisites. [Faculty of Science]",
      "color": "#62755d"
    },
    {
      "id": 528,
      "title": "PSYCO 423",
      "desc": "An in-depth review and analysis of research in an area of developmental psychology. Prerequisites: STAT 141 or 151 or 161, and PSYCO 323 or PSYCO 327 or 329. Note: Consult with the Department for the specific topic offered each year and any additional prerequisites. [Faculty of Arts].",
      "color": "#62755d"
    },
    {
      "id": 529,
      "title": "PSYCO 431",
      "desc": "The nature of psychological tests: some practical work in administration, scoring and interpretation of tests. Prerequisites: STAT 141 or 151 or 161 and PSYCO 333 or 335. [Faculty of Arts].",
      "color": "#62755d"
    },
    {
      "id": 532,
      "title": "PSYCO 440",
      "desc": "Prerequisites: PSYCO 341 or PSYCO 343 [Faculty of Arts]",
      "color": "#62755d"
    },
    {
      "id": 534,
      "title": "PSYCO 443",
      "desc": "Advanced treatment of topics in the study of how we think about the world of persons and events. Topics may include the role of categories, schemas, theories, and heuristics in social cognition, factors underlying the stereotyping of persons and groups, and the question of motivated bias in social perception. Prerequisites: STAT 141 or 151 or 161 and PSYCO 241. [Faculty of Arts].",
      "color": "#62755d"
    },
    {
      "id": 535,
      "title": "PSYCO 445",
      "desc": "The purpose of this course is to use a combination of social psychological theory, research and feature length films to explore the psychological determinants of important forms of human social behavior. Topics include the existential realities of the human condition, aggression, obedience, prejudice, attraction, and relationships. Prerequisites: One of STAT 141 or 151 or 161 or PSYCO 212, and one of PSYCO 333, 342, 343, or 347. PSYCO 212 is strongly recommended. Note: Not open to students with credit in PSYCO 405 Topic: Studies of Self Through Cinema. [Faculty of Arts].",
      "color": "#62755d"
    },
    {
      "id": 536,
      "title": "PSYCO 447",
      "desc": "Review of theory and research on the self, primarily from a social psychological perspective. Prerequisites: One of STAT 141 or 151 or 161 or PSYCO 212, and one of PSYCO 342 or PSYCO 347. PSYCO 212 is strongly recommended. Note: Not open to students with credit in PSYCO 405 Topic: Self and Identity. [Faculty of Arts].",
      "color": "#62755d"
    },
    {
      "id": 539,
      "title": "PSYCO 457",
      "desc": "Introduction to theory and practice of embodied cognitive science, focusing on phenomena that emerge from agent-environment, including how even simple agents can produce apparently complex behavior. Prerequisites: STAT 141 or 151 or 161 or SCI 151, PSYCO 354 and one other 300-level psychology course. [Faculty of Science]",
      "color": "#62755d"
    },
    {
      "id": 540,
      "title": "PSYCO 458",
      "desc": "In depth examination of one or more topics in cognitive psychology. Topics may include knowledge representation, visual cognition, memory, learning, decision making, language, reasoning and problem-solving. Prerequisites: one of PSYCO 350, 354, 356, 357, or 365. [Faculty of Science]",
      "color": "#62755d"
    },
    {
      "id": 541,
      "title": "PSYCO 459",
      "desc": "A survey of the sensory, perceptual, memory, and cognitive changes in normal aging. Topics may include the relationship of psychological, environmental, social and health factors to cognitive processes. Prerequisites: PSYCO 258 and a 300-level Psychology course. [Faculty of Science]",
      "color": "#62755d"
    },
    {
      "id": 542,
      "title": "PSYCO 471",
      "desc": "A survey of theory, methods, and analysis of various neurophysiological techniques utilized in brain-behaviour research. The dynamics of in vivo recordings will be extensively covered. Prerequisites: One of PSYCO 371, 375, 377 or PMCOL 371. [Faculty of Science]",
      "color": "#62755d"
    },
    {
      "id": 546,
      "title": "PSYCO 483",
      "desc": "The course critically evaluates research and theory in spatial cognition and navigation. Topics may include research from: comparative cognition, developmental psychology, evolution and ecology, human cognition, neuroscience or artificial intelligence. Prerequisites: STAT 141 or 151 or SCI 151, and PSYCO 351 or 381. [Faculty of Science]",
      "color": "#62755d"
    },
    {
      "id": 553,
      "title": "PSYCO 495",
      "desc": "An introduction to the psychological analysis of response to art. Consideration is both theoretical and empirical. Illustrative materials are drawn from several arts, including painting, sculpture and literature. The contribution of aesthetic behavior to personality development is considered. Prerequisites: One of PSYCO 233,  241, or  341; and a senior level course in ART, ART H, C LIT, DES, DRAMA, ENGL, F ST, MUSIC or WRITE. [Faculty of Arts]",
      "color": "#62755d"
    },
    {
      "id": 577,
      "title": "MICRB 265",
      "desc": "This course will focus on the structure and physiology of free-living and pathogenic bacteria. The diversity of their metabolic activities, the interaction of microbes with their environment, symbiotic relationships and cell-to-cell communication are major topics. Lectures and laboratory exercises are coordinated to explore topics in basic microbiology, environmental microbiology, molecular microbiology, and the production of economically or medically important products through microbial biotechnology. Prerequisites: BIOL 107 and CHEM 164 or 261. SCI 100 may be used in lieu of BIOL 107 and CHEM 261.",
      "color": "#02891f"
    },
    {
      "id": 578,
      "title": "MICRB 311",
      "desc": "The structure, growth, and metabolic pathways used by bacteria, archaea, and unicellular eukaryotes. Emphasis is placed on the comparative biochemical aspects of microbial life. Prerequisites: MICRB 265 and BIOCH 200 or 205. Credit cannot be obtained for both MICRB 311 and 511.",
      "color": "#02891f"
    },
    {
      "id": 580,
      "title": "MICRB 316",
      "desc": "Factors that affect prokaryotic gene expression at the levels of replication, transcription, post-transcriptional and post-translational control. Topics will include mobile genetic elements and their effect on chromosome structure and gene expression; alternate sigma factors; protein modification and degradation; RNA structure, processing and decay; and DNA modification and rearrangement in gene control. Prerequisites: GENET 270, MICRB 265 and BIOCH 203/205 or BIOCH 200. Note: MICRB 316 and 516 cannot both be taken for credit.",
      "color": "#02891f"
    },
    {
      "id": 582,
      "title": "MICRB 343",
      "desc": "Description and critical discussion of current techniques used for the isolation and characterization of macromolecular constituents of prokaryotic cells with emphasis on proteins. Prerequisites: MICRB 311 or consent of instructor.",
      "color": "#02891f"
    },
    {
      "id": 586,
      "title": "MICRB 423",
      "desc": "This advanced microbiology course will cover selected topics of life in extreme environments, with particular emphasis on diversity, evolutionary and physiological adaptations, methodology for studying extreme environments, the effective limits of life, implications for biogeochemical cycling, and astrobiology. Examples of adaptation to specific environments will be the focus of student projects. Oral presentations required. Prerequisites: BIOL 322 or any 300 level MICRB course or consent of instructor. Note: MICRB 423 and 523 cannot both be taken for credit.",
      "color": "#02891f"
    },
    {
      "id": 592,
      "title": "MICRB 523",
      "desc": "This advanced microbiology course will cover selected topics of life in extreme environments, with particular emphasis on diversity, evolutionary and physiological adaptations, methodology for studying extreme environments, the effective limits of life, implications for biogeochemical cycling, and astrobiology. Examples of adaptation to specific environments will be the focus of student projects. Oral presentations required. Lectures are the same as for MICRB 423, but with an additional assignment and evaluation appropriate to graduate studies. Prerequisites: consent of instructor. MICRB 423 and 523 cannot both be taken for credit.",
      "color": "#02891f"
    },
    {
      "id": 597,
      "title": "PHYS 124",
      "desc": "Algebra-based course primarily for students in life, environmental, and medical sciences. It guides the student through two distinct types of motion: motion of matter (particles) and wave motion. Vectors, forces, bodies in equilibrium, review of kinematics and basic dynamics; conservation of momentum and energy; circular motion; vibrations; elastic waves in matter; sound; wave optics; black body radiation, photons, de Broglie waves. Examples relevant in environmental, life, and medical sciences will be emphasized. Prerequisites: Physics 20 or equivalent, Mathematics 30-1. Physics 30 is strongly recommended. Note: Credit may be obtained for only one of PHYS 124, 144, EN PH 131 or SCI 100. Note: To proceed to PHYS 146 after taking PHYS 124, it is strongly recommended that a minimum grade of B- be achieved in PHYS 124.",
      "color": "#cf60f4"
    },
    {
      "id": 598,
      "title": "PHYS 126",
      "desc": "A continuation of PHYS 124 primarily for students in life, environmental, and medical science. Fluid statics and dynamics, gases, kinetic interpretation; electrostatics; currents and circuits; magnetic field; electromagnetic induction; nuclear radiation, its interaction with matter and applications. Prerequisite: PHYS 124 or PHYS 144. Note: Credit may be obtained for only one of PHYS 126, 130, 146 or SCI 100.",
      "color": "#cf60f4"
    },
    {
      "id": 599,
      "title": "PHYS 130",
      "desc": "Geometrical optics, optical instruments, oscillations, waves, sound, interference, diffraction. Prerequisites: Mathematics 30-1, Mathematics 31, Physics 30. Corequisite: MATH 100 or 113 or 114 or 117 or 134 or 144 or equivalent. Restricted to Engineering students. Other students who take this course will receive *3.0.",
      "color": "#cf60f4"
    },
    {
      "id": 600,
      "title": "PHYS 144",
      "desc": "A calculus-based course for students majoring in the physical sciences. Newtonian mechanics, including kinematics, dynamics, conservation of momentum and energy, rotational motion and angular momentum; special relativistic kinematics and dynamics, including length contraction, time dilation, and the conservation of energy and momentum in special relativity. Prerequisites: Mathematics 30-1 and Physics 30. Mathematics 31 is strongly recommended. Corequisites: MATH 117 or 144. Note: MATH 113 or 114 is not acceptable as a co-requisite but may be used as a pre-requisite in place of MATH 117 or 144. Note: Credit may be obtained for only one of PHYS 124, 144, EN PH 131 or SCI 100.",
      "color": "#cf60f4"
    },
    {
      "id": 601,
      "title": "PHYS 146",
      "desc": "A calculus-based course for students majoring in the physical sciences. Fluid statics and dynamics, elasticity and simple harmonic motion; sound waves, wave properties of light; quantum waves, wave-particle duality. Prerequisite: PHYS 124 (see Note following) or 144. Corequisite: MATH 118 or 146. Note: MATH 115 is not acceptable as a co-requisite but may be used as a pre-requisite in place of MATH 118 or 146. Note: Credit may be obtained for only one of PHYS 126, 130, 146 or SCI 100. Note: To proceed to PHYS 146 after taking PHYS 124, it is strongly recommended that a minimum grade of B- be achieved in PHYS 124.",
      "color": "#cf60f4"
    },
    {
      "id": 602,
      "title": "PHYS 208",
      "desc": "Experimental evidence for limitations of classical physics; Einstein's special theory of relativity; length contraction; time dilation; twin paradox; equivalence of mass and energy; relativistic mass and momentum; the photo-electric effect, the Compton effect, X-ray production and electron diffraction; a discussion of the Heisenberg uncertainty principle and the Schrodinger equation including applications of one dimensional potential wells and barriers; tunnelling; the simple harmonic oscillator; atomic physics; hydrogen atom; periodic table. Prerequisites: one of PHYS 124, PHYS 144, or EN PH 131, and one of PHYS 126, PHYS 146, or PHYS 130; MATH 113 or 114 or 134 or 144 or 154. Credit may be obtained in only one of PHYS 208 or 271.",
      "color": "#cf60f4"
    },
    {
      "id": 603,
      "title": "PHYS 230",
      "desc": "Electric fields, Gauss' Law; electric potential; capacitance and dielectrics; electric current and resistance; magnetic fields, Ampere's Law; Faraday's Law; inductance; magnetic properties of matter. Prerequisites: PHYS 130 or 146, and MATH 100 or 113 or 114 or 117. Pre- or corequisite: MATH 101 or 115 or 118. For Science students only: SCI 100 may be used in lieu of PHYS 146, MATH 114 and 115. Note: Restricted to Engineering students. Other students who take this course will receive *3.0. Credit may normally be obtained for only one of PHYS 230 or 281.",
      "color": "#cf60f4"
    },
    {
      "id": 604,
      "title": "PHYS 234",
      "desc": "Algorithms for scientific data analysis: sorting methods, polynomial fitting, regression, interpolation, and Fourier analysis: techniques for solving physics and geophysics problems with selected topics from mechanics, waves, geometrical optics and ray tracing, electricity and magnetism, statistical physics, decay processes, quantum physics, signal processing. Prerequisites: one of PHYS 124, PHYS 144, or EN PH 131, and one of PHYS 126, PHYS 146, or PHYS 130; and MATH 100 or 113 or 114 or 117 or 144, and MATH 102 or 125 or 127. CMPUT 174 is recommended for students without prior programming experience.",
      "color": "#cf60f4"
    },
    {
      "id": 605,
      "title": "PHYS 244",
      "desc": "Particle dynamics; oscillating systems and normal modes; conservative forces and energy; introduction to Lagrangian and Hamiltonian dynamics; central forces; orbital motion and scattering. Prerequisite: one of PHYS 124, PHYS 144, or EN PH 131, and one of PHYS 126, PHYS 146, or PHYS 130. Corequisite: MATH 120 or 125 or 127 or 102 or equivalent, and MATH 209 or 215 or 317 or equivalent.",
      "color": "#cf60f4"
    },
    {
      "id": 606,
      "title": "PHYS 261",
      "desc": "Energy in its various forms; conservation of energy; basic thermodynamics of ideal gases and phase changes; heat engines and refrigerators; consumption of energy resources; space heating and heat transfer; radioactivity; nuclear fission and nuclear power; alternative and renewable energy resources. Prerequisites: one of PHYS 124, PHYS 144, or EN PH 131, and one of PHYS 126, PHYS 146, or PHYS 130; and MATH 113 or 114 or 134 or 144 or 154.",
      "color": "#cf60f4"
    },
    {
      "id": 607,
      "title": "PHYS 271",
      "desc": "Experimental evidence for limitations of classical physics; review of special relativity: quantization of charge, light, and energy; blackbody radiation, photoelectric effect, Compton effect; models of the atom; wavelike properties of particles; the uncertainty principle, the Schrodinger Equation, the infinite and finite square well, the harmonic oscillator, tunneling; the hydrogen atom, orbital angular momentum and electron spin; spin and statistics; selected topics. Prerequisite: one of PHYS 124, PHYS 144, or EN PH 131, and one of PHYS 126, PHYS 146, or PHYS 130. Pre- or Corequisite: MATH 209 or 215 or 317 or equivalent. Note: Credit may be obtained in only one of PHYS 208 or 271.",
      "color": "#cf60f4"
    },
    {
      "id": 608,
      "title": "PHYS 281",
      "desc": "Electric fields; Gauss' law; electric potential; capacitance and dielectrics; electric current and resistance; DC circuits; magnetic fields; Ampere's Law; Faraday's Law; inductance; magnetic properties of matter, AC circuits; Maxwell's equations; electromagnetic waves. Prerequisite: one of PHYS 124, PHYS 144, or EN PH 131, and one of PHYS 126, PHYS 146, or PHYS 130. Corequisite: MATH 209 or 214 or 217 or equivalent. Credit may normally be obtained for only one of PHYS 230 or 281.",
      "color": "#cf60f4"
    },
    {
      "id": 609,
      "title": "PHYS 292A",
      "desc": "Experiments in mechanics, electromagnetism and atomic physics. Corequisites: PHYS 281 or 230, and MATH 209 or 214 or equivalent. Note: Restricted to Engineering students.",
      "color": "#cf60f4"
    },
    {
      "id": 610,
      "title": "PHYS 292B",
      "desc": "Experiments in mechanics, electromagnetism and atomic physics. Corequisites: PHYS 281 or 230, and MATH 209 or 214 or equivalent. Note: Restricted to Engineering students.",
      "color": "#cf60f4"
    },
    {
      "id": 611,
      "title": "PHYS 294",
      "desc": "Introduction to experimental physics through select, classic experiments in physics from the 19th through 21st centuries performed using contemporary instrumentation when possible. Introduction to the statistical treatment of uncertainties, and analysis and graphing of experimental data with open-source scientific software. Skill development in written and oral presentation of laboratory results. Prerequisites: MATH 100 or 113 or 114 or 117 or 134 or 144 or 154; one of PHYS 124, PHYS 144, or EN PH 131; and one of PHYS 126, PHYS 146 or PHYS 130. Note: PHYS 294 will not count towards degree credit for specialization or Honors programs offered by the physics department (including physics, geophysics, astrophysics and mathematical physics). Students enrolled in physics specialization or Honors programs are required to take PHYS 295 instead.",
      "color": "#cf60f4"
    },
    {
      "id": 612,
      "title": "PHYS 295",
      "desc": "Contemporary methods of experimental physics with measurements from classical and modern physics. Analysis and graphing of experimental data using programming techniques. Estimation and statistical treatment of experimental uncertainties consistent with standard practice in physics. Planning and record keeping for experimental work, written presentation of laboratory results. Prerequisites: MATH 101 or 115 or 118 or 146, one of PHYS 124, PHYS 144, or EN PH 131; and one of PHYS 126, PHYS 146, or PHYS 130. Note: To proceed to PHYS 295 after taking PHYS 126 a minimum grade of B+ in PHYS 126 and some experience of computer programming are strongly recommended.",
      "color": "#cf60f4"
    },
    {
      "id": 613,
      "title": "PHYS 297",
      "desc": "Contemporary methods of experimental physics with measurements from classical and modern physics. This is a continuation of Experimental Physics I with application of more advanced techniques and more in-depth exploration of the selected physics topics. Prerequisite: PHYS 295. Corequisites: PHYS 271, PHYS 281 and MATH 101 or 115 or 118 or 146.",
      "color": "#cf60f4"
    },
    {
      "id": 615,
      "title": "PHYS 308",
      "desc": "Classical and quantum statistics; fermions; bosons; molecular structure and spectra; molecular bonding; vibrational and rotational states; absorption; stimulated emission; population inversion; lasers; solid state physics; crystal structure; free-electron gas in metals; band theory of solids; semiconductors; semiconductor devices; superconductivity. Prerequisites: PHYS 208 or 271; MATH 101 or 115 or 118 or 136 or 146 or 156 or SCI 100. Note: Not available for credit towards Honours Physics and Mathematical Physics degree programs. Offered alternate years only. Consult Department for course scheduling.",
      "color": "#cf60f4"
    },
    {
      "id": 616,
      "title": "PHYS 310",
      "desc": "Temperature: heat, work, and the first law of thermodynamics; entropy and the second law, enthalpy, Helmholtz and Gibbs free energy; thermodynamic equilibrium criteria; Maxwell's relations, phase transitions; elementary kinetic theory of gases. Prerequisites: one of PHYS 124, PHYS 144, or EN PH 131, and one of PHYS 126, PHYS 146, or PHYS 130. Pre- or corequisite: MATH 209 or 215 or 317 or equivalent.",
      "color": "#cf60f4"
    },
    {
      "id": 617,
      "title": "PHYS 311",
      "desc": "Quantum states, probability distributions, temperature and entropy; canonical ensemble and the partition function; ideal gases, paramagnets; blackbody radiation. Debye model for phonons; quantum statistics; Fermi-Dirac distribution and electrons in metals; Bose-Einstein distribution. Prerequisites: PHYS 310 (or CH E 243 for Engineering Physics Program students), PHYS 271 and MATH 209 or 215 or 317 or equivalent.",
      "color": "#cf60f4"
    },
    {
      "id": 619,
      "title": "PHYS 364",
      "desc": "Calculation of pollutant concentrations using principles of materials balance; vertical variation of pressure and temperature in the atmosphere; atmospheric stability and the dispersal of air pollutants; water vapour and humidity; blackbody radiation and Earth's global energy balance; molecular absorption of electromagnetic radiation; the ozone problem; the radon problem. Prerequisites: PHYS 261, and MATH 101 or 115 or 118 or 136 or 146 or 156 or SCI 100. Offered alternate years only. Consult Department for course scheduling.",
      "color": "#cf60f4"
    },
    {
      "id": 620,
      "title": "PHYS 372",
      "desc": "Origins of quantum mechanics; wave functions; Schrodinger equation and its application to one dimensional systems, postulates and physical interpretation of quantum mechanics; orbital angular momentum, central potentials and three-dimensional systems. Prerequisites: PHYS 271, PHYS 230 or 281, MATH 225 or 227 (or 102), MATH 334 or 201.",
      "color": "#cf60f4"
    },
    {
      "id": 621,
      "title": "PHYS 381",
      "desc": "Review of scalar and vector fields; Gauss and Stokes theorems; curvilinear coordinates; Dirac delta function; electrostatic field and potential; electrostatic energy; conductors, capacitors; Laplace's equation; boundary value problems; methods of images; multipoles; electrostatic field in matter; polarization; displacement; linear dielectrics; magnetostatic field; Biot-Savart and Ampere's law; vector potential; magnetostatic field in matter; magnetization; linear and nonlinear magnetic media. Prerequisites: PHYS 230 or 281. Pre- or corequisite: MATH 334 or 201 or equivalent",
      "color": "#cf60f4"
    },
    {
      "id": 623,
      "title": "PHYS 415",
      "desc": "Lattice structure and binding; lattice vibrations; electrons in solids, band structure of metals, Fermi surface; semiconductors and junctions; paramagnetism and diamagnetism; introduction to lattice defects. Prerequisites: PHYS 311 and 372, and MATH 337 or ECE 341 or equivalent.",
      "color": "#cf60f4"
    },
    {
      "id": 624,
      "title": "PHYS 420",
      "desc": "Basic principles; computational methods selected from finite-differences, matrix manipulation, variational techniques, discrete transforms, stochastic methods, lattice techniques; as applied to topics selected from nonlinear mechanics, chaotic systems; electrodynamics; wave propagation; statistical physics; quantum mechanics; condensed matter. Prerequisites: PHYS 234, 244, PHYS 381, MATH 337 or ECE 341 or equivalent. Recommended pre- or corequisites: MA PH 343, PHYS 311, PHYS 372, PHYS 472, and PHYS 481. Familiarity with a programming language strongly recommended.",
      "color": "#cf60f4"
    },
    {
      "id": 625,
      "title": "PHYS 458",
      "desc": "Special Relativity: space-time; Lorentz transformations; definitions of scalars, vectors and tensors; motion of a relativistic particle; energymomentum tensor and equations of motion; transformation of electromagnetic fields. General Relativity: geometry of curved space-time; equivalence principle; gravity as curvature; Einstein equations; black hole and cosmological solutions; gravitational waves. Prerequisites: MATH 337 or ECE 341, PHYS 244. Corequisite: PHYS 481.",
      "color": "#cf60f4"
    },
    {
      "id": 627,
      "title": "PHYS 472",
      "desc": "Review of the postulates of quantum mechanics; quantization of angular momentum; matrix representations, spin and parity; approximation methods; perturbation theory; variational and other methods; applications; scattering theory; systems of identical particles. Prerequisites: PHYS 372, and MATH 337 or ECE 341 or equivalent, and MATH 311 or 411.",
      "color": "#cf60f4"
    },
    {
      "id": 628,
      "title": "PHYS 481",
      "desc": "Electromotive force; Faraday's law; inductance; Maxwell's equations in free space and in matter; electromagnetic potentials; gauges; energy and momentum conservation laws; plane waves in vacuum, in nonconducting and in conducting media; reflection and refraction of electromagnetic waves; dispersion, wave guides; dipole radiation; radiation due to moving charge; radiation reaction. Prerequisite: PHYS 381, MATH 337 or ECE 341 or equivalent.",
      "color": "#cf60f4"
    },
    {
      "id": 629,
      "title": "PHYS 485",
      "desc": "Particles and forces; relativistic kinematics; symmetries and conservation laws; bound states, heavy flavours, and the quark model; Dirac equation and the electrodynamics of leptons; electrodynamics of quarks and the parton model; quantum chromodynamics and the strong interactions; weak interactions and electroweak unification. Prerequisites: PHYS 372; MATH 225 or 227, MATH 337 or equivalent. Recommended: PHYS 458 and PHYS 472.",
      "color": "#cf60f4"
    },
    {
      "id": 642,
      "title": "MATH 100",
      "desc": "Review of numbers, inequalities, functions, analytic geometry; limits, continuity; derivatives and applications, Taylor polynomials; log, exp, and inverse trig functions. Integration, fundamental theorem of calculus substitution, trapezoidal and Simpson's rules. Prerequisites: Mathematics 30-1 and Mathematics 31. Notes: (1) Credit can be obtained in at most one of MATH 100, 113, 114, 117, 134, 144, 154, or SCI 100. (2) Students in all sections of this course will write a common final examination. (3) Restricted to Engineering students. Non-Engineering students who take this course will receive *3.0.",
      "color": "#053975"
    },
    {
      "id": 643,
      "title": "MATH 101",
      "desc": "Area between curves, techniques of integration. Applications of integration to planar areas and lengths, volumes and masses. First order ordinary differential equations: separable, linear, direction fields, Euler's method, applications. Infinite series, power series, Taylor expansions with remainder terms. Polar coordinates. Rectangular, spherical and cylindrical coordinates in 3-dimensional space. Parametric curves in the plane and space: graphing, arc length, curvature; normal binormal, tangent plane in 3- dimensional space. Volumes and surface areas of rotation. Prerequisite: MATH 100. Notes: (1) Credit can be obtained in at most one of MATH 101, 115, 118, 136, 146, 156 or SCI 100. (2) Students in all sections of this course will write a common final examination. (3) Restricted to Engineering students. Non-Engineering students who take this course will receive *3.0.",
      "color": "#053975"
    },
    {
      "id": 644,
      "title": "MATH 102",
      "desc": "Vectors and matrices, solution of linear equations, equations of lines and planes, determinants, matrix algebra, orthogonality and applications (Gram-Schmidt), eigenvalues and eigenvectors and applications, complex numbers. Prerequisite or corequisite: MATH 100. Notes: (1) Credit can be obtained in at most one of MATH 102, 125, or 127. (2) Students in all sections of this course will write a common final examination. (3) Restricted to Engineering students. Non-Engineering students who take this course will receive *3.0.",
      "color": "#053975"
    },
    {
      "id": 646,
      "title": "MATH 113",
      "desc": "Review of analytic geometry. Differentiation of elementary, trigonometric, exponential, and logarithmic functions. Applications of the derivative. Integration. Fundamental Theorem of Calculus. Prerequisite: Pure Mathematics 30 or Mathematics 30-1 or equivalent. Note: Credit can be obtained in at most one of MATH 100, 113, 114, 117, 134, 144, or SCI 100.",
      "color": "#053975"
    },
    {
      "id": 648,
      "title": "MATH 115",
      "desc": "Inverse trigonometric functions. Techniques of integration. Improper integrals. Applications of the definite integral. Introduction to differential equations. Prerequisite: One of MATH 100, 113, 114, 117, 134, 144 or 154. Note: Credit can be obtained in at most one of MATH 101, 115, 118, 136, 146, 156 or SCI 100.",
      "color": "#053975"
    },
    {
      "id": 649,
      "title": "MATH 117",
      "desc": "Functions, continuity, and the derivative. Applications of the derivative. Extended limits and L'Hospital's rule. Prerequisites: Mathematics 30-1 and Mathematics 31, or consent of the Department. Notes: (1) This course is designed for students with at least 80 percent in Pure Mathematics 30 or Mathematics 30-1 and Mathematics 31. (2) Credit can be obtained in at most one of MATH 100, 113, 114, 117, 134, 144, 154 or SCI 100. (3) Engineering students will receive a weight of 4.0 units for this course.",
      "color": "#053975"
    },
    {
      "id": 650,
      "title": "MATH 118",
      "desc": "Integration and the Fundamental Theorem. Techniques and applications of integration. Derivatives and integrals of the exponential, and trigonometric functions. Introduction to infinite series. Introduction to partial derivatives. Prerequisite: MATH 117. (Students with a 100-level calculus course different from MATH 117 may be admitted with consent of the Department.) Notes: (1) Credit can be obtained in at most one MATH 101, 115, 118, 136, 146, 156 or SCI 100. (2) Engineering students will receive a weight of 4.0 units for this course.",
      "color": "#053975"
    },
    {
      "id": 651,
      "title": "MATH 125",
      "desc": "Systems of linear equations. Vectors in n-space, vector equations of lines and planes. Matrix algebra, inverses and invertibility. Introduction to linear transformations. Subspaces of n-space. Determinants. Introduction to eigenvalues and eigenvectors. Complex numbers. Dot product, cross product and orthogonality. Applications in a variety of fields. Prerequisite: Mathematics 30-1. Note: Credit can be obtained in at most one of MATH 102, 125 or 127.",
      "color": "#053975"
    },
    {
      "id": 661,
      "title": "MATH 201",
      "desc": "First-order equations; second-order linear equations: reduction of order, variation of parameters; Laplace transform; linear systems; power series; solution by series; separation of variables for PDEs. Prerequisite or corequisite: MATH 209 or 214. Notes: (1) Open only to students in Engineering, Specialization Physics, and Specialization Geophysics. (2) Credit can be obtained in at most one of MATH 201, 334 or 336. (3) Students in all sections of this course will write a common final examination. Non-Engineering students who take this course will receive *3.0.",
      "color": "#053975"
    },
    {
      "id": 664,
      "title": "MATH 209",
      "desc": "Partial differentiation, derivatives of integrals. Multiple integration using rectangular, cylindrical, and spherical coordinates. Vector Field Theory. Prerequisite: MATH 101. Prerequisite or corequisite: MATH 102. Notes: (1) This course may not be taken for credit if credit has already been obtained in MATH 215 or 317. (2) Students in all sections of this course will write a common final examination. (3) Restricted to Engineering students. Non-Engineering students who take this course will receive *3.0.",
      "color": "#053975"
    },
    {
      "id": 665,
      "title": "MATH 214",
      "desc": "Infinite Series. Plane curves and polar coordinates. Three dimensional analytic geometry. Partial derivatives. Prerequisite: One of MATH 101, 115, 136, 146 or 156, and one of MATH 102, 125 or 127. Note: This course may not be taken for credit if credit has already been obtained in MATH 209 or 217.",
      "color": "#053975"
    },
    {
      "id": 666,
      "title": "MATH 215",
      "desc": "First order and second order linear differential equations with constant coefficients. Curves, tangent vectors, arc length, integration in two and three dimensions, polar cylindrical and spherical coordinates, line and surface integrals. Green's divergence and Stokes' theorems. Prerequisite: MATH 214 or 217. Note: This course may not be taken for credit if credit has already been obtained in MATH 209 or 317.",
      "color": "#053975"
    },
    {
      "id": 668,
      "title": "MATH 217",
      "desc": "Axiomatic development of the real number system. Topology of Rn. Sequences, limits and continuity. Multi-variable calculus: differentiation and integration, including integration in spherical and polar coordinates. The differential and the chain rule. Taylor's Formula, maxima and minima. Introduction to vector field theory. Prerequisites: One of MATH 102, 125 or 127, and either MATH 118 or MATH 216. Notes: (1) MATH 216 may be accepted as corequisite with consent of the Department. (2) Engineering students will receive a weight of 4.0 units for this course.",
      "color": "#053975"
    },
    {
      "id": 669,
      "title": "MATH 225",
      "desc": "Vector spaces. Inner product spaces. Examples of n-space and the space of continuous functions. Gram-Schmidt process, QR factorization of a matrix and least squares. Linear transformations, change of basis, similarity and diagonalization. Orthogonal diagonalization, quadratic forms. Applications in a variety of fields. Prerequisites: One of MATH 100, 113, 114, 117, 134, 144, 154 or SCI 100, and one of MATH 102, 125 or 127. Note: Credit can be obtained in at most one of MATH 225 or 227.",
      "color": "#053975"
    },
    {
      "id": 670,
      "title": "MATH 227",
      "desc": "Review of vector space axioms, subspaces and quotients; span; linear independence; Gram-Schmidt process; projections; methods of least squares; linear transformations and their matrix representations with respect to arbitrary bases; change of basis; eigenvectors and eigenvalues; triangularization and diagonalization; canonical forms (Schur, Jordan, spectral theorem). Prerequisite: MATH 127. (Students with MATH 102 or 125 may be admitted with consent of the Department.) Note: Credit can be obtained in at most one of MATH 225 or 227.",
      "color": "#053975"
    },
    {
      "id": 674,
      "title": "MATH 253",
      "desc": "Accumulation and amount functions, effective, nominal, simple, and compound rates, force of interest and discount, simple and general annuities certain, variable annuities and perpetuities, amortization schedules and sinking funds, bonds and other securities, applications, installment loans, depreciation, depletion, capitalized cost. Prerequisite: One of MATH 101, 115, 118, 136, 146, 156 or SCI 100. Corequisite: MATH 209 or 214.",
      "color": "#053975"
    },
    {
      "id": 677,
      "title": "MATH 300",
      "desc": "Derivation of the classical partial differential equations of applied mathematics, solutions using separation of variables. Fourier expansions and their applications to boundary value problems. Introduction to Fourier Transforms. Emphasis on building an appropriate mathematical model from a physical problem, solving the mathematical problem, and carefully interpreting the mathematical results in the context of the original physical problem. Prerequisites: MATH 201 and 209. Notes: (1) Open only to students in Engineering, Specialization Physics, and Specialization Geophysics. (2) Credit can be obtained in at most one of MATH 300 and 337. (3) Course cannot be taken for credit if credit has been obtained in ECE 341.",
      "color": "#053975"
    },
    {
      "id": 678,
      "title": "MATH 300A",
      "desc": "Derivation of the classical partial differential equations of applied mathematics, solutions using separation of variables. Fourier expansions and their applications to boundary value problems. Introduction to Fourier Transforms. Emphasis on building an appropriate mathematical model from a physical problem, solving the mathematical problem, and carefully interpreting the mathematical results in the context of the original physical problem. Prerequisites: MATH 201 and 209. Notes: (1) Open only to students in Engineering, Specialization Physics, and Specialization Geophysics. (2) Credit can be obtained in at most one of MATH 300 and 337. (3) Course cannot be taken for credit if credit has been obtained in ECE 341.",
      "color": "#053975"
    },
    {
      "id": 679,
      "title": "MATH 300B",
      "desc": "Derivation of the classical partial differential equations of applied mathematics, solutions using separation of variables. Fourier expansions and their applications to boundary value problems. Introduction to Fourier Transforms. Emphasis on building an appropriate mathematical model from a physical problem, solving the mathematical problem, and carefully interpreting the mathematical results in the context of the original physical problem. Prerequisites: MATH 201 and 209. Notes: (1) Open only to students in Engineering, Specialization Physics, and Specialization Geophysics. (2) Credit can be obtained in at most one of MATH 300 and 337. (3) Course cannot be taken for credit if credit has been obtained in ECE 341.",
      "color": "#053975"
    },
    {
      "id": 683,
      "title": "MATH 311",
      "desc": "Complex numbers. Complex series. Functions of a complex variable. Cauchy's theorem and contour integration. Residue Theorem and its applications. Prerequisite or corequisite: A Calculus IV course.",
      "color": "#053975"
    },
    {
      "id": 686,
      "title": "MATH 322",
      "desc": "Graphs, paths and cycles, trees, planarity and duality, coloring problems, digraphs, matching problems, matroid theory. Prerequisite: One of MATH 102, 125 or 127, and any 200-level MATH course. (MATH 216 or MATH 228 recommended.)",
      "color": "#053975"
    },
    {
      "id": 687,
      "title": "MATH 324",
      "desc": "Divisibility, prime numbers, congruences, quadratic residues, quadratic reciprocity, arithmetic functions and diophantine equations; sums of squares. Prerequisites: MATH 227 or 228.",
      "color": "#053975"
    },
    {
      "id": 689,
      "title": "MATH 326",
      "desc": "Rings, fields, polynomials, algebras. Homomorphisms, ideals, quotients. Ring extensions, field extensions, construction of finite fields. Integral domains: Euclidean, principal ideal, unique factorization. Chain conditions. Introduction to modules. Modules over a principal ideal domain, finitely generated abelian groups, matrix canonical forms. Prerequisite MATH 227, or both MATH 225 and 228.",
      "color": "#053975"
    },
    {
      "id": 690,
      "title": "MATH 328",
      "desc": "Groups, subgroups, homomorphisms. Symmetry groups. Matrix groups. Permutations, symmetric group, Cayley's Theorem. Group actions. Cosets and Lagrange's Theorem. Normal subgroups, quotient groups, isomorphism theorems. Direct and semidirect products. Finite Abelian groups. Prerequisite: MATH 227 or 228. This course may not be taken for credit if credit has already been obtained in MATH 229.",
      "color": "#053975"
    },
    {
      "id": 691,
      "title": "MATH 334",
      "desc": "First order equations, linear equations of higher order. Power series solution. Laplace transform methods. Introduction to special functions. Introduction to linear systems. Prerequisites: One of MATH 102, 125 or 127, and one of MATH 209, 214 or 217. Note: Credit can be obtained in at most one of MATH 201, 334 or 336.",
      "color": "#053975"
    },
    {
      "id": 692,
      "title": "MATH 336",
      "desc": "First order differential equations. Linear systems of differential equations and linear differential equations of higher order. Stability and qualitative theory of 2-dimensional linear and non-linear systems. Laplace transform methods. Existences and uniqueness theorems. Prerequisites: MATH 225 or 227, and either MATH 209, 217, 314 or both 214 and 216. Note: Credit can be obtained in at most one of MATH 201, 334 and 336.",
      "color": "#053975"
    },
    {
      "id": 693,
      "title": "MATH 337",
      "desc": "Boundary value problems of classical Math Physics, orthogonal expansions, classical special functions. Advanced transform techniques. Prerequisites: One of MATH 209, 215, or 217, and one of MATH 201, 334 or 336. Notes: (1) Credit can be obtained in at most one of MATH 300 or 337. (2) Course cannot be taken for credit if credit has been obtained in ECE 341.",
      "color": "#053975"
    },
    {
      "id": 697,
      "title": "MATH 348",
      "desc": "Frenet-Seret theory of curves in the plane and in 3-space, examples; local theory of surfaces in 3-space: first and second fundamental forms, Gauss map and Gauss curvature, geodesics and parallel transport, theorema egregium, mean curvature and minimal surfaces. Prerequisites: One of MATH 102, 125 or 127 and one of MATH 209, 215 or 217.",
      "color": "#053975"
    },
    {
      "id": 700,
      "title": "MATH 371",
      "desc": "Model development, computation, and analysis for problems in the life sciences. Models include differential equations, difference equations and stochastic formulations. Model evaluation and prediction. Applications are chosen from epidemiology, ecology, population biology, physiology and medicine. Prerequisites: One of MATH 102, 125 or 127, and one of MATH 209, 214 or 217. Note: No previous computing experience is needed.",
      "color": "#053975"
    },
    {
      "id": 701,
      "title": "MATH 372",
      "desc": "This course is designed to develop the students' problem-solving abilities along heuristic lines and to illustrate the processes of Applied Mathematics. Students will be encouraged to recognize and formulate problems in mathematical terms, solve the resulting mathematical problems and interpret the solution in real world terms. Typical problems considered include nonlinear programming, optimization problems, diffusion models. Prerequisites: One of MATH 102, 125 or 127, and one of MATH 209, 214 or 217.",
      "color": "#053975"
    },
    {
      "id": 702,
      "title": "MATH 373",
      "desc": "Introduction to optimization. Problem formulation. Linear programming. The simplex method and its variants (revised Simplex method, dual simplex method). Extreme points of polyhedral sets. Theory of linear inequalities (Farkas Lemma). Complementary slackness and duality. Post-optimality analysis. Interior point methods. Applications (elementary games, transportation problems, networks, etc.). Prerequisites: One of MATH 102, 125 or 127, and one of MATH 209, 214 or 217.",
      "color": "#053975"
    },
    {
      "id": 703,
      "title": "MATH 381",
      "desc": "Approximation of functions by Taylor series, Newton's formulae, Lagrange and Hermite interpolation. Splines. Orthogonal polynomials and least-squares approximation of functions. Direct and iterative methods for solving linear systems. Methods for solving non-linear equations and systems of non-linear equations. Introduction to computer programming. Prerequisites: One of MATH 102, 125 or 127, and one of MATH 209, 214 or 217. Notes: (1) Credit can be obtained in at most one of MATH 280, 381 or CMPUT 340. (2) Extra classes may be held for students lacking a background in one of the major programming languages such as Fortran, C, C++ or Matlab.",
      "color": "#053975"
    },
    {
      "id": 711,
      "title": "MATH 421",
      "desc": "Permutations and combinations, Binomial Theorem, Principle of Inclusion-Exclusion, recurrence relations, generating functions, orthogonal Latin squares, balanced incomplete block designs, Steiner triple systems, perfect difference sets, Boolean algebra and Finite State Machines. Prerequisites: Either  MATH 326 or one of MATH 111 or 228 and a 300-level MATH course (MATH 322 recommended).",
      "color": "#053975"
    },
    {
      "id": 712,
      "title": "MATH 422",
      "desc": "Elements of group theory, cosets, Lagrange's theorem, binary group codes, polynomials, finite field theory, error correcting codes. Prerequisites: either (1) MATH 227 or (2) MATH 228 and a 300-level MATH course.",
      "color": "#053975"
    },
    {
      "id": 713,
      "title": "MATH 424",
      "desc": "Field extensions. Groups of automorphisms of fields. Galois theory. Finite fields and applications. Solvable groups, the insolvability of the quintic equation. Ruler and compass construction. Prerequisites: MATH 326 (or MATH 228 by consent of the Department) and MATH 328. Note: This course cannot be taken for credit if credit has already been obtained in MATH 427 or 329.",
      "color": "#053975"
    },
    {
      "id": 717,
      "title": "MATH 436",
      "desc": "Partial differential equations as physical models. Introduction to basic generalized functions. Theory of linear and quasi-linear first-order equations: general solution, initial value problem, generalized solutions and propagation of singularities, characteristic surfaces, shock formation. Theory of fully nonlinear first order equations: complete solution and the initial value problem. Hamilton-Jacobi equation and its applications. Second order linear equations in n dimensions: classification, canonical form, characteristic surfaces and shock formation, initial and boundary value problem. Prerequisite: MATH 337.",
      "color": "#053975"
    },
    {
      "id": 719,
      "title": "MATH 447",
      "desc": "General point-set topology. Compactness, Tychonoff's tbeorem, connectedness. Metric spaces, completeness, Baire's theorem. Urysohn's lemma. Topological manifolds. Homotopy theory, fundamental group, covering spaces. Prerequisite : MATH 216 or 217. Corequisites: MATH 328 or MA PH 464. Offered in alternate years. It may be offered in intervening years if demand is sufficient.",
      "color": "#053975"
    },
    {
      "id": 724,
      "title": "MATH 505",
      "desc": "Discrete-time stochastic analysis: Stochastic basis, filtration, stochastic sequences. Absolute continuity of probability measures and conditional expectations. Martingale-like and predictable stochastic sequences. Doob's decomposition. Stopping times and related properties. Uniformly integrable stochastic sequences. Transition from discrete-time to continuous-time stochastic analysis. Introduction to stochastic integration with respect to Brownian motion. Prerequisites: STAT 471 or consent of the Department.",
      "color": "#053975"
    },
    {
      "id": 728,
      "title": "MATH 510",
      "desc": "Continuous semimartingales and quadratic variation. Stochastic integrals for continuous semimartingales. Ito's formula. Change of probability measure (Girsanov transformation). Martingale representation theorem for Brownian filtrations. Stochastic differential equations, diffusions. Introduction to discontinuous semimartingales with emphasis on Poisson processes. Prerequisites: MATH 505 or consent of the Department.",
      "color": "#053975"
    },
    {
      "id": 735,
      "title": "MATH 520",
      "desc": "Financial markets in continuous-time: Arbitrage, completeness, self-financing strategies. Black Scholes model. Option pricing and hedging: European, American and exotic options. Consumption-investment problem: Utility maximization, optimal portfolio and optimal consumption. Prerequisite: MATH 515. Corequisite: MATH 510 or consent of the Department.",
      "color": "#053975"
    },
    {
      "id": 737,
      "title": "MATH 524",
      "desc": "Existence theorems, uniqueness theorems; linear systems (basic theory); stability (basic theory); nonlinear systems (local theory); nonlinear systems (global theory); bifurcations. Prerequisite: MATH 334 or 336, or equivalent.",
      "color": "#053975"
    },
    {
      "id": 740,
      "title": "MATH 530",
      "desc": "Particular background from point set topology (pasting and quotienting constructions); homotopy relation between maps and spaces; fundamental group; Seifert VanKampen theorem; covering spaces. Additional topics at the discretion of the instructor. Prerequisites: MATH 227, 317 and 447 or consent of Department.",
      "color": "#053975"
    },
    {
      "id": 742,
      "title": "MATH 536",
      "desc": "Finite difference and finite element methods for boundary-value problems of elliptic equations. Numerical algorithms for large systems of linear algebraic equations: direct, classical relaxation, multigrid and preconditioned conjugate gradient methods. Algorithms for vector/parallel computers and the domain decomposition method. Prerequisites: MATH 337, 436 or equivalent and some computer programming.",
      "color": "#053975"
    },
    {
      "id": 747,
      "title": "MATH 556",
      "desc": "Fundamentals including continuum hypothesis surface tension, classical thermodynamics, and transport phenomena. Introduction to Cartesian tensors. Kinematics of flow including Lagrangian and Eulerian descriptions, streamline, path line, streak line, vorticity and circulation. Derivation of the conservation laws for mass, momentum, and energy and a detailed description of the Boussinesq approximation. Conservation laws in a rotating frame. Vortex lines and tubes, role of viscosity in vortices, Kelvin's circulation theorem, the vorticity equation in nonrotating and rotating frames. Irrotational flow including its relevance, velocity potential, sources and sinks, and flow past various shapes. Gravity waves in deep and shallow water with and without surface tension in both the linear and nonlinear contexts. Dynamic similarity and Buckingham's Pi Theorem. Prerequisites: One of MATH 311, 411 and MATH 436 or consent of Instructor.",
      "color": "#053975"
    },
    {
      "id": 748,
      "title": "MATH 570",
      "desc": "Mathematical modeling in the biological and medical sciences. Students will learn how to apply mathematical methods and theory to a variety of different biological problems. Topics will be taken from: (i) continuous and discrete dynamical systems describing interacting and structured populations, resource management, biological control, reaction kinetics, biological oscillators and switches, the dynamics of infectious diseases and genetics and (ii) models of spatial processes in biology including random walks, pattern formation in morphogenesis and ecology, applications of traveling waves to population dynamics, epidemiology, chemical reactions, and models for neural patterns. Prerequisites: MATH 524 and a 400 or 500 level course on Partial Differential Equations or consent of Instructor.",
      "color": "#053975"
    },
    {
      "id": 754,
      "title": "MATH 625",
      "desc": "Topics among: Incomplete markets; Models with imperfection (markets with transaction costs, constraints or defaults); Risk measures; Interplay between finance and insurance; Mathematical models for the term structure of interest rates. Prerequisites: MATH 520 or consent of the Department.",
      "color": "#053975"
    },
    {
      "id": 759,
      "title": "STAT 141",
      "desc": "Random variables and frequency distributions. Averages and variance. The binomial and normal distribution. Sampling distributions and elementary inference. X2-test for contingency tables. Regression and correlation. Analysis of variance. Prerequisite: Mathematics 30-1 or 30-2, or consent of Department. This course may not be taken for credit if credit has been obtained in any STAT course, or in PEDS 109, PSYCO 211 or SOC 210.",
      "color": "#084444"
    },
    {
      "id": 760,
      "title": "STAT 151",
      "desc": "Data collection and presentation, descriptive statistics. Probability distributions, sampling distributions and the central limit theorem. Point estimation and hypothesis testing. Correlation and regression analysis. Goodness of fit and contingency table. Prerequisite: Mathematics 30-1 or 30-2. Note : This course may not be taken for credit if credit has been obtained in any STAT course, or in KIN 109, PEDS 109, PSYCO 211, SCI 151 or SOC 210.",
      "color": "#084444"
    },
    {
      "id": 765,
      "title": "STAT 252",
      "desc": "Methods in applied statistics including regression techniques, analysis of variance and covariance, and methods of data analysis. Applications are taken from Biological, Physical and Social Sciences, and Business. Prerequisite: One of STAT 141, 151, 161, 235 or SCI 151. Notes: (1) Credit can be obtained in at most one of STAT 252, 319, 337 or 341, or AREC 313. (2) This course may not be taken for credit if credit has already been obtained in STAT 368 or 378.",
      "color": "#084444"
    },
    {
      "id": 766,
      "title": "STAT 265",
      "desc": "Sample space, events, combinatorial probability, conditional probability, independent events, Bayes Theorem, random variables, discrete random variables, expected values, moment generating function, inequalities, continuous distributions, multivariate distributions, independence. Corequisite: One of MATH 209, 214 or 217.",
      "color": "#084444"
    },
    {
      "id": 767,
      "title": "STAT 266",
      "desc": "Functions of random variables, sampling distributions, Central Limit Theorem, law of large numbers, statistical models for the data, likelihood, parameters and their interpretation, objectives of statistical inference, point and interval estimation, method of moments, basic notions of testing of hypotheses, errors of the first and second kind, significance level, power, pvalue. Prerequisite: STAT 265. Corequisites: One of MATH 225 or 227, and one of MATH 215 or 317.",
      "color": "#084444"
    },
    {
      "id": 768,
      "title": "STAT 312",
      "desc": "Reviews and extends those topics in the prerequisite courses in calculus and linear algebra which are of particular interest in Mathematical Statistics. These include the basics of mathematical reasoning as evidenced by the presentation of rigorous arguments, notions of continuity, differentiation, Riemann-Stieltjes integration and numerical optimization, and diagonalization results for real symmetric matrices. Applications to statistical theory will include least squares estimation, generating functions, and distribution theory. Prerequisites: MATH 215, 225 and STAT 266.",
      "color": "#084444"
    },
    {
      "id": 771,
      "title": "STAT 353",
      "desc": "Time at death random variables, continuous and discrete insurances, endowments and varying annuities, net premiums and reserves. Prerequisites: MATH 253 and STAT 265. Corequisite: MATH 215 or 317.",
      "color": "#084444"
    },
    {
      "id": 772,
      "title": "STAT 361",
      "desc": "Simple random sampling from finite populations, stratified sampling, regression estimators, cluster sampling. Prerequisite: STAT 266, or STAT 235 with consent of the Department. Note: This course may only be offered in alternate years.",
      "color": "#084444"
    },
    {
      "id": 775,
      "title": "STAT 372",
      "desc": "Laws of large numbers, weak convergence, some asymptotic results, delta method, maximum likelihood estimation, testing, UMP tests, LR tests, nonparametric methods (sign test, rank test), robustness, statistics and their sensitivity properties, prior and posterior distributions, Bayesian inference, conjugate priors, Bayes estimators. Prerequisite: STAT 266.",
      "color": "#084444"
    },
    {
      "id": 776,
      "title": "STAT 378",
      "desc": "Simple linear regression analysis, inference on regression parameters, residual analysis, prediction intervals, weighted least squares. Multiple regression analysis, inference about regression parameters, multicollinearity and its effects, indicator variables, selection of independent variables. Non-linear regression. Prerequisite: STAT 266, or STAT 235 with consent of the Department.",
      "color": "#084444"
    },
    {
      "id": 777,
      "title": "STAT 413",
      "desc": "Survey of contemporary languages/environments suitable for algorithms of Statistics and Data Science. Introduction to Monte Carlo methods, random number generation and numerical integration in statistical context and optimization for both smooth and constrained alternatives, tailored to specific applications in statistics and machine learning. Prerequisites: STAT 265 or consent of the instructor.",
      "color": "#084444"
    },
    {
      "id": 778,
      "title": "STAT 432",
      "desc": "Survival models, model estimation from complete and incomplete data samples, parametric survival models with concomitant variables, estimation of life tables from general population data. Prerequisites: STAT 372 and 378.",
      "color": "#084444"
    },
    {
      "id": 782,
      "title": "STAT 471",
      "desc": "Probability spaces, algebra of events. Elements of combinatorial analysis. Conditional probability, stochastic independence. Special discrete and continuous distributions. Random variables, moments, transformations. Basic limit theorems. Prerequisite: STAT 371.",
      "color": "#084444"
    },
    {
      "id": 783,
      "title": "STAT 479",
      "desc": "Stationary series, spectral analysis, models in time series: autoregressive, moving average, ARMA and ARIMA. Smoothing series, computational techniques and computer packages for time series. Prerequisites: STAT 372 and 378. Note: This course may only be offered in alternate years.",
      "color": "#084444"
    },
    {
      "id": 786,
      "title": "STAT 501",
      "desc": "Basic principles of experimental design, completely randomized design-one way ANOVA and ANCOVA. Randomized block design. Latin square design, Multiple comparisons. Nested designs. Factorial experiments. Each student will give a written report and seminar presentation highlighting statistical methods used in a research project. Prerequisites: STAT 252 or 337 or equivalent and a course in linear algebra. Note: Cannot be used for credit towards a graduate program in Statistics.",
      "color": "#084444"
    },
    {
      "id": 790,
      "title": "STAT 505",
      "desc": "Principles of statistical model building and analysis applied in linear and generalized linear models and illustrated through multivariate methods such as repeated measures, principal components, and supervised and unsupervised classification. Each student will give a written report and seminar presentation highlighting statistical methods used in a research project. Prerequisites: STAT 501, 502 or equivalent. Note: Cannot be used for credit towards a thesis-based graduate program in Statistics.",
      "color": "#084444"
    },
    {
      "id": 791,
      "title": "STAT 512",
      "desc": "Introduction to mathematical techniques commonly used in theoretical Statistics, with applications. Applications of diagonalization results for real symmetric matrices, and of continuity, differentiation, Riemann-Stieltjes integration and multivariable calculus to the theory of Statistics including least squares estimation, generating functions, distribution theory. Prerequisite: consent of Department.",
      "color": "#084444"
    },
    {
      "id": 797,
      "title": "STAT 561",
      "desc": "Review of basic sampling schemes: simple random sampling, and stratified random sampling, and systematic sampling. Multistage sampling schemes. Estimation of nonlinear parameters: ratios, regression coefficients, and correlation coefficients. Variance estimation techniques: linearization, BRR, jackknife, and bootstrap. Selected topics: model-based estimation, regression analysis from complex survey data. Relevant computer packages. Prerequisites: STAT 361, 372, 471.",
      "color": "#084444"
    },
    {
      "id": 799,
      "title": "STAT 566",
      "desc": "An introduction to the theory of statistical inference. Topics to include exponential families and general linear models, likelihood, sufficiency, ancillarity, interval and point estimation, asymptotic approximations. Optional topics as time allows, may include Bayesian methods, Robustness, resampling techniques. This course is intended primarily for MSc students. Prerequisite: STAT 471 or consent of Department.",
      "color": "#084444"
    },
    {
      "id": 801,
      "title": "STAT 571",
      "desc": "Measure and integration, Laws of Large Numbers, convergence of probability measures. Conditional expectation as time permits. Prerequisites: STAT 471 and STAT 512 or their equivalents.",
      "color": "#084444"
    },
    {
      "id": 803,
      "title": "STAT 578",
      "desc": "Multiple linear regression, ordinary and generalized least squares, partial and multiple correlation. Regression diagnostics, collinearity, model building. Nonlinear regression. Selected topics: robust and nonparametric regression, measurement error models. Prerequisites: STAT 378 and a 400-level statistics course.",
      "color": "#084444"
    },
    {
      "id": 808,
      "title": "STAT 664",
      "desc": "Modern methods of statistical inference. Various versions of likelihood:  conditional, marginal, integrated, profile, partial, empirical. Estimating equations. Semi-parametric models. Foundational issues. Prerequisites: STAT 512 and 566.",
      "color": "#084444"
    },
    {
      "id": 809,
      "title": "STAT 665",
      "desc": "Approximation techniques and asymptotic methods in statistics. Topics may include second and higher order expansions, asymptotics of likelihood based estimation and testing. Edgeworth expansions, exponential tilting, asymptotic relative efficiency, U-, M-, L-, and R-estimation. Prerequisites:  STAT 566 or 664 and 512 or the equivalent.",
      "color": "#084444"
    },
    {
      "id": 814,
      "title": "BIOL 107",
      "desc": "An introduction to cell structure and function. Major topics include the molecules and structures that comprise prokaryotic and eukaryotic cells, the mechanisms by which energy is harvested and used by cells, how cells reproduce, and how information is stored and used within a cell via the processes of DNA replication, transcription, and translation. Prerequisites: Biology 30 and Chemistry 30. Note: BIOL 107 is not a prerequisite for BIOL 108. BIOL 107 and 108 can be taken in either term.",
      "color": "#c6819b"
    },
    {
      "id": 815,
      "title": "BIOL 108",
      "desc": "Examines the major lineages of life on Earth. Overview of evolutionary principles and classification, the history of life, and the key adaptations of prokaryotes, protists, fungi, plants, and animals. Laboratories survey the diversity of biological form and function, and introduce students to data collection and scientific writing. Prerequisite: Biology 30. Note: BIOL 107 is not a prerequisite for BIOL 108. BIOL 107 and 108 can be taken in either term.",
      "color": "#c6819b"
    },
    {
      "id": 816,
      "title": "BIOL 201",
      "desc": "A structural and functional dissection of a eukaryotic cell. Detection of specific molecules at the ultrastructural level; plasma membrane structure and function; cytoskeleton involvement in intracellular transport, mitosis, and cytokinesis; the endomembrane system, protein targeting, exocytosis and endocytosis; nuclear structure and function; cell cycle control and cancer. Prerequisite: BIOL 107 and a 100-level Chemistry course, or SCI 100. Note: Not to be taken by students with credit in CELL 201, in addition, not available to students currently enrolled in CELL 201.",
      "color": "#c6819b"
    },
    {
      "id": 817,
      "title": "BIOL 207",
      "desc": "The chromosomal and molecular basis for the transmission and function of genes. The construction of genetic and physical maps of genes and genomes. Strategies for the isolation of specific genes. Examples of regulatory mechanisms for the expression of the genetic material in both prokaryotes and eukaryotes. Prerequisite: BIOL 107 or SCI 100.",
      "color": "#c6819b"
    },
    {
      "id": 818,
      "title": "BIOL 208",
      "desc": "Ecology is the scientific study of interactions between organisms and their environment in a hierarchy of levels of organization: individuals, populations, communities, and ecosystems. Provides a comprehensive survey of general concepts that can stand alone or serve as preparation for advanced courses in ecology. Labs emphasize collection, analysis, and interpretation of data from ecological experiments and field studies to illustrate and complement lecture material. Examples are drawn from a broad range of organisms and systems. Prerequisite: BIOL 108 or SCI 100. Open to students in the BSc Forestry and BSc Forest Business Management program once they have completed REN R 120 and REN R 205.",
      "color": "#c6819b"
    },
    {
      "id": 819,
      "title": "BIOL 221",
      "desc": "Discusses the major features of the evolutionary process, including the fossil record, basic population genetics, variation, natural selection, adaptation, and speciation. Prerequisites: BIOL 107 and 108, or SCI 100. Credit cannot be obtained for both BIOL 221 and 321.",
      "color": "#c6819b"
    },
    {
      "id": 822,
      "title": "BIOL 310",
      "desc": "Biological aging is a complex process that involves the progressive deterioration of an organism over time. This course covers the aging process at the molecular, tissue and organismal levels. Topics for discussion include assessment of animal models of aging, mechanisms of aging, healthy aging, age-associated disease and interventions. Prerequisites: BIOL 201 or ZOOL 241 or 242 or consent of instructor. Credit cannot be obtained for both BIOL 310 and 510.",
      "color": "#c6819b"
    },
    {
      "id": 824,
      "title": "BIOL 322",
      "desc": "The diversity of microscopic life forms, both prokaryotic (bacteria and archaea) and eukaryotic (protists, fungi, phytoplankton), will be explored. The evolutionary forces responsible for this diversity will be described in detail and contrasted to those at work in macroscopic eukaryotes. Students will learn about the molecular methods used to identify and classify both culturable and non-culturable microbes, and genetically characterize entire populations. Prerequisites: BIOL 107 and 108 or SCI 100, and a 200-level Biological Sciences course. MICRB 265 recommended.",
      "color": "#c6819b"
    },
    {
      "id": 825,
      "title": "BIOL 330",
      "desc": "Expands on prior introductions to the scientific method and examines the steps involved in the planning, collection, organization, analysis and presentation of biological data. Classes will explore the types of data used to answer a variety of biological questions and will review several different sampling designs, assess the benefits and limitations of various data types for scientific inference, and integrate the statistical methods that are common to other introductory courses.  Labs will teach students how spreadsheets and relational databases can be used to manipulate, analyze, and present the results of scientific research. Prerequisites: BIOL 208 and STAT 151 or SCI 151.",
      "color": "#c6819b"
    },
    {
      "id": 826,
      "title": "BIOL 331",
      "desc": "Principles of population ecology as they apply to plants and animals; population consequences of variation among individuals; habitat structure and population structure; habitat selection and foraging theory; life tables, demography, and the evolution of life history patterns; population dynamics; interactions among organisms (predation, competition, mutualism); and population regulation. Prerequisites: BIOL 208; any one of MATH 113, 114, 115, 120, 125 or SCI 100; STAT 151 or SCI 151.",
      "color": "#c6819b"
    },
    {
      "id": 827,
      "title": "BIOL 332",
      "desc": "Principles of community ecology, applied to plants and animals. The nature of communities, functional groups and rarity; niche theory and competition; disturbance and other alternatives to competition; food webs (predation, herbivory and disease); diversity (determinants, functional consequences and gradients); island communities. Prerequisites: BIOL 208; STAT 151 or SCI 151; and any one of MATH 113, 114, 115, 120, 125 or SCI 100. May not be taken for credit if credit already obtained in ZOOL 332.",
      "color": "#c6819b"
    },
    {
      "id": 830,
      "title": "BIOL 340",
      "desc": "An introduction to biogeochemical cycles in the environment. Discusses processes and reactions governing cycles in the atmosphere, lithosphere, terrestrial ecosystems, freshwater wetlands and lakes, river estuaries, and the oceans. Outlines the global cycles of water, carbon, nitrogen, phosphorus, and sulfur. Group discussions will incorporate current topics in anthropogenic alterations of natural cycles that lead to ecosystem degradation. Prerequisites: CHEM 101 or SCI 100 and BIOL 208; MICRB 265 strongly recommended.",
      "color": "#c6819b"
    },
    {
      "id": 831,
      "title": "BIOL 341",
      "desc": "An overview of the adverse effects of chemicals or physical agents on biological systems in an ecological context. This course takes a multidisciplinary approach to understanding biological effects and their assessment. Prerequisites: BIOL 208, ZOOL 241, or PHYSL 210, or 212 or 214 and CHEM 164 or 261, or instructor consent.",
      "color": "#c6819b"
    },
    {
      "id": 837,
      "title": "BIOL 367",
      "desc": "This course introduces the principles of conservation biology with an emphasis on ecological processes operating at population, community and ecosystem levels of organization. Threats to biological diversity, ranging from species introductions to habitat destruction will be discussed along with conservation solutions ranging from the design of protected areas through conservation legislation. Prerequisite: BIOL 208. Credit cannot be obtained in both BIOL 367 and REN R 364.",
      "color": "#c6819b"
    },
    {
      "id": 840,
      "title": "BIOL 384",
      "desc": "Ecological impacts of climate change and large-scale human activities on terrestrial and aquatic ecosystems. The focus of this course is to learn to write brief technical summaries of current environment issues, in a fashion that can be understood by an educated citizen. Topics such as climate change, water management projects, invasion of exotic species and national parks management are presented as the forum to evaluate options, trade-offs and solutions to environmental social issues. Prerequisites: BIOL 208 or consent of Instructor. BOT 205 recommended.",
      "color": "#c6819b"
    },
    {
      "id": 841,
      "title": "BIOL 391",
      "desc": "A laboratory course introducing students to techniques in gene manipulation, protein expression and bioinformatics by following a gene through a thematic series of molecular manipulations. Restricted to Honors and Specialization students in Biological Sciences and consent of instructor. Prerequisites: BIOL 207 and BIOCH 200. Not to be taken by students currently enrolled in GENET 420 or with credit in GENET 420. Credit can be obtained for only one of BIOL 391, IMIN 391 or MMI 391.",
      "color": "#c6819b"
    },
    {
      "id": 847,
      "title": "BIOL 409",
      "desc": "This course will examine the biology of zoonotic agents and the implication of host-pathogen interactions to disease susceptibility and resistance. Students will apply these basic concepts towards the understanding of issues governing pathogenesis, pathology, epidemiology, control and surveillance of zoonotic diseases. Focus will be placed on zoonotic agents currently having a significant impact on animal and public health. Lectures will be followed by active discussion of selected readings. Prerequisites: one of IMIN 200, ZOOL 352, ZOOL 354, ENT 392 or consent of instructor. Credit cannot be obtained for both BIOL 409 and BIOL 509.",
      "color": "#c6819b"
    },
    {
      "id": 849,
      "title": "BIOL 430",
      "desc": "Emphasis is on the design of experiments and analysis of data collected from field and laboratory studies in Biology. Prerequisites: STAT 141 or 151 or SCI 151 and a 300-level Biological Sciences course. Credit cannot be obtained for BIOL 430, 530 and REN R 480.",
      "color": "#c6819b"
    },
    {
      "id": 850,
      "title": "BIOL 432",
      "desc": "Design, execution, analysis, and presentation of problems in behavioral, population, and community ecology in a field environment. Field exercises, demonstration of techniques, and data collection for independent projects will take place during the two weeks preceding the Fall term at a field station off the main campus. Final reports are due in the last week of September. Prerequisites: BIOL 331 or 332 or ZOOL 371 or BOT 332; a statistics course such as STAT 151 or SCI 151, BIOL 330 or 430. This course requires payment of additional miscellaneous fees. Refer to the Tuition and Fees page in the University Regulations section of the Calendar.",
      "color": "#c6819b"
    },
    {
      "id": 855,
      "title": "BIOL 468",
      "desc": "Seminar and reading course dealing with current problems in conservation biology. Prerequisites: BIOL 367 or REN R 364 and consent of instructor.",
      "color": "#c6819b"
    },
    {
      "id": 856,
      "title": "BIOL 471",
      "desc": "Landscapes are holistic entities whose patterns influence ecological processes. Topics highlighted in this course include landscape components, morphology and dynamics; detecting spatial/temporal change in landscapes; issues of scales; movements of organisms, disturbances, and nutrients across landscape mosaics; and restoration, planning and management in a landscape context. Labs emphasize GIS applications to characterizing landscape patterns and heterogeneity in space and time, distributing and moving organisms across landscapes, and restoring or planning landscapes for conservation objectives. Prerequisites: MATH 115 or SCI 100; STAT 151 or SCI 151; one of BIOL 331, 332 or BOT 332. Previous GIS course is useful. Credit cannot be obtained for both BIOL 471 and 571.",
      "color": "#c6819b"
    },
    {
      "id": 889,
      "title": "GENET 270",
      "desc": "Basic concepts on the organization of genetic material and its expression will be developed from experiments on bacteria and viruses. Prerequisite: BIOL 207.",
      "color": "#835845"
    },
    {
      "id": 891,
      "title": "GENET 302",
      "desc": "Analysis of how the nuclear chromosomes in multicellular eukaryotes are organized, inherited, studied, and manipulated. Topics typically include classical and current techniques, mouse genetics, epigenetics, sex chromosomes, dosage compensation, genomic imprinting, transposable elements, centromeres, telomeres, and stem cells. Prerequisite GENET 270.",
      "color": "#835845"
    },
    {
      "id": 895,
      "title": "GENET 375",
      "desc": "A laboratory course in which students will be introduced to modern techniques in molecular genetics. These may include cytogenetics, recombinant DNA techniques, PCR, DNA sequencing, methods of detecting gene expression, and genome analysis. Prerequisites: GENET 270, MICRB 265, and a 300-level GENET course. Enrolment is limited, and registration is by consent of instructor.",
      "color": "#835845"
    },
    {
      "id": 896,
      "title": "GENET 390",
      "desc": "Examination of fundamental techniques employed in molecular biological research relevant to both prokaryotic and eukaryotic systems. Topics will provide the theoretical basis appropriate for molecular research in a diverse range of fields including genetics, microbiology, cell biology, biotechnology, evolution and population biology. Prerequisite: BIOL 207; BIOCH 200 or 205 or BIOCH 220; GENET 270 recommended.",
      "color": "#835845"
    },
    {
      "id": 899,
      "title": "GENET 415",
      "desc": "The goal of the course is to build knowledge about conserved, fundamental cellular processes uncovered using genetic approaches to study bacteria and to develop an appreciation for the application of this information to the development of technology and the understanding of human diseases. Prerequisites: Two GENET 300 level courses or MICRB 316 and one GENET 300 level course; this course is normally recommended for fourth-year students. Credit cannot be obtained for both GENET 415 and 515.",
      "color": "#835845"
    },
    {
      "id": 900,
      "title": "GENET 418",
      "desc": "A survey of human genetic variation and mutation in a molecular genetics context. Molecular basis of diseases and applications to genetic counseling and screening, chromosomal abnormalities, genomic imprinting, cancer genetics, gene mapping, population genetics, multifactorial inheritance, gene therapy, and ethical issues. Prerequisites: any two GENET 300-level lecture courses, GENET 302 is recommended. Credit cannot be obtained for both GENET 418 and 518.",
      "color": "#835845"
    },
    {
      "id": 901,
      "title": "GENET 420",
      "desc": "A laboratory course teaching modern techniques in molecular biology with emphasis on the analysis of gene expression in animal systems. Prerequisites: GENET 390 and any other GENET 300-level lecture course. GENET 375 recommended. Enrolment is limited and registration is by consent of instructor. Designed for senior undergraduate and graduate students in programs with molecular biological orientation. May not be taken concurrently with BIOL 391.",
      "color": "#835845"
    },
    {
      "id": 910,
      "title": "IMIN 200",
      "desc": "Introduces the principles and mechanisms of immunity in eukaryotes. Provides an overview of the major groups of infectious agents (virus, bacteria, parasites) and examines selected microorganisms within the context of the host response to pathogens and pathogen evasion strategies. Pre- or corequisites: BIOCH 200 and MICRB 265. May not be taken for credit if credit already obtained in BIOCH 450. (Offered jointly by the Departments of Biological Sciences and Medical Microbiology and Immunology). [Biological Sciences].",
      "color": "#75dc4d"
    },
    {
      "id": 911,
      "title": "IMIN 324",
      "desc": "An introduction to the structure, replication, and taxonomy of bacteriophages, plant, insect, and animal viruses. Their role in disease and methods of control and detection is also discussed. Prerequisites: BIOL 207, IMIN 200 and BIOCH 200 or 205. May not be taken for credit if credit already obtained in INT D 224. (Offered jointly by the Departments of Biological Sciences and of Medical Microbiology and Immunology.) [Biological Sciences]",
      "color": "#75dc4d"
    },
    {
      "id": 912,
      "title": "IMIN 371",
      "desc": "Survey course introducing the student to immunological concepts. Topics include the clonal selection theory, antibody structure and specificity, genetic basis of immune diversity, antibody-antigen reactions, cell interactions in immune responses, the molecular basis of non-self recognition, MHC molecules and transplantation, tolerance, effector mechanism of immunity, hypersensitivity and immunodeficiency. Prerequisites: BIOCH 200 or 205, BIOL 207, and IMIN 200. May not be taken for credit if credit already obtained in INT D 371. (Offered jointly by the Department of Biological Sciences and the Department of Medical Microbiology and Immunology.) [Biological Sciences]",
      "color": "#75dc4d"
    },
    {
      "id": 914,
      "title": "IMIN 401",
      "desc": "The phylogeny and evolution of immune systems. Examines the various strategies for disease resistance used by all organisms from plants to humans. The use and evolution of specific components of innate and adaptive immunity will be considered within the context of the biology of the organisms. This course involves both lectures and graded discussions. Prerequisites: IMIN 371. Credit cannot be obtained for both IMIN 401 and IMIN 501. (Offered jointly by the Departments of Biological Sciences and Medical Microbiology and Immunology). [Biological Sciences].",
      "color": "#75dc4d"
    },
    {
      "id": 915,
      "title": "IMIN 405",
      "desc": "This course covers topics of innate immunity with emphasis on strategies for pathogen recognition, local and systemic activation of the innate immune response, and regulation of innate effector mechanisms. Innate defense strategies against pathogens as well as detection and elimination of tumors will also be covered. Lectures will be followed by active discussions of selected readings pertaining to current research in the subject area. Prerequisites: IMIN 371 or consent of instructor. Credit cannot be obtained for both IMIN 405 and 505. (Offered jointly by the Departments of Biological Sciences and Medical Microbiology and Immunology). [Biological Sciences].",
      "color": "#75dc4d"
    },
    {
      "id": 917,
      "title": "IMIN 452",
      "desc": "A lecture course on the detailed mechanisms of the immune system, describing recent discoveries in cellular and molecular immunology. Topics include mechanisms of T-cell receptor selection, antigen processing, activation of B and T lymphocytes, cellular collaboration, negative and positive regulatory mechanisms in immunity, transplantation, cytokine actions and interactions, autoimmunity, interaction between immune systems and pathogens, and immunogenetics. Prerequisites: BIOCH 200 and IMIN 371. May not be taken for credit if credit already obtained in MMI 552. (Offered jointly by the Department of Biological Sciences, the Department of Medical Microbiology and Immunology and the Department of Oncology). [Biological Sciences]",
      "color": "#75dc4d"
    }
  ],
  "links": [
    { "source": 2, "target": 6, "type": "multiR" },
    { "source": 14, "target": 6, "type": "normR" },
    { "source": 642, "target": 6, "type": "multiR" },
    { "source": 759, "target": 12, "type": "multiR" },
    { "source": 6, "target": 12, "type": "multiC" },
    { "source": 1, "target": 13, "type": "multiR" },
    { "source": 642, "target": 13, "type": "multiR" },
    { "source": 2, "target": 13, "type": "multiC" },
    { "source": 14, "target": 13, "type": "normC" },
    { "source": 651, "target": 13, "type": "multiC" },
    { "source": 759, "target": 13, "type": "multiC" },
    { "source": 15, "target": 14, "type": "multiR" },
    { "source": 2, "target": 17, "type": "multiR" },
    { "source": 14, "target": 17, "type": "multiR" },
    { "source": 6, "target": 33, "type": "normR" },
    { "source": 759, "target": 33, "type": "multiR" },
    { "source": 669, "target": 33, "type": "multiR" },
    { "source": 7, "target": 34, "type": "multiR" },
    { "source": 5, "target": 35, "type": "multiR" },
    { "source": 5, "target": 37, "type": "normR" },
    { "source": 6, "target": 37, "type": "multiR" },
    { "source": 9, "target": 37, "type": "multiR" },
    { "source": 765, "target": 37, "type": "multiR" },
    { "source": 5, "target": 38, "type": "normR" },
    { "source": 6, "target": 38, "type": "multiR" },
    { "source": 9, "target": 38, "type": "multiR" },
    { "source": 651, "target": 38, "type": "normR" },
    { "source": 2, "target": 39, "type": "multiR" },
    { "source": 642, "target": 39, "type": "multiR" },
    { "source": 651, "target": 39, "type": "normR" },
    { "source": 759, "target": 39, "type": "multiR" },
    { "source": 5, "target": 41, "type": "multiR" },
    { "source": 14, "target": 41, "type": "normR" },
    { "source": 6, "target": 43, "type": "multiR" },
    { "source": 651, "target": 43, "type": "multiR" },
    { "source": 759, "target": 43, "type": "multiR" },
    { "source": 5, "target": 44, "type": "multiR" },
    { "source": 6, "target": 44, "type": "normR" },
    { "source": 5, "target": 46, "type": "normR" },
    { "source": 6, "target": 46, "type": "multiR" },
    { "source": 2, "target": 47, "type": "multiR" },
    { "source": 13, "target": 47, "type": "normR" },
    { "source": 6, "target": 48, "type": "multiR" },
    { "source": 759, "target": 48, "type": "multiR" },
    { "source": 6, "target": 49, "type": "normR" },
    { "source": 13, "target": 49, "type": "normR" },
    { "source": 648, "target": 49, "type": "multiR" },
    { "source": 5, "target": 50, "type": "normR" },
    { "source": 6, "target": 50, "type": "multiR" },
    { "source": 9, "target": 50, "type": "multiR" },
    { "source": 5, "target": 51, "type": "multiR" },
    { "source": 9, "target": 51, "type": "normR" },
    { "source": 5, "target": 52, "type": "normR" },
    { "source": 6, "target": 52, "type": "multiR" },
    { "source": 17, "target": 52, "type": "normR" },
    { "source": 31, "target": 68, "type": "normR" },
    { "source": 17, "target": 68, "type": "normR" },
    { "source": 6, "target": 70, "type": "multiR" },
    { "source": 43, "target": 70, "type": "multiR" },
    { "source": 665, "target": 70, "type": "normR" },
    { "source": 5, "target": 71, "type": "normR" },
    { "source": 6, "target": 71, "type": "multiR" },
    { "source": 43, "target": 71, "type": "multiR" },
    { "source": 665, "target": 71, "type": "normR" },
    { "source": 34, "target": 72, "type": "multiR" },
    { "source": 9, "target": 73, "type": "multiR" },
    { "source": 5, "target": 74, "type": "multiR" },
    { "source": 14, "target": 74, "type": "normR" },
    { "source": 5, "target": 75, "type": "multiR" },
    { "source": 43, "target": 75, "type": "multiR" },
    { "source": 643, "target": 75, "type": "multiR" },
    { "source": 644, "target": 75, "type": "multiR" },
    { "source": 5, "target": 76, "type": "multiR" },
    { "source": 9, "target": 76, "type": "multiR" },
    { "source": 43, "target": 78, "type": "multiR" },
    { "source": 759, "target": 78, "type": "multiR" },
    { "source": 43, "target": 79, "type": "multiR" },
    { "source": 759, "target": 79, "type": "multiR" },
    { "source": 13, "target": 80, "type": "multiR" },
    { "source": 48, "target": 80, "type": "normR" },
    { "source": 43, "target": 81, "type": "multiR" },
    { "source": 6, "target": 82, "type": "multiR" },
    { "source": 669, "target": 82, "type": "multiR" },
    { "source": 5, "target": 83, "type": "multiR" },
    { "source": 104, "target": 116, "type": "multiR" },
    { "source": 104, "target": 118, "type": "multiR" },
    { "source": 104, "target": 119, "type": "multiR" },
    { "source": 105, "target": 120, "type": "multiR" },
    { "source": 814, "target": 128, "type": "normR" },
    { "source": 814, "target": 129, "type": "normR" },
    { "source": 814, "target": 130, "type": "normR" },
    { "source": 379, "target": 130, "type": "normR" },
    { "source": 380, "target": 130, "type": "multiR" },
    { "source": 130, "target": 132, "type": "multiR" },
    { "source": 130, "target": 133, "type": "normR" },
    { "source": 131, "target": 133, "type": "multiR" },
    { "source": 130, "target": 134, "type": "normR" },
    { "source": 131, "target": 134, "type": "multiR" },
    { "source": 130, "target": 135, "type": "normR" },
    { "source": 131, "target": 135, "type": "multiR" },
    { "source": 130, "target": 136, "type": "normR" },
    { "source": 131, "target": 136, "type": "multiR" },
    { "source": 130, "target": 137, "type": "normR" },
    { "source": 131, "target": 137, "type": "multiR" },
    { "source": 130, "target": 138, "type": "normR" },
    { "source": 131, "target": 138, "type": "multiR" },
    { "source": 130, "target": 139, "type": "normR" },
    { "source": 131, "target": 139, "type": "multiR" },
    { "source": 130, "target": 140, "type": "normR" },
    { "source": 131, "target": 140, "type": "multiR" },
    { "source": 130, "target": 141, "type": "normR" },
    { "source": 131, "target": 141, "type": "multiR" },
    { "source": 130, "target": 142, "type": "normR" },
    { "source": 131, "target": 142, "type": "multiR" },
    { "source": 106, "target": 143, "type": "multiR" },
    { "source": 133, "target": 143, "type": "normR" },
    { "source": 130, "target": 144, "type": "multiR" },
    { "source": 130, "target": 145, "type": "normR" },
    { "source": 131, "target": 145, "type": "multiR" },
    { "source": 130, "target": 146, "type": "normR" },
    { "source": 131, "target": 146, "type": "multiR" },
    { "source": 130, "target": 147, "type": "multiR" },
    { "source": 130, "target": 148, "type": "multiR" },
    { "source": 149, "target": 148, "type": "normR" },
    { "source": 130, "target": 149, "type": "multiR" },
    { "source": 130, "target": 151, "type": "multiR" },
    { "source": 130, "target": 152, "type": "multiR" },
    { "source": 130, "target": 153, "type": "multiR" },
    { "source": 130, "target": 154, "type": "multiR" },
    { "source": 130, "target": 155, "type": "normR" },
    { "source": 131, "target": 155, "type": "multiR" },
    { "source": 130, "target": 156, "type": "normR" },
    { "source": 131, "target": 156, "type": "multiR" },
    { "source": 130, "target": 164, "type": "normR" },
    { "source": 131, "target": 164, "type": "multiR" },
    { "source": 130, "target": 165, "type": "normR" },
    { "source": 131, "target": 165, "type": "multiR" },
    { "source": 130, "target": 166, "type": "normR" },
    { "source": 131, "target": 166, "type": "multiR" },
    { "source": 130, "target": 168, "type": "normR" },
    { "source": 131, "target": 168, "type": "multiR" },
    { "source": 130, "target": 169, "type": "multiR" },
    { "source": 191, "target": 192, "type": "multiR" },
    { "source": 218, "target": 192, "type": "normR" },
    { "source": 191, "target": 201, "type": "multiR" },
    { "source": 379, "target": 218, "type": "normR" },
    { "source": 388, "target": 218, "type": "multiR" },
    { "source": 218, "target": 222, "type": "multiR" },
    { "source": 389, "target": 222, "type": "normR" },
    { "source": 218, "target": 223, "type": "multiR" },
    { "source": 389, "target": 223, "type": "normR" },
    { "source": 218, "target": 224, "type": "multiR" },
    { "source": 389, "target": 224, "type": "normR" },
    { "source": 225, "target": 225, "type": "normR" },
    { "source": 226, "target": 228, "type": "normR" },
    { "source": 230, "target": 229, "type": "multiR" },
    { "source": 222, "target": 230, "type": "multiR" },
    { "source": 224, "target": 230, "type": "normR" },
    { "source": 222, "target": 232, "type": "multiR" },
    { "source": 224, "target": 232, "type": "normR" },
    { "source": 223, "target": 233, "type": "normR" },
    { "source": 223, "target": 234, "type": "normR" },
    { "source": 224, "target": 234, "type": "normR" },
    { "source": 223, "target": 235, "type": "normR" },
    { "source": 224, "target": 235, "type": "normR" },
    { "source": 223, "target": 236, "type": "normR" },
    { "source": 223, "target": 237, "type": "normR" },
    { "source": 224, "target": 237, "type": "normR" },
    { "source": 223, "target": 238, "type": "normR" },
    { "source": 224, "target": 239, "type": "normR" },
    { "source": 239, "target": 240, "type": "normR" },
    { "source": 222, "target": 241, "type": "multiR" },
    { "source": 224, "target": 241, "type": "normR" },
    { "source": 222, "target": 246, "type": "multiR" },
    { "source": 224, "target": 246, "type": "multiR" },
    { "source": 230, "target": 246, "type": "multiR" },
    { "source": 223, "target": 247, "type": "multiR" },
    { "source": 233, "target": 247, "type": "multiR" },
    { "source": 233, "target": 248, "type": "normR" },
    { "source": 235, "target": 248, "type": "normR" },
    { "source": 223, "target": 249, "type": "normR" },
    { "source": 224, "target": 249, "type": "multiR" },
    { "source": 235, "target": 249, "type": "multiR" },
    { "source": 223, "target": 250, "type": "multiR" },
    { "source": 236, "target": 250, "type": "multiR" },
    { "source": 223, "target": 251, "type": "normR" },
    { "source": 224, "target": 251, "type": "multiR" },
    { "source": 237, "target": 251, "type": "multiR" },
    { "source": 287, "target": 288, "type": "multiR" },
    { "source": 287, "target": 289, "type": "multiR" },
    { "source": 133, "target": 291, "type": "multiR" },
    { "source": 133, "target": 292, "type": "multiR" },
    { "source": 133, "target": 293, "type": "multiR" },
    { "source": 130, "target": 294, "type": "multiR" },
    { "source": 106, "target": 294, "type": "multiR" },
    { "source": 133, "target": 295, "type": "multiR" },
    { "source": 287, "target": 301, "type": "multiR" },
    { "source": 287, "target": 302, "type": "multiR" },
    { "source": 218, "target": 323, "type": "normR" },
    { "source": 223, "target": 323, "type": "multiR" },
    { "source": 325, "target": 328, "type": "normR" },
    { "source": 331, "target": 328, "type": "normR" },
    { "source": 334, "target": 328, "type": "normC" },
    { "source": 332, "target": 328, "type": "normC" },
    { "source": 325, "target": 332, "type": "normR" },
    { "source": 331, "target": 332, "type": "normR" },
    { "source": 325, "target": 334, "type": "multiR" },
    { "source": 323, "target": 340, "type": "normR" },
    { "source": 379, "target": 347, "type": "normR" },
    { "source": 814, "target": 347, "type": "normR" },
    { "source": 218, "target": 351, "type": "multiR" },
    { "source": 218, "target": 352, "type": "multiR" },
    { "source": 100, "target": 352, "type": "multiR" },
    { "source": 354, "target": 357, "type": "normR" },
    { "source": 355, "target": 357, "type": "normR" },
    { "source": 354, "target": 358, "type": "normR" },
    { "source": 355, "target": 358, "type": "normR" },
    { "source": 351, "target": 359, "type": "multiR" },
    { "source": 354, "target": 360, "type": "normR" },
    { "source": 355, "target": 360, "type": "normR" },
    { "source": 354, "target": 361, "type": "normR" },
    { "source": 355, "target": 361, "type": "multiR" },
    { "source": 354, "target": 362, "type": "normR" },
    { "source": 355, "target": 362, "type": "normR" },
    { "source": 354, "target": 364, "type": "normR" },
    { "source": 355, "target": 364, "type": "normR" },
    { "source": 354, "target": 365, "type": "normR" },
    { "source": 355, "target": 365, "type": "normR" },
    { "source": 354, "target": 366, "type": "normR" },
    { "source": 355, "target": 366, "type": "multiR" },
    { "source": 354, "target": 375, "type": "normR" },
    { "source": 355, "target": 375, "type": "normR" },
    { "source": 354, "target": 376, "type": "normR" },
    { "source": 355, "target": 376, "type": "normR" },
    { "source": 380, "target": 386, "type": "multiR" },
    { "source": 383, "target": 386, "type": "multiR" },
    { "source": 386, "target": 387, "type": "normR" },
    { "source": 383, "target": 389, "type": "multiR" },
    { "source": 388, "target": 391, "type": "multiR" },
    { "source": 380, "target": 394, "type": "multiR" },
    { "source": 648, "target": 394, "type": "multiR" },
    { "source": 597, "target": 394, "type": "multiR" },
    { "source": 380, "target": 398, "type": "normR" },
    { "source": 383, "target": 398, "type": "multiR" },
    { "source": 389, "target": 398, "type": "normR" },
    { "source": 389, "target": 399, "type": "normR" },
    { "source": 385, "target": 399, "type": "multiR" },
    { "source": 398, "target": 399, "type": "multiR" },
    { "source": 384, "target": 400, "type": "normR" },
    { "source": 597, "target": 400, "type": "multiR" },
    { "source": 380, "target": 402, "type": "normR" },
    { "source": 389, "target": 402, "type": "multiR" },
    { "source": 380, "target": 403, "type": "multiR" },
    { "source": 643, "target": 403, "type": "multiR" },
    { "source": 394, "target": 405, "type": "normR" },
    { "source": 395, "target": 405, "type": "normR" },
    { "source": 218, "target": 411, "type": "normR" },
    { "source": 400, "target": 411, "type": "multiR" },
    { "source": 218, "target": 420, "type": "normR" },
    { "source": 402, "target": 420, "type": "normR" },
    { "source": 402, "target": 421, "type": "normR" },
    { "source": 218, "target": 421, "type": "normR" },
    { "source": 404, "target": 427, "type": "multiR" },
    { "source": 666, "target": 427, "type": "multiR" },
    { "source": 464, "target": 465, "type": "normR" },
    { "source": 648, "target": 469, "type": "multiR" },
    { "source": 597, "target": 469, "type": "multiR" },
    { "source": 467, "target": 469, "type": "multiR" },
    { "source": 648, "target": 470, "type": "multiR" },
    { "source": 597, "target": 470, "type": "multiR" },
    { "source": 598, "target": 470, "type": "multiR" },
    { "source": 469, "target": 470, "type": "multiR" },
    { "source": 616, "target": 472, "type": "multiR" },
    { "source": 469, "target": 473, "type": "multiR" },
    { "source": 477, "target": 480, "type": "multiR" },
    { "source": 478, "target": 480, "type": "normR" },
    { "source": 759, "target": 480, "type": "multiR" },
    { "source": 477, "target": 481, "type": "multiR" },
    { "source": 478, "target": 481, "type": "normR" },
    { "source": 477, "target": 482, "type": "multiR" },
    { "source": 478, "target": 482, "type": "normR" },
    { "source": 477, "target": 483, "type": "multiR" },
    { "source": 478, "target": 483, "type": "multiR" },
    { "source": 477, "target": 484, "type": "multiR" },
    { "source": 759, "target": 484, "type": "multiR" },
    { "source": 477, "target": 485, "type": "multiR" },
    { "source": 477, "target": 486, "type": "multiR" },
    { "source": 477, "target": 487, "type": "multiR" },
    { "source": 477, "target": 489, "type": "multiR" },
    { "source": 478, "target": 489, "type": "normR" },
    { "source": 477, "target": 491, "type": "multiR" },
    { "source": 478, "target": 491, "type": "normR" },
    { "source": 477, "target": 492, "type": "multiR" },
    { "source": 478, "target": 492, "type": "normR" },
    { "source": 481, "target": 498, "type": "multiR" },
    { "source": 481, "target": 500, "type": "multiR" },
    { "source": 483, "target": 501, "type": "multiR" },
    { "source": 478, "target": 502, "type": "normR" },
    { "source": 483, "target": 503, "type": "multiR" },
    { "source": 484, "target": 505, "type": "multiR" },
    { "source": 759, "target": 506, "type": "multiR" },
    { "source": 484, "target": 506, "type": "normR" },
    { "source": 485, "target": 509, "type": "multiR" },
    { "source": 477, "target": 511, "type": "multiR" },
    { "source": 478, "target": 511, "type": "normR" },
    { "source": 759, "target": 511, "type": "multiR" },
    { "source": 817, "target": 511, "type": "normR" },
    { "source": 759, "target": 514, "type": "multiR" },
    { "source": 486, "target": 514, "type": "multiR" },
    { "source": 759, "target": 521, "type": "multiR" },
    { "source": 477, "target": 522, "type": "multiR" },
    { "source": 478, "target": 522, "type": "normR" },
    { "source": 759, "target": 522, "type": "multiR" },
    { "source": 480, "target": 524, "type": "normR" },
    { "source": 481, "target": 524, "type": "multiR" },
    { "source": 759, "target": 526, "type": "multiR" },
    { "source": 480, "target": 526, "type": "normR" },
    { "source": 481, "target": 526, "type": "multiR" },
    { "source": 759, "target": 527, "type": "multiR" },
    { "source": 494, "target": 527, "type": "multiR" },
    { "source": 759, "target": 528, "type": "multiR" },
    { "source": 494, "target": 528, "type": "multiR" },
    { "source": 759, "target": 529, "type": "multiR" },
    { "source": 498, "target": 529, "type": "multiR" },
    { "source": 500, "target": 532, "type": "multiR" },
    { "source": 759, "target": 534, "type": "multiR" },
    { "source": 483, "target": 534, "type": "normR" },
    { "source": 480, "target": 535, "type": "multiR" },
    { "source": 498, "target": 535, "type": "multiR" },
    { "source": 480, "target": 536, "type": "multiR" },
    { "source": 501, "target": 536, "type": "multiR" },
    { "source": 506, "target": 539, "type": "multiR" },
    { "source": 504, "target": 540, "type": "multiR" },
    { "source": 484, "target": 541, "type": "normR" },
    { "source": 510, "target": 542, "type": "multiR" },
    { "source": 759, "target": 546, "type": "multiR" },
    { "source": 505, "target": 546, "type": "multiR" },
    { "source": 483, "target": 553, "type": "multiR" },
    { "source": 814, "target": 577, "type": "normR" },
    { "source": 383, "target": 577, "type": "multiR" },
    { "source": 388, "target": 577, "type": "normR" },
    { "source": 577, "target": 578, "type": "normR" },
    { "source": 218, "target": 578, "type": "multiR" },
    { "source": 577, "target": 580, "type": "multiR" },
    { "source": 218, "target": 580, "type": "multiR" },
    { "source": 578, "target": 582, "type": "normR" },
    { "source": 586, "target": 586, "type": "multiR" },
    { "source": 586, "target": 592, "type": "normR" },
    { "source": 642, "target": 599, "type": "multiR" },
    { "source": 649, "target": 600, "type": "multiC" },
    { "source": 597, "target": 602, "type": "multiR" },
    { "source": 598, "target": 602, "type": "multiR" },
    { "source": 646, "target": 602, "type": "multiR" },
    { "source": 599, "target": 603, "type": "multiR" },
    { "source": 601, "target": 603, "type": "multiR" },
    { "source": 648, "target": 603, "type": "normR" },
    { "source": 597, "target": 604, "type": "multiR" },
    { "source": 598, "target": 604, "type": "multiR" },
    { "source": 642, "target": 604, "type": "multiR" },
    { "source": 1, "target": 604, "type": "multiR" },
    { "source": 597, "target": 606, "type": "multiR" },
    { "source": 598, "target": 606, "type": "multiR" },
    { "source": 646, "target": 606, "type": "multiR" },
    { "source": 608, "target": 609, "type": "multiC" },
    { "source": 664, "target": 609, "type": "multiC" },
    { "source": 608, "target": 610, "type": "multiC" },
    { "source": 664, "target": 610, "type": "multiC" },
    { "source": 642, "target": 611, "type": "multiR" },
    { "source": 597, "target": 611, "type": "multiR" },
    { "source": 598, "target": 611, "type": "multiR" },
    { "source": 597, "target": 612, "type": "multiR" },
    { "source": 598, "target": 612, "type": "multiR" },
    { "source": 607, "target": 613, "type": "multiC" },
    { "source": 643, "target": 613, "type": "multiC" },
    { "source": 602, "target": 615, "type": "multiR" },
    { "source": 643, "target": 615, "type": "multiR" },
    { "source": 597, "target": 616, "type": "multiR" },
    { "source": 598, "target": 616, "type": "multiR" },
    { "source": 616, "target": 617, "type": "multiR" },
    { "source": 664, "target": 617, "type": "multiR" },
    { "source": 606, "target": 619, "type": "normR" },
    { "source": 643, "target": 619, "type": "multiR" },
    { "source": 607, "target": 620, "type": "multiR" },
    { "source": 603, "target": 621, "type": "multiR" },
    { "source": 617, "target": 623, "type": "normR" },
    { "source": 620, "target": 623, "type": "normR" },
    { "source": 693, "target": 623, "type": "multiR" },
    { "source": 604, "target": 624, "type": "multiR" },
    { "source": 628, "target": 624, "type": "normR" },
    { "source": 605, "target": 625, "type": "multiR" },
    { "source": 620, "target": 627, "type": "normR" },
    { "source": 693, "target": 627, "type": "multiR" },
    { "source": 683, "target": 627, "type": "multiR" },
    { "source": 620, "target": 629, "type": "normR" },
    { "source": 625, "target": 629, "type": "multiR" },
    { "source": 627, "target": 629, "type": "normR" },
    { "source": 644, "target": 668, "type": "multiR" },
    { "source": 650, "target": 668, "type": "multiR" },
    { "source": 642, "target": 669, "type": "multiR" },
    { "source": 644, "target": 669, "type": "multiR" },
    { "source": 661, "target": 677, "type": "normR" },
    { "source": 664, "target": 677, "type": "normR" },
    { "source": 661, "target": 678, "type": "normR" },
    { "source": 664, "target": 678, "type": "normR" },
    { "source": 661, "target": 679, "type": "normR" },
    { "source": 664, "target": 679, "type": "normR" },
    { "source": 670, "target": 687, "type": "multiR" },
    { "source": 644, "target": 691, "type": "multiR" },
    { "source": 664, "target": 691, "type": "multiR" },
    { "source": 669, "target": 692, "type": "multiR" },
    { "source": 664, "target": 692, "type": "multiR" },
    { "source": 664, "target": 693, "type": "multiR" },
    { "source": 661, "target": 693, "type": "multiR" },
    { "source": 644, "target": 697, "type": "multiR" },
    { "source": 664, "target": 697, "type": "multiR" },
    { "source": 644, "target": 700, "type": "multiR" },
    { "source": 664, "target": 700, "type": "multiR" },
    { "source": 644, "target": 701, "type": "multiR" },
    { "source": 664, "target": 701, "type": "multiR" },
    { "source": 644, "target": 702, "type": "multiR" },
    { "source": 664, "target": 702, "type": "multiR" },
    { "source": 644, "target": 703, "type": "multiR" },
    { "source": 664, "target": 703, "type": "multiR" },
    { "source": 689, "target": 711, "type": "multiR" },
    { "source": 686, "target": 711, "type": "normR" },
    { "source": 670, "target": 712, "type": "multiR" },
    { "source": 689, "target": 713, "type": "multiR" },
    { "source": 690, "target": 713, "type": "normR" },
    { "source": 690, "target": 719, "type": "multiC" },
    { "source": 782, "target": 724, "type": "normR" },
    { "source": 724, "target": 728, "type": "normR" },
    { "source": 670, "target": 740, "type": "multiR" },
    { "source": 719, "target": 740, "type": "normR" },
    { "source": 693, "target": 742, "type": "multiR" },
    { "source": 683, "target": 747, "type": "multiR" },
    { "source": 717, "target": 747, "type": "normR" },
    { "source": 737, "target": 748, "type": "normR" },
    { "source": 735, "target": 754, "type": "normR" },
    { "source": 669, "target": 767, "type": "multiC" },
    { "source": 666, "target": 767, "type": "multiC" },
    { "source": 666, "target": 768, "type": "multiR" },
    { "source": 767, "target": 768, "type": "normR" },
    { "source": 674, "target": 771, "type": "normR" },
    { "source": 766, "target": 771, "type": "multiR" },
    { "source": 766, "target": 777, "type": "normR" },
    { "source": 775, "target": 778, "type": "normR" },
    { "source": 776, "target": 778, "type": "normR" },
    { "source": 775, "target": 783, "type": "normR" },
    { "source": 776, "target": 783, "type": "normR" },
    { "source": 765, "target": 786, "type": "multiR" },
    { "source": 786, "target": 790, "type": "multiR" },
    { "source": 772, "target": 797, "type": "multiR" },
    { "source": 782, "target": 801, "type": "normR" },
    { "source": 791, "target": 801, "type": "normR" },
    { "source": 776, "target": 803, "type": "normR" },
    { "source": 791, "target": 808, "type": "normR" },
    { "source": 799, "target": 808, "type": "normR" },
    { "source": 799, "target": 809, "type": "multiR" },
    { "source": 814, "target": 814, "type": "multiR" },
    { "source": 814, "target": 819, "type": "normR" },
    { "source": 815, "target": 819, "type": "multiR" },
    { "source": 816, "target": 822, "type": "multiR" },
    { "source": 814, "target": 824, "type": "normR" },
    { "source": 815, "target": 824, "type": "multiR" },
    { "source": 577, "target": 824, "type": "normR" },
    { "source": 818, "target": 825, "type": "normR" },
    { "source": 760, "target": 825, "type": "multiR" },
    { "source": 818, "target": 826, "type": "normR" },
    { "source": 646, "target": 826, "type": "multiR" },
    { "source": 760, "target": 826, "type": "multiR" },
    { "source": 818, "target": 827, "type": "normR" },
    { "source": 760, "target": 827, "type": "multiR" },
    { "source": 646, "target": 827, "type": "multiR" },
    { "source": 379, "target": 830, "type": "multiR" },
    { "source": 818, "target": 830, "type": "normR" },
    { "source": 577, "target": 830, "type": "normR" },
    { "source": 818, "target": 831, "type": "multiR" },
    { "source": 383, "target": 831, "type": "multiR" },
    { "source": 818, "target": 840, "type": "multiR" },
    { "source": 817, "target": 841, "type": "normR" },
    { "source": 218, "target": 841, "type": "multiR" },
    { "source": 111, "target": 847, "type": "multiR" },
    { "source": 759, "target": 849, "type": "multiR" },
    { "source": 826, "target": 850, "type": "multiR" },
    { "source": 760, "target": 850, "type": "multiR" },
    { "source": 837, "target": 855, "type": "multiR" },
    { "source": 648, "target": 856, "type": "multiR" },
    { "source": 760, "target": 856, "type": "multiR" },
    { "source": 826, "target": 856, "type": "multiR" },
    { "source": 889, "target": 895, "type": "multiR" },
    { "source": 580, "target": 899, "type": "multiR" },
    { "source": 891, "target": 900, "type": "multiR" },
    { "source": 896, "target": 901, "type": "normR" },
    { "source": 895, "target": 901, "type": "multiR" },
    { "source": 817, "target": 911, "type": "multiR" },
    { "source": 218, "target": 911, "type": "multiR" },
    { "source": 218, "target": 912, "type": "multiR" },
    { "source": 910, "target": 912, "type": "normR" },
    { "source": 912, "target": 914, "type": "normR" },
    { "source": 912, "target": 915, "type": "normR" },
    { "source": 218, "target": 917, "type": "normR" },
    { "source": 912, "target": 917, "type": "normR" }
  ]
}
