{
  "nodes": [
    {
      "id": 1,
      "title": "BIOL 107",
      "desc": "This class is mostly reviewing and expanding on things learned in high school. It covers cell biology which means it isn’t the most interesting class. There’s lots of details to learn about the topics presented in class. The class has a lot of memorization and the midterm marks aren’t usually great because people don’t expect how hard it is. The final is easier than the midterm. The lab is pretty monotonous  but the assignments aren’t very complicated."
    },
    {
      "id": 3,
      "title": "BIOL 108",
      "desc": "This is a content heavy course that is focused on biological diversity, phylogeny, and the changing characteristics of animals and plants as they evolve. There is very little reasoning and problem solving in this course- almost pure memorization. The labs are generally interesting as they help you understand what’s learned in class and you can be very successful if you work hard on the assignments. Not the most enjoyable course (unless you like evolution), but the information is important."
    },
    {
      "id": 4,
      "title": "CHEM 101",
      "desc": "This is a general chemistry class and required, not much else to say, it's like high school but harder. There is very little math, and this is mostly theory based."
    },
    {
      "id": 5,
      "title": "CHEM 102",
      "desc": "This course is similar in content to Chemistry 30 from the Alberta High School curriculum. (Covers equilibrium, acids and bases, and some newer content as well). Many practice questions are given: make sure you do them all! The exams are often more similar to problem sets generated by professors than to the textbook questions. This course is very math heavy."
    },
    {
      "id": 6,
      "title": "STAT 151",
      "desc": "Stats 151 explains the base knowledge of statistics. There’s typically some group work which can be a bit of a burden (especially if your group members don’t contribute.) Most professors give lots of practice questions, and it is good to see in which situations you would use a particular method of statistical analysis. Although it’s not the most intriguing class, the information you learn is very useful as you will need to apply your knowledge to other courses (especially Biology).\n\n\n\nMake sure you complete all the practice questions, as the exams are very similar in style and this will help you prepare well!"
    },
    { "id": 7, "title": "MATH 125" },
    {
      "id": 8,
      "title": "MATH 134",
      "desc": "This course is basically a review of Math 31, if you took calculus in high school. No calculator is allowed on exams, so you have to memorize the formulas. There are online homework questions due every Tuesday. Every week there are also written questions you must submit on Thursdays. This class requires a lot of time and practice, especially if you haven’t taken calculus, but there are lots of online resources available if you need help. \n\n"
    },
    {
      "id": 9,
      "title": "BIOL 208",
      "desc": "This class centered around Ecology. For those of you who love population dynamics and the hardy weinberg principle, you’ll do great. For those of you, in the imin program and are interested in infection/immunology, this course is boring. Also, make sure you take this course in the fall, as the first two lab sessions involve walking around outside identifying trees. The lab component does not require you to wear lab coats."
    },
    {
      "id": 10,
      "title": "BIOL 207",
      "desc": "This course introduces you to genetics and common laboratory techniques. It is not too hard, although the curve can be very high. The lab assignments can be very tedious and time consuming, but they are not too difficult. "
    },
    {
      "id": 11,
      "title": "GENET 270",
      "desc": "Genet 270 focuses on the organization of genetic material and its expression in bacteria and viruses. It also covers many of the past experiments that lead to the discovery of a concept. This course is memorization heavy with the midterm and final testing specifics, as well as experiment design questions."
    },
    {
      "id": 12,
      "title": "BIOL 201",
      "desc": "This class is a more in depth explanation of concepts that are already familiar to you—such as explanations about apoptosis and the cell cycle. Most of it is based on memorizing information rather than processes. The assignments are based on journal articles and aren’t the hardest.\n\n\n\nTake Cell 201- it’s supposed to be easier than Bio 201!"
    },
    {
      "id": 13,
      "title": "CELL 201",
      "desc": "This class has 3 non cumulative midterms and no final. There are 2 assignments which are not too time consuming. It covers similar materials to BIOL 107, but more in depth. It is very helpful for signalling pathways seen in later immunology classes. The class goes in depth on cellular signalling, cell transduction and various common pathways seen frequently in cell biology. Paul LaPointe is a very good professor and always makes time for his students. \n\n"
    },
    {
      "id": 14,
      "title": "MICRB 265",
      "desc": "This course talks about bacteria and archaea. It can be very memorization heavy. The labs are very interesting and are helpful in supplementing the lecture material. When in person, the lab final is not nearly as hard as it is made out to be."
    },
    {
      "id": 15,
      "title": "CHEM 261",
      "desc": "This chemistry class is an organic chem class and can be more enjoyable than general chemistry if you found that thermodynamics was not your favourite lesson. However, this organic chemistry is much harder than high school, but can still be enjoyable if you like drawing pictures and long lab classes.\n\n\n\nMake sure you take the labs in the afternoon as they are timely and you can sometimes go overtime, however the labs are easier to complete than the 100 level labs. This way you are not rushing to finish or rushing to a class after.   "
    },
    {
      "id": 17,
      "title": "BIOCH 330",
      "desc": "Biochem 330 is taught in two halves and the final is non-cumulative. The first half of the course focuses on DNA structure and replication. The second part is more about RNA and its modification (splicing) and gene expression. The first half of the course is way easier than the second. The class focuses on biochem processes but there is still a lot of memorization and the tests can be hard, especially because most people in the class are in honours programs. "
    },
    {
      "id": 18,
      "title": "BIOCH 200",
      "desc": "BIOCH 200 explains the base knowledge of Biomolecules, Nucleic Acids, Proteins, Enzymes, Metabolism, Oxidative Phosphorylation, Glycolysis, and the Citric Acid Cycle. It is quite interesting and concepts can be linked between topics. However, the questions on the test can be taken in many ways and that makes them more difficult to answer. The wording of a question can easily change the correct answer. Overall a genuinely enjoyable course. The content isn’t difficult, it's the time restraint on the exam that makes the exam a challenge. "
    },
    {
      "id": 19,
      "title": "CHEM 263",
      "desc": "Chem 263 is different from chem 261 because it is almost all about carbonyl chemistry. 263 has a lot more memorization of different reactions and is a lot less theory based. Depending on whether or not you like learning lots of reactions the class may be harder than 261. The lab for this is in the same format as Chem 261, but they can be very long."
    },
    {
      "id": 20,
      "title": "IMIN 200",
      "desc": "This is the first imin course you will be able to take, and it is an excellent introduction to immunology and provides the background information that will help you in later imin and MMI courses. The class has three main parts, innate and adaptive immunity, bacteriology and virology, each taught by a different professor and each an excellent opportunity to learn about the wide field that is immunology. The class is heavily focused on memorization with some application questions."
    },
    { "id": 21, "title": "NEURO 210" },
    { "id": 22, "title": "PSYCH 275" },
    {
      "id": 23,
      "title": "PSYCO 104",
      "desc": "This is a general introductory course, it pairs with psych 105. It is mostly memorization of concepts with very little application. Exams are multiple choice. This class is mostly taken as an easy science option and a GPA booster. The class does require research participation, that you must schedule a head of time, that counts for a portion of your grade."
    },
    { "id": 24, "title": "PHYSL 212" },
    { "id": 25, "title": "PHYSL 214" },
    {
      "id": 26,
      "title": "IMIN 324",
      "desc": "This course is the introduction to virology. It is genuinely interesting and covers a ton of topics. However, it is an 8am, which can be very difficult to be mentally present in. Viral genetics, subviral particles, courses of infection, cancer, vaccines, antivirals,hepatitis and relevant public health topics are all covered, but there is an almost overwhelming amount of information, especially in the first half. The tests can be very long, but the information is valuable and interesting. "
    },
    {
      "id": 27,
      "title": "IMIN 371",
      "desc": "This course is split into 3 sections each taught by a different professor; inflammation and innate immunity, lymphocytes, and adaptive immunity with multiple guest lectures and different topics, and is non cumulative. It builds on what you learnt in the first section of IMIN 200. I found the first section to be the least information dense, and the third to contain a ton of information, but it was my favourite section. The guest lectures were all extremely interesting as well. The tests are more application type questions."
    },
    {
      "id": 28,
      "title": "IMIN 452",
      "desc": "This class can be a bit difficult, but the professors and TA’s really want you to do well and offer lots of ways to practice and are very good about answering questions. Most of the concepts have been learnt in IMIN 371 and this course focuses more on problem solving and data interpretation. The exams are all open book. Attend the seminars, and use the toolboxes that the TAs present as a resource for the exams."
    },
    {
      "id": 29,
      "title": "MMI 351",
      "desc": "This course focuses on medically important bacteria, how they cause disease and the body’s immune response. Each lecture presents you with a complete “pathogen profile”, and exams are heavy memorization.The textbook is online and is free, and there are optional readings assigned. Dr. Bhavsar talks fast, as a result he can skip over concepts. Read the textbook to clear up any confusion. Judy Gnarpe teaches the second half of the course. She is very kind and very approachable if you have questions.\n\n"
    },
    {
      "id": 30,
      "title": "ZOOL 352",
      "desc": "This course is the principles of parasitism. It introduces you to protozoan, helminth and arthropod parasites of animals and humans. There is also an immunology portion that focuses on host defense and immunity against parasites. Seminars are interesting and an opportunity for easy marks, must attend because the material is on the exam.\n\n"
    },
    {
      "id": 31,
      "title": "BIOCH 430",
      "desc": "Easier than 320, but not as interesting as 330, a good choice of a 400 level biochem if you have to do one. A kind curve"
    },
    {
      "id": 32,
      "title": "BIOCH 320",
      "desc": "This course focuses on proteins, lipids, and carbohydrates. The first half of the course focuses on proteins and amino acids, while the other half is spent on carbohydrates and lipids. The protein information is very useful for lab work, and some common techniques are explained. The tests are not as tricky as they were in BIOCH 200, but some questions still follow the “all of the above”, “none of the above” “a and c” “a and b” nightmare from biochemistry 200.\n\n"
    },
    {
      "id": 33,
      "title": "GENET 304",
      "desc": "This course focuses on eukaryotic gene expression. It’s a great compliment to MICRB 316, as there is definite overlap between the courses. There were two midterms and a final. The first midterm was extremely hard, with something like a 50% average. However, KKJ did raise everyone’s grade by about 20%. I would recommend taking this course – I’ve found that it provides a lot of background info on many topics that are briefly discussed in many other courses.  "
    },
    {
      "id": 34,
      "title": "MICRB 316",
      "desc": "This course focuses on prokaryotic gene regulation, you’ll learn a bunch about cool regulatory systems in bacteria and the like, typically this course has a midterm, final, and a paper on a topic of your choice. \n\n\n\nThis course is a continuation of Genet 270 with even more in depth concepts. It relies heavily on information from 270, so it is critical that you have it as a prerequisite. You learn factors that affect prokaryotic gene expression at the levels of replication, transcription, post-transcription, post-translational and post-translational control in great detail. I found this to be a very interesting course, however it is heavy memorization with very specific exam questions.\n\n\n\nI found MICRB 316 to be a handy compliment to MMI 351, as it goes into detail on some topics that 351 only scratched the surface of. It came in handy on some of the midterms!\n\n"
    }
  ],
  "links": [
    { "source": 3, "target": 9 },
    { "source": 4, "target": 5 },
    { "source": 1, "target": 10 },
    { "source": 1, "target": 12 },
    { "source": 1, "target": 13 },
    { "source": 10, "target": 11 },
    { "source": 1, "target": 14 },
    { "source": 4, "target": 12 },
    { "source": 15, "target": 13 },
    { "source": 4, "target": 15 },
    { "source": 5, "target": 17 },
    { "source": 15, "target": 14 },
    { "source": 15, "target": 18 },
    { "source": 15, "target": 19 },
    { "source": 18, "target": 20 },
    { "source": 14, "target": 20 },
    { "source": 19, "target": 17 },
    { "source": 18, "target": 17 },
    { "source": 22, "target": 21 },
    { "source": 23, "target": 22 },
    { "source": 1, "target": 24 },
    { "source": 4, "target": 24 },
    { "source": 5, "target": 24 },
    { "source": 15, "target": 24 },
    { "source": 24, "target": 25 },
    { "source": 10, "target": 26 },
    { "source": 20, "target": 26 },
    { "source": 18, "target": 26 },
    { "source": 18, "target": 27 },
    { "source": 10, "target": 27 },
    { "source": 20, "target": 27 },
    { "source": 18, "target": 28 },
    { "source": 27, "target": 28 },
    { "source": 14, "target": 29 },
    { "source": 20, "target": 29 },
    { "source": 20, "target": 30 },
    { "source": 17, "target": 31 },
    { "source": 18, "target": 32 },
    { "source": 5, "target": 32 },
    { "source": 19, "target": 32 },
    { "source": 32, "target": 31 },
    { "source": 11, "target": 33 },
    { "source": 11, "target": 34 },
    { "source": 14, "target": 34 },
    { "source": 18, "target": 34 },
    { "source": 19, "target": 24 }
  ]
}
